Repository: RMerl/asuswrt-merlin
Catalog: release/src/router/util-linux/po/*.po
Languages: pl

source: /dev/%s: cannot open as standard input: %m
pl: /dev/%s: nie mo¿na otworzyæ jako standardowe wej¶cie: %m

source: /dev/%s: not a character device
pl: /dev/%s: to nie jest urz±dzenie znakowe

source: %s: not open for read/write
pl: %s: nie jest otwarte do odczytu i zapisu

source: %s: dup problem: %m
pl: %s: problem z dup: %m

source: Num Lock off
pl: Num Lock wy³±czony

source: Num Lock on
pl: Num Lock w³±czony

source: Caps Lock on
pl: Caps Lock w³±czony

source: Scroll Lock on
pl: Scroll Lock w³±czony

source: Hint: %s
pl: Uwaga: %s

source: %s: input overrun
pl: %s: przepe³nienie wej¶cia

source: Usage: %1$s [options] line baud_rate,... [termtype] %1$s [options] baud_rate,... line [termtype]
pl: Sk³adnia: %1$s [opcje] linia szybko¶æ,... [typ_terminala] %1$s [opcje] szybko¶æ,... linia [typ_terminala]

source: Options: -8, --8bits assume 8-bit tty -a, --autologin <user> login the specified user automatically -c, --noreset do not reset control mode -f, --issue-file <file> display issue file -h, --flow-control enable hardware flow control -H, --host <hostname> specify login host -i, --noissue do not display issue file -I, --init-string <string> set init string -l, --login-program <file> specify login program -L, --local-line force local line -m, --extract-baud extract baud rate during connect -n, --skip-login do not prompt for login -o, --login-options <opts> options that are passed to login -p, --loginpause wait for any key before the login -R, --hangup do virtually hangup on the tty -s, --keep-baud try to keep baud rate after break -t, --timeout <number> login process timeout -U, --detect-case detect uppercase terminal -w, --wait-cr wait carriage-return --noclear do not clear the screen before prompt --nonewline do not print a newline before issue --no-hostname no hostname at all will be shown --long-hostname show full qualified hostname --version output version information and exit --help display this help and exit
pl: Opcje: -8, --8bits przyjêcie terminala 8-bitowego -a, --autologin <u¿ytkownik> automatyczne zalogowanie podanego u¿ytkownika -c, --noreset bez resetowania trybu steruj±cego -f, --issue-file <plik> wy¶wietlenie pliku wydania (issue) -h, --flow-control w³±czenie sprzêtowej kontroli przep³ywu -H, --host <host> podanie hosta logowania -i, --noissue bez wy¶wietlania pliku wydania (issue) -I, --init-string <³añcuch> podanie ³añcucha inicjuj±cego -l, --login-program <plik> okre¶lenie programu login -L, --local-line wymuszenie linii lokalnej -m, --extract-baud wyci±gniêcie szybko¶ci w bodach przy po³±czeniu -n, --skip-login bez pytania o nazwê logowania -o, --login-options <opcje> opcje przekazywane do programu login -p, --loginpause oczekiwanie na dowolny klawisz przed logowaniem -R, --hangup wirtualne roz³±czenie na terminalu -s, --keep-baud zachowanie szybko¶ci w bodach po sygnale break -t, --timeout <liczba> limit czasu procesu login -U, --detect-case wykrywanie terminala z samymi wielkimi literami -w, --wait-cr oczekiwanie na znak powrotu karetki (CR) --noclear bez czyszczenia ekranu przed wypisaniem zachêty --nonewline bez wypisywania znaku nowej linii przed issue --no-hostname bez wy¶wietlania nazwy hosta --long-hostname wy¶wietlenie pe³nej nazwy hosta (z domen±) --version wypisanie informacji o wersji i zakoñczenie --help wy¶wietlenie tego opisu i zakoñczenie

source: user
pl: u¿ytkownik

source: users
pl: u¿ytkowników

source: %s [options] [y | n]
pl: %s [opcje] [y | n]

source: -v, --verbose explain what is being done -V, --version output version information and exit -h, --help output help screen and exit
pl: -v, --verbose wyja¶nianie wykonywanych czynno¶ci -V, --version wypisanie informacji o wersji i zakoñczenie -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: ttyname failed
pl: ttyname nie powiod³o siê

source: stat %s failed
pl: stat %s nie powiod³o siê

source: is y
pl: jest w³±czone (y)

source: is n
pl: jest wy³±czone (n)

source: change %s mode failed
pl: zmiana uprawnieñ %s nie powiod³a siê

source: write access to your terminal is allowed
pl: zapis na terminal u¿ytkownika jest dozwolony

source: write access to your terminal is denied
pl: zapis na terminal u¿ytkownika jest niedozwolony

source: invalid argument: %c
pl: b³êdny argument: %c

source: output file `%s' is a link Use --force if you really want to use it. Program not started.
pl: plik wyj¶ciowy `%s' jest dowi±zaniem. Proszê u¿yæ opcji --force, je¿eli naprawdê ma by u¿yty. Skrypt nie uruchomiony.

source: %s [options] [file]
pl: %s [opcje] [plik]

source: -a, --append append the output -c, --command <command> run command rather than interactive shell -r, --return return exit code of the child process -f, --flush run flush after each write --force use output file even when it is a link -q, --quiet be quiet -t, --timing[=<file>] output timing data to stderr (or to FILE) -V, --version output version information and exit -h, --help display this help and exit
pl: -a, --append do³±czenie wyj¶cia -c, --command <polecenie> uruchomienie polecenia zamiast pow³oki interaktywnej -r, --return zwrócenie kodu wyj¶cia procesu potomnego -f, --flush wywo³anie flush po ka¿dym zapisie --force u¿ycie pliku wyj¶ciowego nawet gdy jest dowi±zaniem -q, --quiet tryb cichy -t, --timing[=<plik>] wypisanie danych czasowych na stderr (lub do pliku) -V, --version wypisanie informacji o wersji i zakoñczenie -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: cannot open timing file %s
pl: nie mo¿na otworzyæ pliku czasów %s

source: Script started, file is %s
pl: Skrypt uruchomiony, plik to %s

source: Script started on %s
pl: Skrypt uruchomiony %s

source: cannot write script file
pl: nie mo¿na zapisaæ pliku skryptu

source: Script done on %s
pl: Skrypt wykonany %s

source: Script done, file is %s
pl: Skrypt wykonany, plik to %s

source: openpty failed
pl: openpty nie powiod³o siê

source: out of pty's
pl: brak wolnych pty

source: %s [-t] timingfile [typescript] [divisor]
pl: %s [-t] plik_czasów [skrypt] [dzielnik]

source: -t, --timing <file> script timing output file -s, --typescript <file> script terminal session output file -d, --divisor <num> speed up or slow down execution with time divisor -V, --version output version information and exit -h, --help display this help and exit
pl: -t, --timing <plik> plik wyj¶ciowy czasów skryptu -s, --typescript <plik> plik wyj¶ciowy sesji terminala skryptu -d, --divisor <ile> przyspieszenie lub zwolnienie wykonywania tyle razy -V, --version wypisanie informacji o wersji i zakoñczenie -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: expected a number, but got '%s'
pl: oczekiwano liczby, otrzymano '%s'

source: divisor '%s'
pl: dzielnik '%s'

source: write to stdout failed
pl: zapis na standardowe wyj¶cie nie powiód³ siê

source: unexpected end of file on %s
pl: nieoczekiwany koniec pliku %s

source: failed to read typescript file %s
pl: nie uda³o siê odczytaæ pliku skryptu %s

source: wrong number of arguments
pl: b³êdna liczba argumentów

source: cannot open typescript file %s
pl: nie mo¿na otworzyæ pliku skryptu %s

source: failed to read timing file %s
pl: nie uda³o siê odczytaæ pliku czasów %s

source: timings file %s: %lu: unexpected format
pl: plik czasów %s: %lu: nieoczekiwany format

source: Argument error.
pl: B³±d argumentu.

source: -term <terminal_name> -reset -initialize -cursor <on|off> -repeat <on|off> -appcursorkeys <on|off> -linewrap <on|off> -default -foreground <black|blue|green|cyan|red|magenta|yellow|white|default> -background <black|blue|green|cyan|red|magenta|yellow|white|default> -ulcolor <black|grey|blue|green|cyan|red|magenta|yellow|white> -ulcolor <bright blue|green|cyan|red|magenta|yellow|white> -hbcolor <black|grey|blue|green|cyan|red|magenta|yellow|white> -hbcolor <bright blue|green|cyan|red|magenta|yellow|white> -inversescreen <on|off> -bold <on|off> -half-bright <on|off> -blink <on|off> -reverse <on|off> -underline <on|off> -store > -clear <all|rest> -tabs < tab1 tab2 tab3 ... > (tabn = 1-160) -clrtabs < tab1 tab2 tab3 ... > (tabn = 1-160) -regtabs <1-160> -blank <0-60|force|poke> -dump <1-NR_CONSOLES> -append <1-NR_CONSOLES> -file dumpfilename -msg <on|off> -msglevel <0-8> -powersave <on|vsync|hsync|powerdown|off> -powerdown <0-60> -blength <0-2000> -bfreq freqnumber -version -help
pl: -term <nazwa_terminala> -reset -initialize -cursor <on|off> -repeat <on|off> -appcursorkeys <on|off> -linewrap <on|off> -default -foreground <black|blue|green|cyan|red|magenta|yellow|white|default> -background <black|blue|green|cyan|red|magenta|yellow|white|default> -ulcolor <black|grey|blue|green|cyan|red|magenta|yellow|white> -ulcolor <bright blue|green|cyan|red|magenta|yellow|white> -hbcolor <black|grey|blue|green|cyan|red|magenta|yellow|white> -hbcolor <bright blue|green|cyan|red|magenta|yellow|white> -inversescreen <on|off> -bold <on|off> -half-bright <on|off> -blink <on|off> -reverse <on|off> -underline <on|off> -store > -clear <all|rest> -tabs < tab1 tab2 tab3 ... > (tabn = 1-160) -clrtabs < tab1 tab2 tab3 ... > (tabn = 1-160) -regtabs <1-160> -blank <0-60|force|poke> -dump <1-LICZBA_KONSOL> -append <1-LICZBA_KONSOL> -file plik_zrzutu -msg <on|off> -msglevel <0-8> -powersave <on|vsync|hsync|powerdown|off> -powerdown <0-60> -blength <0-2000> -bfreq czêstotliwo¶æ -version -help

source: For more information see lsblk(1).
pl: Wiêcej informacji w setterm(1).

source: cannot force blank
pl: nie mo¿na wymusiæ wygaszenia

source: cannot force unblank
pl: nie mo¿na wymusiæ braku wygaszenia

source: cannot get blank status
pl: nie mo¿na odczytaæ stanu wygaszenia

source: cannot (un)set powersave mode
pl: nie mo¿na w³±czyæ/wy³±czyæ trybu oszczêdzania energii

source: can not open dump file %s for output
pl: nie mo¿na otworzyæ pliku zrzutu %s do zapisu

source: klogctl error
pl: b³±d klogctl

source: Error writing screendump
pl: B³±d zapisu zrzutu ekranu

source: Couldn't read %s
pl: Nie mo¿na odczytaæ %s

source: $TERM is not defined.
pl: Nie zdefiniowano $TERM.

source: terminfo database cannot be found
pl: nie znaleziono bazy danych terminfo

source: %s: unknown terminal type
pl: %s: nieznany typ sygna³u

source: terminal is hardcopy
pl: terminal o trwa³ym zapisie

source: too many iov's (change code in wall/ttymsg.c)
pl: zbyt du¿o iov (trzeba zmieniæ kod w wall/ttymsg.c)

source: excessively long line arg
pl: zbyt d³ugi argument

source: cannot fork
pl: nie mo¿na wykonaæ fork

source: %s: BAD ERROR, message is far too long
pl: %s: Z£Y B£¡D, komunikat jest o wiele za d³ugi

source: %s [options] [<file>]
pl: %s [opcje] [<plik>]

source: -n, --nobanner do not print banner, works only for root -t, --timeout <timeout> write timeout in seconds -V, --version output version information and exit -h, --help display this help and exit
pl: -n, --nobanner bez wypisywania nag³ówka, tylko dla roota -t, --timeout <limit> limit czasu zapisu w sekundach -V, --version wypisanie informacji o wersji i zakoñczenie -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: --nobanner is available only for root
pl: --nobanner jest dostêpne tylko dla roota

source: invalid timeout argument
pl: b³êdna warto¶æ limitu czasu

source: invalid timeout argument: %s
pl: b³êdna warto¶æ limitu czasu: %s

source: can't open temporary file %s
pl: nie mo¿na otworzyæ pliku tymczasowego %s

source: cannot get passwd uid
pl: nie mo¿na pobraæ identyfikatora u¿ytkownika z passwd

source: cannot get tty name
pl: nie mo¿na pobraæ nazwy terminala

source: Broadcast Message from %s@%s
pl: Zbiorowy komunikat od u¿ytkownika %s@%s

source: will not read %s - use stdin.
pl: odmowa czytania %s - u¿yte bêdzie standardowe wej¶cie.

source: fstat failed
pl: fstat nie powiod³o siê

source: fread failed
pl: fread nie powiod³o siê

source: %s [options] <user> [<ttyname>]
pl: %s [opcje] <u¿ytkownik> [<nazwa terminala>]

source: -V, --version output version information and exit -h, --help display this help and exit
pl: -V, --version wypisanie informacji o wersji i zakoñczenie -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: can't find your tty's name
pl: nie znaleziono nazwy tty

source: you have write permission turned off
pl: prawo zapisu u¿ytkownika jest wy³±czone

source: %s is not logged in on %s
pl: %s nie jest zalogowany na %s

source: %s has messages disabled on %s
pl: %s ma wy³±czone komunikaty na %s

source: %s is not logged in
pl: %s nie jest zalogowany

source: %s has messages disabled
pl: %s ma wy³±czone komunikaty

source: %s is logged in more than once; writing to %s
pl: %s jest zalogowany wiêcej ni¿ raz; napisano na %s

source: tty path %s too long
pl: ¶cie¿ka tty %s jest zbyt d³uga

source: Message from %s@%s (as %s) on %s at %s ...
pl: Komunikat od %s@%s (jako %s) na %s o %s...

source: Message from %s@%s on %s at %s ...
pl: Komunikat od %s@%s na %s o %s...

source: carefulputc failed
pl: carefulputc nie powiod³o siê

source: Usage: %s [options]
pl: Sk³adnia: %s [opcje]

source: Options: -b, --no-backspaces do not output backspaces -f, --fine permit forward half line feeds -p, --pass pass unknown control sequences -h, --tabs convert spaces to tabs -x, --spaces convert tabs to spaces -l, --lines NUM buffer at least NUM lines -V, --version output version information and exit -H, --help display this help and exit
pl: Opcje: -b, --no-backspaces bez wypisywania znaków cofniêcia (backspace) -f, --fine zezwolenie na przesuniêcia o pó³ linii do przodu -p, --pass przekazywanie nieznanych sekwencji steruj±cych -h, --tabs zamiana spacji na tabulacje -x, --spaces zamiana tabulacji na spacje -l, --lines LICZBA buforowanie co najmniej podanej liczby linii -V, --version wypisanie informacji o wersji i zakoñczenie -H, --help wy¶wietlenie tego opisu i zakoñczenie

source: %s reads from standard input and writes to standard output
pl: %s czyta ze standardowego wej¶cia i zapisuje na standardowe wyj¶cie

source: write error.
pl: b³±d zapisu.

source: bad -l argument
pl: b³êdny argument -l

source: argument %lu is too large
pl: argument %lu zbyt du¿y

source: warning: can't back up %s.
pl: uwaga: nie mo¿na cofn±æ %s.

source: past first line
pl: po pierwszej linii

source: -- line already flushed
pl: - linia ju¿ zapisana

source: Usage: %s [options] [file ...]
pl: Sk³adnia: %s [opcje] [plik ...]

source: -, --no-underlining suppress all underlining -2, --half-lines print all half-lines -V, --version output version information and exit -h, --help display this help and exit
pl: -, --no-underlining pominiêcie podkre¶leñ -2, --half-lines wypisywanie wszystkich po³ówek linii -V, --version wypisanie informacji o wersji i zakoñczenie -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: Usage: %s [startcol [endcol]]
pl: Sk³adnia: %s [kolumna_pocz±tkowa [kolumna_koñcowa]]

source: Options: -V, --version output version information and exit -h, --help display this help and exit
pl: Opcje: -V, --version wypisanie informacji o wersji i zakoñczenie -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: first argument
pl: pierwszy argument

source: second argument
pl: drugi argument

source: Usage: %s [options] [file ...]
pl: Sk³adnia: %s [opcje] [plik ...]

source: -h, --help displays this help text -V, --version output version information and exit -c, --columns <width> width of output in number of characters -t, --table create a table -s, --separator <string> table delimeter -x, --fillrows fill rows before columns
pl: -h, --help wy¶wietlenie tego opisu -V, --version wypisanie informacji o wersji i zakoñczenie -c, --columns <szer> szeroko¶æ wyj¶cia w znakach -t, --table utworzenie tabeli -s, --separator <³añcuch> ³añcuch rozdzielaj±cy dla tabeli -x, --fillrows wype³nianie wierszy przed kolumnami

source: For more information see column(1).
pl: Wiêcej informacji mo¿na znale¼æ w column(1).

source: terminal environment COLUMNS failed
pl: odczyt zmiennej ¶rodowiskowej COLUMNS dla terminala nie powiód³ siê

source: bad columns width value
pl: b³êdna warto¶æ szeroko¶ci w kolumnach

source: -%c positive integer expected as an argument
pl: oczekiwano dodatniej liczby ca³kowitej jako argumentu dla -%c

source: line %d is too long, output will be truncated
pl: linia %d jest zbyt d³uga, wyj¶cie zostanie uciête

source: calling hexdump as od has been deprecated in favour to GNU coreutils od.
pl: wywo³ywanie hexdump jako od jest przestarza³e; lepiej u¿ywaæ od z GNU coreutils.

source: bad length value
pl: b³êdna warto¶æ d³ugo¶ci

source: bad skip value
pl: b³êdna warto¶æ pominiêcia.

source: Usage: %s [options] file...
pl: Sk³adnia: %s [opcje] plik...

source: Options: -b one-byte octal display -c one-byte character display -C canonical hex+ASCII display -d two-byte decimal display -o two-byte octal display -x two-byte hexadecimal display -e format format string to be used for displaying data -f format_file file that contains format strings -n length interpret only length bytes of input -s offset skip offset bytes from the beginning -v display without squeezing similar lines -V output version information and exit
pl: Opcje: -b wyj¶cie jednobajtowe ósemkowe -c wyj¶cie jednobajtowe znakowe -C wyj¶cie kanoniczne hex+ASCII -d wyj¶cie dwubajtowe dziesiêtne -o wyj¶cie dwubajtowe ósemkowe -x wyj¶cie dwubajtowe szesnastkowe -e format ³añcuch formatuj±cy okre¶laj±cy format wyj¶cia -f plik_format plik zawieraj±cy ³añcuchy formatuj±ce -n d³ugo¶æ interpretowanie tylko podanej liczby bajtów -s offset pominiêcie podanej liczby bajtów z pocz±tku -v wypisywanie bez ¶ciskania podobnych linii -V wypisanie informacji o wersji i zakoñczenie

source: Usage: %s [options] file...
pl: Sk³adnia: %s [opcje] plik...

source: Options: -d display help instead of ring bell -f count logical, rather than screen lines -l suppress pause after form feed -p suppress scroll, clean screen and disblay text -c suppress scroll, display text and clean line ends -u suppress underlining -s squeeze multiple blank lines into one -NUM specify the number of lines per screenful +NUM display file beginning from line number NUM +/STRING display file beginning from search string match -V output version information and exit
pl: Opcje: -d wy¶wietlenie opisu zamiast d¼wiêku dzwonka -f liczenie linii logicznych zamiast ekranowych -l bez pauzy po przewiniêciu strony -p bez przewijania; czyszczenie ekranu i wypisanie tekstu -c bez przewijania; wypisanie tekstu i wyczyszczenie koñców linii -u bez podkre¶lania -s ¶ciskanie wielu pustych linii w jedn± -ILE podanie liczby linii na ekran +NUMER wy¶wietlenie pocz±tku pliku od linii o podanym numerze +/£AÑCUCH wy¶wietlenie pocz±tku pliku od dopasowania do ³añcucha -V wypisanie informacji o wersji i zakoñczenie

source: unknown option -%s
pl: nieznana opcja -%s

source: *** %s: directory ***
pl: *** %s: katalog ***

source: ******** %s: Not a text file ********
pl: ******** %s: Nie jest plikiem tekstowym ********

source: [Use q or Q to quit]
pl: [Klawisz q lub Q koñczy]

source: --More--
pl: --Wiêcej--

source: (Next file: %s)
pl: (Nastêpny plik: %s)

source: [Press space to continue, 'q' to quit.]
pl: [Spacja kontynuuje, 'q' koñczy.]

source: ...back %d pages
pl: ...wstecz stron: %d

source: ...back 1 page
pl: ...wstecz 1 stronê

source: ...skipping one line
pl: ...pomijanie jednej linii

source: ...skipping %d lines
pl: ...pomijanie linii: %d

source: ***Back***
pl: ***Wstecz***

source: Most commands optionally preceded by integer argument k. Defaults in brackets. Star (*) indicates argument becomes new default.
pl: Wiêkszo¶æ poleceñ opcjonalnie mo¿e byæ poprzedzona liczb± ca³kowit± k (domy¶lna w nawiasach). Gwiazdka (*) oznacza argument, który staje siê now± warto¶ci± domy¶ln±.

source: <space> Display next k lines of text [current screen size] z Display next k lines of text [current screen size]* <return> Display next k lines of text [1]* d or ctrl-D Scroll k lines [current scroll size, initially 11]* q or Q or <interrupt> Exit from more s Skip forward k lines of text [1] f Skip forward k screenfuls of text [1] b or ctrl-B Skip backwards k screenfuls of text [1] ' Go to place where previous search started = Display current line number /<regular expression> Search for kth occurrence of regular expression [1] n Search for kth occurrence of last r.e [1] !<cmd> or :!<cmd> Execute <cmd> in a subshell v Start up /usr/bin/vi at current line ctrl-L Redraw screen :n Go to kth next file [1] :p Go to kth previous file [1] :f Display current file name and line number . Repeat previous command
pl: <spacja> Wy¶wietlenie nastêpnych k linii tekstu [rozmiar ekranu] z Wy¶wietlenie nastêpnych k linii tekstu [rozmiar ekranu]* <return> Wy¶wietlenie nastêpnych k linii tekstu [1]* d lub Ctrl-D Przewiniêcie k linii [rozmiar przewijania, pocz. 11]* q, Q lub <przerwanie> Zakoñczenie more s Przewiniêcie o k linii tekstu w przód [1] f Przewiniêcie o k ekranów tekstu w przód [1] b lub Ctrl-B Przewiniêcie o k ekranów tekstu w ty³ [1] ' Przej¶cie do miejsca rozpoczêcia poprz. wyszukiwania = Wy¶wietlenie bie¿±cego numeru linii /<wyra¿enie regularne> Szukanie k. wyst±pienia wyra¿enia regularnego [1] n Szukanie k. wyst±pienia ostatniego wyr. regularnego [1] !<polec> lub :!<polec> Wykonanie <polecenia> w podpow³oce v Uruchomienie /usr/bin/vi na bie¿±cej linii Ctrl-L Odrysowanie ekranu :n Przej¶cie do k. nastêpnego pliku [1] :p Przej¶cie do k. poprzedniego pliku [1] :f Wy¶wietlenie bie¿±cej nazwy pliku i numeru linii . Powtórzenie poprzedniego polecenia

source: [Press 'h' for instructions.]
pl: [Klawisz 'h' wy¶wietla opis.]

source: "%s" line %d
pl: "%s" linia %d

source: [Not a file] line %d
pl: [Nie plik] linia %d

source: Overflow
pl: Przepe³nienie

source: ...skipping
pl: ...pomijanie

source: Regular expression botch
pl: Spartaczone wyra¿enie regularne

source: Pattern not found
pl: Nie znaleziono wzorca

source: Pattern not found
pl: Nie znaleziono wzorca

source: exec failed
pl: exec nie powiod³o siê

source: can't fork
pl: nie mo¿na wykonaæ fork

source: ...Skipping
pl: ...Przewijanie

source: ...Skipping to file
pl: ...Przej¶cie do pliku

source: ...Skipping back to file
pl: ...Przej¶cie wstecz do pliku

source: Line too long
pl: Linia zbyt d³uga

source: No previous command to substitute for
pl: Brak poprzedniego polecenia do podstawienia

source: line too long
pl: linia zbyt d³uga

source: byte count with multiple conversion characters
pl: liczba bajtów z wieloma znakami konwersji

source: bad byte count for conversion character %s
pl: b³êdna liczba bajtów dla znaku konwersji %s

source: %%s requires a precision or a byte count
pl: %%s wymaga podania precyzji lub liczby bajtów

source: bad format {%s}
pl: b³êdny format {%s}

source: bad conversion character %%%s
pl: b³êdny znak konwersji %%%s
