Repository: RMerl/asuswrt-merlin
Catalog: release/src/router/util-linux/po/*.po
Languages: pl

source: Unable to set system clock.
pl: Nie uda³o siê ustawiæ zegara systemowego.

source: At %ld seconds after 1969, RTC is predicted to read %ld seconds after 1969.
pl: W %ld sekund po 1969 przewiduje siê odczyt %ld sekund po 1969.

source: The kernel keeps an epoch value for the Hardware Clock only on an Alpha machine. This copy of hwclock was built for a machine other than Alpha (and thus is presumably not running on an Alpha now). No action taken.
pl: J±dro przechowuje warto¶æ epoch dla zegara sprzêtowego wy³±cznie dla maszyn Alpha. Ta kopia hwclocka zosta³a zbudowana dla innej maszyny (wiêc raczej nie dzia³a teraz na maszynie Alpha). Zaniechano dzia³ania.

source: Unable to get the epoch value from the kernel.
pl: Nie uda³o siê uzyskaæ warto¶ci epoch z j±dra.

source: Kernel is assuming an epoch value of %lu
pl: J±dro przyjmuje warto¶æ epoch %lu

source: To set the epoch value, you must use the 'epoch' option to tell to what value to set it.
pl: Aby ustawiæ warto¶æ epoch, nale¿y u¿yæ opcji 'epoch' w celu przekazania warto¶ci.

source: Not setting the epoch to %d - testing only.
pl: Bez ustawiania warto¶ci epoch na %d - tryb testowy.

source: Unable to set the epoch value in the kernel.
pl: Nie uda³o siê ustawiæ warto¶ci epoch w j±drze.

source: hwclock [function] [option...]
pl: hwclock [funkcja] [opcja...]

source: Functions:
pl: Funkcje:

source: -h, --help show this help text and exit -r, --show read hardware clock and print result --set set the RTC to the time given with --date
pl: -h, --help wy¶wietlenie tego opisu i zakoñczenie -r, --show odczytanie zegara sprzêtowego i wypisanie wyniku --set ustawienie RTC na czas podany przez --date

source: -s, --hctosys set the system time from the hardware clock -w, --systohc set the hardware clock from the current system time --systz set the system time based on the current timezone --adjust adjust the RTC to account for systematic drift since the clock was last set or adjusted
pl: -s, --hctosys ustawienie czasu systemowego wg zegara sprzêtowego -w, --systohc ustawienie zegara sprzêtowego wg czasu systemowego --systz ustawienie czasu systemowego wg bie¿±cej strefy czasowej --adjust korekta RTC bior±ca pod uwagê ci±g³e odchylenie od ostatniego ustawiania lub korekty zegara

source: --getepoch print out the kernel's hardware clock epoch value --setepoch set the kernel's hardware clock epoch value to the value given with --epoch
pl: --getepoch wypisanie warto¶ci epoch zegara sprzêtowego j±dra --setepoch ustawienie warto¶ci epoch zegara sprzêtowego j±dra na warto¶æ podan± przez --epoch

source: --predict predict RTC reading at time given with --date -V, --version display version information and exit
pl: --predict oszacowanie odczytu RTC o czasie podanym przez --date -V, --version wy¶wietlenie informacji o wersji i zakoñczenie

source: -u, --utc the hardware clock is kept in UTC --localtime the hardware clock is kept in local time
pl: -u, --utc zegar sprzêtowy utrzymuje czas w UTC --localtime zegar sprzêtowy utrzymuje czas lokalny

source: -f, --rtc <file> special /dev/... file to use instead of default
pl: -f, --rtc <plik> plik specjalny /dev/... do u¿ycia zamiast domy¶lnego

source: --directisa access the ISA bus directly instead of %s --badyear ignore RTC's year because the BIOS is broken --date <time> specifies the time to which to set the hardware clock --epoch <year> specifies the year which is the beginning of the hardware clock's epoch value
pl: --directisa bezpo¶redni dostêp do szyny ISA zamiast %s --badyear ignorowanie roku RTC ze wzglêdu na wadliwy BIOS --date <czas> okre¶lenie czasu, na jaki ma byæ ustawiony zegar --epoch <rok> okre¶lenie roku, który jest uznawany za pocz±tek warto¶ci epoch zegara sprzêtowego

source: --noadjfile do not access %s; this requires the use of either --utc or --localtime --adjfile <file> specifies the path to the adjust file; the default is %s
pl: --noadjfile bez dostêpu do %s; wymaga to u¿ycia opcji --utc lub --localtime --adjfile <plik> okre¶lenie ¶cie¿ki pliku korekty; domy¶lna to %s

source: --test do not update anything, just show what would happen -D, --debug debugging mode
pl: --test bez uaktualniania, jedynie podawanie, co by³oby robione -D, --debug tryb diagnostyczny

source: -J|--jensen, -A|--arc, -S|--srm, -F|--funky-toy tell hwclock the type of Alpha you have (see hwclock(8))
pl: -J|--jensen, -A|--arc, -S|--srm, -F|--funky-toy okre¶lenie rodzaju Alphy na potrzeby hwclocka (szczegó³y w man hwclock(8))

source: Unable to connect to audit system
pl: Nie mo¿na po³±czyæ siê z systemem audytu

source: failed to parse epoch
pl: nie uda³o siê przeanalizowaæ epoch

source: %s takes no non-option arguments. You supplied %d.
pl: %s nie przyjmuje argumentów nie bêd±cych opcjami. Podano %d.

source: You have specified multiple functions. You can only perform one function at a time.
pl: Podano wiele funkcji. Jednorazowo mo¿na wykonaæ tylko jedn±.

source: The --utc and --localtime options are mutually exclusive. You specified both.
pl: Opcje --utc i --localtime wykluczaj± siê wzajemnie. Podano obie.

source: The --adjust and --noadjfile options are mutually exclusive. You specified both.
pl: Opcje --adjust i --noadjfile wykluczaj± siê wzajemnie. Podano obie.

source: The --adjfile and --noadjfile options are mutually exclusive. You specified both.
pl: Opcje --adjfile i --noadjfile wykluczaj± siê wzajemnie. Podano obie.

source: With --noadjfile, you must specify either --utc or --localtime
pl: W przypadku u¿ycia --noadjfile trzeba podaæ --utc lub --localtime

source: No usable set-to time. Cannot set clock.
pl: Brak zdatnego do u¿ycia czasu do ustawienia. Nie mo¿na ustawiæ zegara.

source: Sorry, only the superuser can change the Hardware Clock.
pl: Niestety tylko superu¿ytkownik mo¿e zmieniæ zegar sprzêtowy.

source: Sorry, only the superuser can change the System Clock.
pl: Niestety tylko superu¿ytkownik mo¿e zmieniæ zegar systemowy.

source: Sorry, only the superuser can change the Hardware Clock epoch in the kernel.
pl: Niestety tylko superu¿ytkownik mo¿e zmieniæ warto¶æ epoch zegara sprzêtowego w j±drze.

source: Cannot access the Hardware Clock via any known method.
pl: Nie mo¿na uzyskaæ dostêpu do zegara sprzêtowego ¿adn± znan± metod±.

source: Use the --debug option to see the details of our search for an access method.
pl: Proszê u¿yæ opcji --debug, aby zobaczyæ szczegó³y poszukiwania metody dostêpu.

source: Waiting in loop for time from KDGHWCLK to change
pl: Oczekiwanie w pêtli na zmianê czasu z KDGHWCLK

source: KDGHWCLK ioctl to read time failed
pl: nie powiód³ siê ioctl KDGHWCLK do odczytu czasu

source: KDGHWCLK ioctl to read time failed in loop
pl: nie powiód³ siê ioctl KDGHWCLK do odczytu czasu w pêtli

source: Timed out waiting for time change.
pl: Przekroczono limit czasu oczekiwania na zmianê czasu.

source: ioctl() failed to read time from %s
pl: nie powiód³ siê ioctl() do odczytu czasu z %s

source: ioctl KDSHWCLK failed
pl: ioctl KDSHWCLK nie powiód³ siê

source: Can't open /dev/tty1 or /dev/vc/1
pl: Nie mo¿na otworzyæ /dev/tty1 ani /dev/vc/1

source: KDGHWCLK ioctl failed
pl: ioctl KDGHWCLK nie powiód³ siê

source: open() of %s failed
pl: nie powiod³o siê open() dla %s

source: ioctl(%s) to %s to read the time failed
pl: nie powiód³ siê ioctl(%s) na %s w celu odczytu czasu

source: Waiting in loop for time from %s to change
pl: Oczekiwanie w pêtli na zmianê czasu z %s

source: %s does not have interrupt functions.
pl: %s nie ma funkcji przerwañ.

source: read() to %s to wait for clock tick failed
pl: nie powiod³o siê read() na %s w celu oczekiwania na przeskok zegara

source: select() to %s to wait for clock tick failed
pl: nie powiód³ siê select() na %s w celu oczekiwania na przeskok zegara

source: select() to %s to wait for clock tick timed out
pl: select() na %s w celu oczekiwania na przeskok zegara przekroczy³ limit czasu

source: ioctl() to %s to turn off update interrupts failed
pl: nie powiód³ siê ioctl() na %s w celu wy³±czenia przerwañ uaktualnieñ

source: ioctl() to %s to turn on update interrupts failed unexpectedly
pl: nieoczekiwanie nie powiód³ siê ioctl() na %s w celu w³±czenia przerwañ uaktualnieñ

source: ioctl(%s) to %s to set the time failed.
pl: nie powiód³ siê ioctl(%s) na %s w celu ustawienia czasu

source: ioctl(%s) was successful.
pl: ioctl(%s) powiód³ siê.

source: Open of %s failed
pl: Otwarcie %s nie powiod³o siê

source: To manipulate the epoch value in the kernel, we must access the Linux 'rtc' device driver via the device special file %s. This file does not exist on this system.
pl: Aby zmieniæ warto¶æ epoch w j±drze, trzeba dostaæ siê do linuksowego sterownika urz±dzenia 'rtc' poprzez plik urz±dzenia specjalnego %s. Ten plik nie istnieje w tym systemie.

source: Unable to open %s
pl: Nie mo¿na otworzyæ %s

source: ioctl(RTC_EPOCH_READ) to %s failed
pl: nie powiód³ siê ioctl(RTC_EPOCH_READ) na %s

source: we have read epoch %ld from %s with RTC_EPOCH_READ ioctl.
pl: odczytano warto¶æ epoch %ld z %s przy u¿yciu ioctl-a RTC_EPOCH_READ.

source: The epoch value may not be less than 1900. You requested %ld
pl: Warto¶æ epoch nie mo¿e byæ mniejsza ni¿ 1900. ¯±dano %ld

source: setting epoch to %ld with RTC_EPOCH_SET ioctl to %s.
pl: ustawianie warto¶ci epoch na %ld przy u¿yciu ioctl-a RTC_EPOCH_SET na %s.

source: The kernel device driver for %s does not have the RTC_EPOCH_SET ioctl.
pl: Sterownik urz±dzenia w j±drze dla %s nie ma ioctl-a RTC_EPOCH_SET.

source: ioctl(RTC_EPOCH_SET) to %s failed
pl: nie powiód³ siê ioctl(RTC_EPOCH_SET) na %s

source: only root can use "--%s" option (effective UID is %u)
pl: tylko root mo¿e u¿yæ opcji "--%s" (efektywny UID to %u)

source: only root can do that (effective UID is %u)
pl: tylko root mo¿e to zrobiæ (efektywny UID to %u)

source: only root can use "--%s" option
pl: tylko root mo¿e u¿yæ opcji "--%s"

source: only root can do that
pl: tylko root mo¿e to zrobiæ

source: %s: parse error: ignore entry at line %d.
pl: %s: b³±d sk³adni: zignorowano wpis w linii %d.

source: failed to read mtab
pl: nie uda³o siê odczytaæ mtab

source: failed to initialize libmount iterator
pl: nie uda³o siê zainicjowaæ iteratora libmount

source: %-20s: ignored
pl: %-20s: zignorowano

source: %-20s: already mounted
pl: %-20s: ju¿ zamontowany

source: %-20s: failed: %s
pl: %-20s: nie powiod³o siê: %s

source: %-20s: failed
pl: %-20s: nie powiod³o siê

source: Usage: %1$s [-lhV] %1$s -a [options] %1$s [options] <source> | <directory> %1$s [options] <source> <directory> %1$s <operation> <mountpoint> [<target>]
pl: Sk³adnia: %1$s [-lhV] %1$s -a [opcje] %1$s [opcje] <¼ród³o> | <katalog> %1$s [opcje] <¼ród³o> <katalog> %1$s <operacja> <punkt_montowania> [<cel>]

source: Options: -a, --all mount all filesystems mentioned in fstab -c, --no-canonicalize don't canonicalize paths -f, --fake dry run; skip the mount(2) syscall -F, --fork fork off for each device (use with -a)
pl: Opcje: -a, --all zamontowanie wszystkich systemów plików z fstaba -c, --no-canonicalize bez doprowadzania ¶cie¿ek do postaci kanonicznej -f, --fake testowe uruchomienie; pominiêcie wywo³añ mount(2) -F, --fork osobny proces dla ka¿dego urz±dzenia (wraz z -a)

source: -h, --help display this help text and exit -i, --internal-only don't call the mount.<type> helpers -l, --show-labels lists all mounts with LABELs -n, --no-mtab don't write to /etc/mtab
pl: -h, --help wy¶wietlenie tego opisu i zakoñczenie -i, --internal-only bez wywo³ywania programów pomocniczych mount.<typ> -l, --show-labels wypisanie wszystkich punktów montowania z ETYKIETAMI -n, --no-mtab bez zapisu do /etc/mtab

source: -o, --options <list> comma-separated list of mount options -O, --test-opts <list> limit the set of filesystems (use with -a) -r, --read-only mount the filesystem read-only (same as -o ro) -t, --types <list> limit the set of filesystem types
pl: -o, --options <lista> rozdzielona przecinkami lista opcji montowania -O, --test-opts <lista> ograniczenie zbioru systemów plików (wraz z -a) -r, --read-only montowania systemu plików tylko do odczytu (-o ro) -t, --types <lista> ograniczenie zbioru typów systemów plików

source: -v, --verbose say what is being done -V, --version display version information and exit -w, --read-write mount the filesystem read-write (default)
pl: -v, --verbose informowanie o wykonywanych czynno¶ciach -V, --version wy¶wietlenie informacji o wersji i zakoñczenie -w, --read-write montowanie syst. plików do odczytu i zapisu (domy¶lne)

source: Source: -L, --label <label> synonym for LABEL=<label> -U, --uuid <uuid> synonym for UUID=<uuid> LABEL=<label> specifies device by filesystem label UUID=<uuid> specifies device by filesystem UUID
pl: ¬ród³o: -L, --label <etykieta> synonim LABEL=<etykieta> -U, --uuid <uuid> synonim UUID=<uuid> LABEL=<etykieta> okre¶lenie urz±dzenia po etykiecie systemu plików UUID=<uuid> okre¶lenie urz±dzenia po warto¶ci UUID systemu plików

source: <device> specifies device by path <directory> mountpoint for bind mounts (see --bind/rbind) <file> regular file for loopdev setup
pl: <urz±dzenie> okre¶lenie urz±dzenia po ¶cie¿ce <katalog> punkt montowania dla montowañ bind (p. --bind/rbind) <plik> zwyk³y plik do ustawienia urz±dzenia loopback

source: Operations: -B, --bind mount a subtree somewhere else (same as -o bind) -M, --move move a subtree to some other place -R, --rbind mount a subtree and all submounts somewhere else
pl: Operacje: -B, --bind zamontowanie poddrzewa w innym miejscu (-o bind) -M, --move przeniesienie poddrzewa w inne miejsce -R, --rbind przeniesienie poddrzewa wraz z wewn. montowaniami

source: --make-shared mark a subtree as shared --make-slave mark a subtree as slave --make-private mark a subtree as private --make-unbindable mark a subtree as unbindable
pl: --make-shared oznaczenie poddrzewa jako wspó³dzielonego --make-slave oznaczenie poddrzewa jako podrzêdnego --make-private oznaczenie poddrzewa jako prywatnego --make-unbindable oznaczenie poddrzewa jako niebindowalnego

source: --make-rshared recursively mark a whole subtree as shared --make-rslave recursively mark a whole subtree as slave --make-rprivate recursively mark a whole subtree as private --make-runbindable recursively mark a whole subtree as unbindable
pl: --make-rshared rekurencyjne oznaczenie poddrzewa jako wspó³dzielonego --make-rslave rekurencyjne oznaczenie poddrzewa jako podrzêdnego --make-rprivate rekurencyjne oznaczenie poddrzewa jako prywatnego --make-runbindable rekurencyjne oznaczenie poddrzewa jako niebindowalnego

source: For more information see mount(8).
pl: Wiêcej informacji w mount(8).

source: libmount context allocation failed
pl: przydzielenie kontekstu libmount nie powiod³o siê

source: failed to append options
pl: nie uda³o siê do³±czyæ opcji

source: failed to set options pattern
pl: nie uda³o siê ustawiæ wzorca opcji

source: only one <source> may be specified
pl: mo¿na podaæ tylko jedno <¼ród³o>

source: failed to allocate source buffer
pl: nie uda³o siê przydzieliæ bufora dla ¼ród³a

source: login: memory low, login may fail
pl: login: ma³o pamiêci, logowanie mo¿e siê nie udaæ

source: can't malloc for ttyclass
pl: nie mo¿na wykonaæ malloc dla ttyclass

source: can't malloc for grplist
pl: nie mo¿na wykonaæ malloc dla grplist

source: Login on %s from %s denied by default.
pl: Logowanie na %s z %s domy¶lnie zabronione.

source: Login on %s from %s denied.
pl: Logowanie na %s z %s zabronione.

source: Usage: %s [ -f full-name ] [ -o office ]
pl: Sk³adnia: %s [ -f pe³na-nazwa ] [ -o pokój ]

source: [ -p office-phone ] [ -h home-phone ]
pl: [ -p telefon-biurowy ] [ -h telefon-domowy ]

source: %s: you (user %d) don't exist.
pl: %s: Ty (u¿ytkownik %d) nie istniejesz.

source: %s: user "%s" does not exist.
pl: %s: u¿ytkownik "%s" nie istnieje.

source: can only change local entries
pl: mo¿na zmieniæ tylko wpisy lokalne

source: %s: %s is not authorized to change the finger info of %s
pl: %s: %s nie jest autoryzowany do zmiany informacji finger u¿ytkownika %s

source: Unknown user context
pl: Nieznany kontekst u¿ytkownika

source: can't set default context for /etc/passwd
pl: nie mo¿na ustawiæ domy¶lnego kontekstu dla /etc/passwd

source: Changing finger information for %s.
pl: Zmiana informacji finger dla %s.

source: %s: PAM failure, aborting: %s
pl: %s: niepowodzenie PAM, przerwano: %s

source: Password:
pl: Has³o:

source: Incorrect password.
pl: Has³o nieprawid³owe.

source: Finger information not changed.
pl: Informacje finger nie zosta³y zmienione.

source: Office
pl: Biuro

source: Office Phone
pl: Tel. biurowy

source: Home Phone
pl: Tel. domowy

source: Aborted.
pl: Przerwano.

source: field is too long.
pl: pole zbyt d³ugie.

source: '%c' is not allowed.
pl: '%c' nie jest dozwolony.

source: Control characters are not allowed.
pl: Znaki steruj±ce nie s± dozwolone.

source: Finger information *NOT* changed. Try again later.
pl: Informacje finger *NIE* zosta³y zmienione. Proszê spróbowaæ pó¼niej.

source: Finger information changed.
pl: Informacje finger zmienione.

source: Usage: %1$s [-s shell] [username] or: %1$s (--list-shells | --help | --version)
pl: Sk³adnia: %1$s [-s pow³oka] [u¿ytkownik] lub: %1$s (--list-shells | --help | --version)

source: %s: can only change local entries.
pl: %s: mo¿na zmieniæ tylko wpisy lokalne.

source: %s: %s is not authorized to change the shell of %s
pl: %s: %s nie jest autoryzowany do zmiany pow³oki %s

source: %s: can't set default context for /etc/passwd
pl: %s: nie mo¿na ustawiæ domy¶lnego kontekstu dla /etc/passwd

source: %s: running UID doesn't match UID of user we're altering, shell change denied
pl: %s: bie¿±cy UID nie zgadza siê z UID-em u¿ytkownika, którego dotyczy zmiana; zmiana pow³oki zabroniona

source: %s: your shell is not in /etc/shells, shell change denied
pl: %s: pow³oka nie jest w /etc/shells, zmiana zabroniona

source: Changing shell for %s.
pl: Zmiana pow³oki dla %s.

source: New shell
pl: Nowa pow³oka

source: Shell not changed.
pl: Pow³oka nie zosta³a zmieniona.

source: setpwnam failed
pl: setpwnam nie powiod³o siê

source: Shell *NOT* changed. Try again later.
pl: Pow³oka *NIE* zosta³a zmieniona. Proszê spróbowaæ pó¼niej.

source: Shell changed.
pl: Pow³oka zmieniona.

source: %s: shell must be a full path name.
pl: %s: pow³oka musi byæ podana pe³n± ¶cie¿k±.

source: %s: "%s" does not exist.
pl: %s: "%s" nie istnieje.

source: %s: "%s" is not executable.
pl: %s: "%s" nie jest wykonywalny.

source: %s: '%c' is not allowed.
pl: %s: '%c' nie jest dozwolony.

source: %s: Control characters are not allowed.
pl: %s: Znaki steruj±ce nie s± dozwolone.

source: Warning: "%s" is not listed in /etc/shells.
pl: Uwaga: "%s" nie wystêpuje w /etc/shells.

source: %s: "%s" is not listed in /etc/shells.
pl: %s: "%s" nie wystêpuje w /etc/shells.

source: %s: Use -l option to see list.
pl: %s: Opcja -l poka¿e listê.

source: Use %s -l to see list.
pl: Polecenie %s -l poka¿e listê.

source: No known shells.
pl: Brak znanych pow³ok.

source: Failed to open %s for reading, exiting.
pl: Nie uda³o siê otworzyæ %s do odczytu, zakoñczenie.

source: usage: last [-#] [-f file] [-t tty] [-h hostname] [user ...]
pl: Sk³adnia: last [-#] [-f plik] [-t tty] [-h host] [u¿ytkownik ...]

source: %s: mmap failed
pl: %s: mmap nie powiod³o siê

source: still logged in
pl: nadal zalogowany

source: wtmp begins %s
pl: wtmp zaczyna siê %s

source: gethostname failed
pl: gethostname nie powiod³o siê

source: interrupted %10.10s %5.5s
pl: przerwano %10.10s %5.5s

source: FATAL: can't reopen tty: %s
pl: B£¡D KRYTYCZNY: nie mo¿na ponownie otworzyæ tty: %s

source: FATAL: %s is not a terminal
pl: B£¡D KRYTYCZNY: %s nie jest terminalem

source: FATAL: bad tty
pl: B£¡D KRYTYCZNY: b³êdny tty

source: login: -h for super-user only.
pl: login: -h jest tylko dla superu¿ytkownika.

source: usage: login [-fp] [username]
pl: Sk³adnia: login [-fp] [u¿ytkownik]

source: PAM failure, aborting: %s
pl: Niepowodzenie PAM, przerwano: %s

source: Couldn't initialize PAM: %s
pl: Nie uda³o siê zainicjowaæ PAM: %s

source: FAILED LOGIN %d FROM %s FOR %s, %s
pl: B£ÊDNE LOGOWANIE %d. Z %s NA KONTO %s, %s

source: Login incorrect
pl: Niepoprawne logowanie

source: TOO MANY LOGIN TRIES (%d) FROM %s FOR %s, %s
pl: ZBYT DU¯O PRÓB LOGOWANIA (%d) Z %s NA KONTO %s, %s

source: FAILED LOGIN SESSION FROM %s FOR %s, %s
pl: NIEUDANA SESJA LOGOWANIA Z %s NA KONTO %s, %s

source: Login incorrect
pl: Niepoprawne logowanie

source: Session setup problem, abort.
pl: Problem z ustanowieniem sesji, przerwano.

source: NULL user name in %s:%d. Abort.
pl: PUSTA nazwa u¿ytkownika w %s:%d. Przerwano.

source: Invalid user name "%s" in %s:%d. Abort.
pl: Niepoprawna nazwa u¿ytkownika "%s" w %s:%d. Przerwano.

source: out of memory
pl: brak pamiêci

source: Illegal username
pl: Niedozwolona nazwa u¿ytkownika

source: %s login refused on this terminal.
pl: Logowanie na konto %s z tego terminala nie jest dozwolone.

source: LOGIN %s REFUSED FROM %s ON TTY %s
pl: LOGOWANIE NA KONTO %s ZABRONIONE Z %s NA TTY %s

source: LOGIN %s REFUSED ON TTY %s
pl: LOGOWANIE %s ZABRONIONE NA TTY %s

source: Login incorrect
pl: Niepoprawne logowanie

source: change terminal owner failed
pl: zmiana w³a¶ciciela terminala nie powiod³a siê

source: setgid() failed
pl: setgid() nie powiod³o siê

source: DIALUP AT %s BY %s
pl: WDZWONIENIE NA %s PRZEZ %s

source: ROOT LOGIN ON %s FROM %s
pl: LOGOWANIE NA ROOTA NA %s Z %s

source: ROOT LOGIN ON %s
pl: LOGOWANIE NA ROOTA NA %s

source: LOGIN ON %s BY %s FROM %s
pl: LOGOWANIE NA %s NA KONTO %s Z %s

source: LOGIN ON %s BY %s
pl: LOGOWANIE NA %s NA KONTO %s

source: You have new mail.
pl: Jest nowa poczta.

source: You have mail.
pl: Jest poczta.

source: failure forking
pl: niepowodzenie fork

source: TIOCSCTTY failed: %m
pl: TIOCSCTTY nie powiod³o siê: %m

source: setuid() failed
pl: setuid() nie powiod³o siê

source: %s: change directory failed
pl: %s: zmiana katalogu nie powiod³a siê

source: Logging in with home = "/".
pl: Logowanie z katalogiem domowym = "/".

source: couldn't exec shell script
pl: nie uda³o siê uruchomiæ skryptu pow³oki

source: no shell
pl: brak pow³oki

source: NAME too long
pl: NAZWA zbyt d³uga

source: login name much too long.
pl: nazwa u¿ytkownika o wiele za d³uga.

source: login names may not start with '-'.
pl: nazwy u¿ytkowników nie mog± siê zaczynaæ od '-'.

source: EXCESSIVE linefeeds
pl: NADMIAROWE koñce linii

source: too many bare linefeeds.
pl: zbyt du¿o pustych linii.

source: timed out after %d seconds
pl: przekroczony limit czasu logowania (sekund: %d)

source: Last login: %.*s
pl: Ostatnie logowanie: %.*s

source: from %.*s
pl: z %.*s

source: on %.*s
pl: na %.*s

source: write lastlog failed
pl: zapis wpisu lastlog nie powiód³ siê

source: LOGIN FAILURE FROM %s, %s
pl: B£ÊDNE LOGOWANIE Z %s, %s

source: LOGIN FAILURE ON %s, %s
pl: B£ÊDNE LOGOWANIE NA %s, %s

source: %d LOGIN FAILURES FROM %s, %s
pl: %d B£ÊDNYCH LOGOWAÑ Z %s, %s

source: %d LOGIN FAILURES ON %s, %s
pl: %d B£ÊDNYCH LOGOWAÑ NA %s, %s

source: who are you?
pl: kim jeste¶?

source: setgid failed
pl: setgid nie powiod³o siê

source: no such group
pl: nie ma takiej grupy

source: permission denied
pl: brak uprawnieñ

source: setuid failed
pl: setuid nie powiod³o siê

source: exec %s failed
pl: exec %s nie powiod³o siê

source: %s: the password file is busy.
pl: %s: plik hase³ jest zajêty.

source: %s: the group file is busy.
pl: %s: plik grup jest zajêty.

source: %s: the %s file is busy (%s present)
pl: %s: plik %s jest zajêty (istnieje %s

source: %s: can't link %s: %s
pl: %s: nie mo¿na dowi±zaæ %s: %s

source: %s: create a link to %s failed
pl: %s: tworzenie dowi±zania do %s nie powiod³o siê

source: %s: Can't get context for %s
pl: %s: nie mo¿na uzyskaæ kontekstu dla %s

source: %s: Can't set context for %s
pl: %s: nie mo¿na ustawiæ kontekstu dla %s
