Repository: RMerl/asuswrt-merlin
Catalog: release/src/router/util-linux/po/*.po
Languages: pl

source: error changing owner of %s: %s
pl: b³±d podczas zmiany w³a¶ciciela pliku %s: %s

source: can't rename %s to %s: %s
pl: nie mo¿na zmieniæ nazwy %s na %s: %s

source: %s: /dev directory does not exist.
pl: %s: katalog /dev nie istnieje.

source: loop: can't set capacity on device %s: %s
pl: loop: nie mo¿na ustawiæ pojemno¶ci urz±dzenia %s: %s

source: , sizelimit %<PRIu64>
pl: , limit rozmiaru %<PRIu64>

source: , encryption %s (type %<PRIu32>)
pl: , szyfrowanie %s (typ %<PRIu32>)

source: , encryption type %d
pl: , typ szyfrowania %d

source: loop: can't get info on device %s: %s
pl: loop: nie mo¿na uzyskaæ informacji o urz±dzeniu %s: %s

source: loop: can't open device %s: %s
pl: loop: nie mo¿na otworzyæ urz±dzenia %s: %s

source: %s: no permission to look at /dev/loop%s<N>
pl: %s: brak uprawnieñ do sprawdzenia /dev/loop%s<N>

source: %s: could not find any free loop device
pl: %s: nie uda³o siê odnale¼æ ¿adnego wolnego urz±dzenia loop

source: %s: Could not find any loop device. Maybe this kernel does not know about the loop device? (If so, recompile or `modprobe loop'.)
pl: %s: Nie uda³o siê odnale¼æ ¿adnego urz±dzenia loop. Mo¿e to j±dro nie obs³uguje urz±dzeñ loop? (je¶li tak, nale¿y je przekompilowaæ, lub wykonaæ `modprobe loop'.)

source: Out of memory while reading passphrase
pl: Brak pamiêci podczas odczytu has³a

source: warning: %s is already associated with %s
pl: uwaga: %s jest ju¿ zwi±zany z %s

source: warning: %s: is write-protected, using read-only.
pl: uwaga: %s: zabezpieczony przed zapisem, u¿ycie trybu tylko do odczytu

source: Couldn't lock into memory, exiting.
pl: Nie uda³o siê zablokowaæ w pamiêci, zakoñczenie.

source: ioctl LOOP_SET_FD failed: %s
pl: ioctl LOOP_SET_FD nie powiód³ siê: %s

source: set_loop(%s,%s,%llu,%llu): success
pl: set_loop(%s,%s,%llu,%llu): sukces

source: del_loop(%s): success
pl: del_loop(%s): sukces

source: loop: can't delete device %s: %s
pl: loop: nie mo¿na usun±æ urz±dzenia %s: %s

source: This mount was compiled without loop support. Please recompile.
pl: Ten program mount zosta³ skompilowany bez obs³ugi urz±dzeñ loop. Proszê przekompilowaæ.

source: %1$s loop_device give info %1$s -a | --all list all used %1$s -d | --detach <loopdev> [<loopdev> ...] delete %1$s -f | --find find unused %1$s -c | --set-capacity <loopdev> resize %1$s -j | --associated <file> [-o <num>] list all associated with <file> %1$s [options] {-f|--find|loopdev} <file> setup
pl: %1$s urz±dzenie_loop wypisanie informacji %1$s -a | --all lista wszystkich u¿ywanych %1$s -d | --detach <urz±dz.> [<urz±dz.> ...] usuniêcie %1$s -f | --find znalezienie nieu¿ywanego %1$s -c | --set-capacity <urz±dz.> zmiana rozmiaru %1$s -j | --associated <plik> [-o <num>] lista powi±zanych z <plikiem> %1$s [opcje] {-f|--find|urz±dz.} <plik> konfiguracja

source: -e, --encryption <type> enable data encryption with specified <name/num> -h, --help this help -o, --offset <num> start at offset <num> into file --sizelimit <num> loop limited to only <num> bytes of the file -p, --pass-fd <num> read passphrase from file descriptor <num> -r, --read-only setup read-only loop device --show print device name (with -f <file>) -v, --verbose verbose mode
pl: -e | --encryption <typ> w³±czenie szyfrowania danych o <nazwie/numerze> -h | --help ten opis -o | --offset <num> rozpoczêcie od offsetu <num> w pliku --sizelimit <num> ograniczenie do najwy¿ej <num> bajtów pliku -p | --pass-fd <num> odczyt has³a z deskryptora <num> -r | --read-only ustawienie urz±dzenia loop tylko do odczytu --show wypisanie nazwy urz±dzenia (z -f <plik>) -v | --verbose tryb ze szczegó³owymi informacjami

source: %s: invalid offset '%s' specified
pl: %s: podano b³êdn± warto¶æ offsetu '%s'

source: %s: invalid sizelimit '%s' specified
pl: %s: podano b³êdny limit rozmiaru '%s'

source: Loop device is %s
pl: Urz±dzenie loop: %s

source: stolen loop=%s...trying again
pl: ukradziony loop=%s... ponowna próba

source: %s: %s: device is busy
pl: %s: %s: urz±dzenie jest zajête

source: No loop support was available at compile time. Please recompile.
pl: Brak obs³ugi urz±dzeñ loop w trakcie kompilacji. Proszê przekompilowaæ.

source: mount: warning: /etc/mtab is not writable (e.g. read-only filesystem). It's possible that information reported by mount(8) is not up to date. For actual information about system mount points check the /proc/mounts file.
pl: mount: uwaga: pliku /etc/mtab nie mo¿na zapisywaæ (np. system plików jest tylko do odczytu). Mo¿liwe, ¿e informacje zg³aszane przez mount(8) nie s± aktualne. W³a¶ciwe informacje o punktach montowania mo¿na znale¼æ w pliku /proc/mounts.

source: mount: improperly quoted option string '%s'
pl: mount: niew³a¶ciwie zacytowany ³añcuch opcji '%s'

source: mount: translated %s '%s' to '%s'
pl: mount: przet³umaczono %s '%s' na '%s'

source: mount: SELinux *context= options are ignore on remount.
pl: mount: opcje SELinuksa *context= s± ignorowane przy przemontowywaniu.

source: mount: according to mtab, %s is already mounted on %s
pl: mount: wed³ug mtaba %s jest ju¿ zamontowany w %s

source: mount: according to mtab, %s is mounted on %s
pl: mount: wed³ug mtaba %s jest zamontowany w %s

source: mount: can't open %s for writing: %s
pl: mount: nie mo¿na otworzyæ %s do zapisu: %s

source: mount: error writing %s: %s
pl: mount: b³±d zapisu %s: %s

source: mount: error changing mode of %s: %s
pl: mount: b³±d podczas zmiany uprawnieñ %s: %s

source: mount: cannot set group id: %s
pl: mount: nie mo¿na ustawiæ identyfikatora grupy: %s

source: mount: cannot set user id: %s
pl: mount: nie mo¿na ustawiæ identyfikatora u¿ytkownika: %s

source: mount: cannot fork: %s
pl: mount: nie mo¿na wykonaæ fork: %s

source: Trying %s
pl: Próbowanie %s

source: mount: you didn't specify a filesystem type for %s
pl: mount: nie podano typu systemu plików dla %s

source: I will try all types mentioned in %s or %s
pl: Bêd± sprawdzane wszystkie typy wymienione w %s i %s

source: and it looks like this is swapspace
pl: i wygl±da to na przestrzeñ wymiany

source: I will try type %s
pl: Bêdzie sprawdzany typ %s

source: %s looks like swapspace - not mounted
pl: %s wygl±da na przestrzeñ wymiany - nie zamontowano

source: mount: %s: more filesystems detected. This should not happen, use -t <type> to explicitly specify the filesystem type or use wipefs(8) to clean up the device.
pl: mount: %s: wykryto wiêcej systemów plików. To nie powinno siê zdarzyæ, proszê u¿yæ -t <typ>, aby okre¶liæ samemu typ systemu plików lub u¿yæ wipefs(8), aby wyczy¶ciæ urz±dzenie.

source: mount failed
pl: montowanie nie powiod³o siê

source: mount: only root can mount %s on %s
pl: mount: tylko root mo¿e zamontowaæ %s w %s

source: mount: loop device specified twice
pl: mount: urz±dzenie loop podano dwukrotnie

source: mount: type specified twice
pl: mount: typ podano dwukrotnie

source: mount: skipping the setup of a loop device
pl: mount: pominiêto tworzenie urz±dzenia loop

source: mount: enabling autoclear loopdev flag
pl: mount: w³±czanie flagi automatycznego czyszczenia urz±dzenia loop

source: mount: invalid offset '%s' specified
pl: mount: podano b³êdn± warto¶æ offsetu '%s'

source: mount: invalid sizelimit '%s' specified
pl: mount: podano b³êdny limit rozmiaru '%s'

source: mount: according to mtab %s is already mounted on %s as loop
pl: mount: wed³ug mtaba %s jest ju¿ zamontowany w %s jako loop

source: mount: going to use the loop device %s
pl: mount: zostanie u¿yte urz±dzenie loop %s

source: mount: stolen loop=%s ...trying again
pl: mount: loop=%s skradziony... ponowna próba

source: mount: stolen loop=%s
pl: mount: loop=%s skradziony

source: mount: failed setting up loop device
pl: mount: nie uda³o siê utworzyæ urz±dzenia loop

source: mount: setup loop device successfully
pl: mount: utworzono urz±dzenie loop

source: mount: no %s found - creating it..
pl: mount: nie znaleziono %s - tworzenie...

source: mount: argument to -p or --pass-fd must be a number
pl: mount: argument dla opcji -p lub --pass-fd musi byæ liczb±

source: mount: cannot open %s for setting speed
pl: mount: nie mo¿na otworzyæ %s w celu ustawienia prêdko¶ci

source: mount: cannot set speed: %s
pl: mount: nie mo¿na ustawiæ prêdko¶ci: %s

source: mount: according to mtab, %s is already mounted on %s
pl: mount: wed³ug mtaba %s jest ju¿ zamontowany w %s

source: mount: warning: %s seems to be mounted read-write.
pl: mount: uwaga: %s wygl±da na zamontowany do odczytu i zapisu.

source: mount: warning: %s seems to be mounted read-only.
pl: mount: uwaga: %s wygl±da na zamontowany tylko do odczytu.

source: mount: I could not determine the filesystem type, and none was specified
pl: mount: nie uda³o siê okre¶liæ typu systemu plików, a ¿aden nie zosta³ podany

source: mount: you must specify the filesystem type
pl: mount: trzeba okre¶liæ system plików

source: mount: mount failed
pl: mount: montowanie nie powiod³o siê

source: mount: mount point %s is not a directory
pl: mount: punkt montowania %s nie jest katalogiem

source: mount: permission denied
pl: mount: brak uprawnieñ

source: mount: must be superuser to use mount
pl: mount: do u¿ywania mounta trzeba byæ superu¿ytkownikiem

source: mount: %s is busy
pl: mount: %s jest zajêty

source: mount: proc already mounted
pl: mount: proc jest ju¿ zamontowany

source: mount: %s already mounted or %s busy
pl: mount: %s jest ju¿ zamontowany lub %s jest zajêty

source: mount: mount point %s does not exist
pl: mount: punkt montowania %s nie istnieje

source: mount: mount point %s is a symbolic link to nowhere
pl: mount: punkt montowania %s jest dowi±zaniem symbolicznym donik±d

source: mount: special device %s does not exist
pl: mount: urz±dzenie specjalne %s nie istnieje

source: mount: special device %s does not exist (a path prefix is not a directory)
pl: mount: urz±dzenie specjalne %s nie istnieje (przedrostek ¶cie¿ki nie jest katalogiem)

source: mount: %s not mounted or bad option
pl: mount: %s nie jest zamontowany, albo podano z³± opcjê

source: mount: wrong fs type, bad option, bad superblock on %s, missing codepage or helper program, or other error
pl: mount: niew³a¶ciwy typ systemu plików, b³êdna opcja, b³êdny superblok na %s, brak strony kodowej lub programu pomocniczego albo jeszcze inny b³±d

source: (for several filesystems (e.g. nfs, cifs) you might need a /sbin/mount.<type> helper program)
pl: (dla niektórych systemów plików (np. nfs, cifs) mo¿e byæ potrzebny program pomocniczy /sbin/mount.<typ>)

source: (could this be the IDE device where you in fact use ide-scsi so that sr0 or sda or so is needed?)
pl: (byæ mo¿e to urz±dzenie IDE, które wykorzystuje ide-scsi, wiêc powinno byæ u¿yte sr0, sda lub podobne?)

source: (aren't you trying to mount an extended partition, instead of some logical partition inside?)
pl: (czy to nie próba zamontowania partycji rozszerzonej zamiast le¿±cej na niej partycji logicznej?)

source: In some cases useful info is found in syslog - try dmesg | tail or so
pl: W niektórych przypadkach przydatne informacje mo¿na znale¼æ w logu systemowym (np. dmesg | tail)

source: mount table full
pl: tablica montowania pe³na

source: mount: %s: can't read superblock
pl: mount: %s: nie mo¿na odczytaæ superbloku

source: mount: %s: unknown device
pl: mount: %s: nieznane urz±dzenie

source: mount: unknown filesystem type '%s'
pl: mount: nieznany typ systemu plików '%s'

source: mount: probably you meant %s
pl: mount: zapewne chodzi³o o %s

source: mount: maybe you meant 'iso9660'?
pl: mount: mo¿e chodzi³o o 'iso9660'?

source: mount: maybe you meant 'vfat'?
pl: mount: mo¿e chodzi³o o 'vfat'?

source: mount: %s has wrong device number or fs type %s not supported
pl: mount: %s ma b³êdny numer urz±dzenia albo typ systemu plików %s nie jest obs³ugiwany

source: mount: %s is not a block device, and stat fails?
pl: mount: %s nie jest urz±dzeniem blokowym, a stat nie udaje siê?

source: mount: the kernel does not recognize %s as a block device (maybe `modprobe driver'?)
pl: mount: j±dro nie rozpoznaje %s jako urz±dzenia blokowego (mo¿e `modprobe sterownik'?)

source: mount: %s is not a block device (maybe try `-o loop'?)
pl: mount: %s nie jest urz±dzeniem blokowym (mia³o byæ `-o loop'?)

source: mount: %s is not a block device
pl: mount: %s nie jest urz±dzeniem blokowym

source: mount: %s is not a valid block device
pl: mount: %s nie jest poprawnym urz±dzeniem blokowym

source: block device
pl: urz±dzenie blokowe

source: mount: cannot mount %s%s read-only
pl: mount: %s%s nie mo¿e byæ zamontowane tylko do odczytu

source: mount: %s%s is write-protected but explicit `-w' flag given
pl: mount: %s%s jest zabezpieczone przed zapisem, ale podano flagê `-w'

source: mount: cannot remount %s%s read-write, is write-protected
pl: mount: %s%s nie mo¿e byæ przemontowane do odczytu i zapisu - zabezpieczone przed zapisem

source: mount: %s%s is write-protected, mounting read-only
pl: mount: %s%s jest zabezpieczone przed zapisem, montowanie tylko do odczytu

source: mount: no medium found on %s
pl: mount: brak no¶nika w %s

source: mount: %s does not contain SELinux labels. You just mounted an file system that supports labels which does not contain labels, onto an SELinux box. It is likely that confined applications will generate AVC messages and not be allowed access to this file system. For more details see restorecon(8) and mount(8).
pl: mount: %s nie zawiera etykiet SELinuksa. W systemie z SELinuksem zamontowano system plików obs³uguj±cy etykiety, ale ich nie zawieraj±cy. Najprawdopodobniej aplikacje bêd± generowaæ komunikaty AVC i nie bêd± mog³y dostaæ siê do tego systemu plików. Wiêcej szczegó³ów w restorecon(8) i mount(8).

source: mount: no type was given - I'll assume nfs because of the colon
pl: mount: nie podano typu - przyjêto nfs ze wzglêdu na dwukropek

source: mount: no type was given - I'll assume cifs because of the // prefix
pl: mount: nie podano typu - przyjêto cifs ze wzglêdu na prefiks //

source: mount: ignore %s (unparsable offset= option)
pl: mount: zignorowano %s (b³êdna opcja offset=)

source: mount: %s already mounted on %s
pl: mount: %s jest ju¿ zamontowany w %s

source: Usage: mount -V : print version mount -h : print this help mount : list mounted filesystems mount -l : idem, including volume labels So far the informational part. Next the mounting. The command is `mount [-t fstype] something somewhere'. Details found in /etc/fstab may be omitted. mount -a [-t|-O] ... : mount all stuff from /etc/fstab mount device : mount device at the known place mount directory : mount known device here mount -t type dev dir : ordinary mount command Note that one does not really mount a device, one mounts a filesystem (of the given type) found on the device. One can also mount an already visible directory tree elsewhere: mount --bind olddir newdir or move a subtree: mount --move olddir newdir One can change the type of mount containing the directory dir: mount --make-shared dir mount --make-slave dir mount --make-private dir mount --make-unbindable dir One can change the type of all the mounts in a mount subtree containing the directory dir: mount --make-rshared dir mount --make-rslave dir mount --make-rprivate dir mount --make-runbindable dir A device can be given by name, say /dev/hda1 or /dev/cdrom, or by label, using -L label or by uuid, using -U uuid . Other options: [-nfFrsvw] [-o options] [-p passwdfd]. For many more details, say man 8 mount .
pl: Sk³adnia: mount -V : wy¶wietlenie wersji mount -h : wy¶wietlenie tego opisu mount : lista zamontowanych systemów plików mount -l : jw. wraz z etykietami wolumenów Powy¿ej czê¶æ informacyjna. Teraz montowanie. Polecenie to `mount [-t typ_fs] co¶ gdzie¶'. Szczegó³y obecne w /etc/fstab mo¿na pomin±æ. mount -a [-t|-O] ... : zamontowanie wszystkiego z /etc/fstab mount urz±dzenie : zamontowanie urz±dzenia w znanym miejscu mount katalog : zamontowanie tutaj znanego urz±dzenia mount -t typ urz kat : zwyk³e polecenie mount Uwaga: w³a¶ciwie nie montuje siê urz±dzenia, ale system plików (podanego typu), który znajduje siê na urz±dzeniu. Mo¿na tak¿e zamontowaæ ju¿ widoczne drzewo katalogów w innym miejscu: mount --bind stary_katalog nowy_katalog lub przenie¶æ poddrzewo: mount --move stary_katalog nowy_katalog Mo¿na zmieniæ rodzaj montowania dla podanego katalogu: mount --make-shared katalog mount --make-slave katalog mount --make-private katalog mount --make-unbindable katalog Mo¿na zmieniæ rodzaj wszystkich montowañ w poddrzewie zawieraj±cym podany katalog: mount --make-rshared katalog mount --make-rslave katalog mount --make-rprivate katalog mount --make-runbindable katalog Urz±dzenie mo¿e byæ podane przy u¿yciu nazwy, np. /dev/hda1 lub /dev/cdrom, przy u¿yciu etykiety (-L etykieta) albo przy u¿yciu UUID-a (-U uuid). Inne opcje: [-nfFrsvw] [-o opcje] [-p fdhas³a]. Du¿o wiêcej szczegó³ów znajduje siê w `man 8 mount'.

source: mount: only root can do that (effective UID is %u)
pl: mount: tylko root mo¿e to zrobiæ (efektywny UID to %u)

source: mount: only root can do that
pl: mount: tylko root mo¿e to zrobiæ

source: nothing was mounted
pl: nic nie by³o zamontowane

source: mount: no such partition found
pl: mount: nie znaleziono takiej partycji

source: mount: can't find %s in %s or %s
pl: mount: nie znaleziono %s w %s ani %s

source: [mntent]: warning: no final newline at the end of %s
pl: [mntent]: uwaga: brak znaku koñca linii na koñcu pliku %s

source: [mntent]: line %d in %s is bad%s
pl: [mntent]: linia %d w %s jest b³êdna%s

source: ; rest of file ignored
pl: ; reszta pliku zignorowana

source: bug in xstrndup call
pl: b³±d w wywo³aniu xstrndup

source: not enough memory
pl: brak pamiêci

source: The <spec> parameter: -L <label> LABEL of device to be used -U <uuid> UUID of device to be used LABEL=<label> LABEL of device to be used UUID=<uuid> UUID of device to be used <device> name of device to be used <file> name of file to be used
pl: Parametr <spec>: -L <etykieta> ETYKIETA urz±dzenia do u¿ycia -U <uuid> UUID urz±dzenia do u¿ycia LABEL=<etykieta> ETYKIETA urz±dzenia do u¿ycia UUID=<uuid> UUID urz±dzenia do u¿ycia <urz±dzenie> nazwa urz±dzenia do u¿ycia <plik> nazwa pliku do u¿ycia

source: %s [options] [<spec>]
pl: %s [opcje] [<spec>]

source: -a, --all enable all swaps from /etc/fstab -d, --discard discard freed pages before they are reused -e, --ifexists silently skip devices that do not exis -f, --fixpgsz reinitialize the swap space if necessary -h, --help display help and exit -p, --priority <prio> specify the priority of the swap device. -s, --summary display summary about used swap devices and exit -v, --verbose verbose mode -V, --version display version and exit
pl: -a, --all w³±czenie wszystkich obszarów wymiany z /etc/fstab -d, --discard kasowanie zwolnionych stron przed ponownym u¿yciem -e, --ifexists pomijanie po cichu nie istniej±cych urz±dzeñ -f, --fixpgsz ponowne inicjowanie obszaru wymiany w razie potrzeby -h, --help wy¶wietlenie opisu i zakoñczenie -p, --priority <prio> okre¶lenie priorytetu urz±dzenia wymiany -s, --summary wy¶wietlenie podsumowania u¿ycia urz±dzeñ wymiany i zakoñczenie -v, --verbose tryb szczegó³owych informacji -V, --version wy¶wietlenie informacji o wersji i zakoñczenie

source: -a, --all disable all swaps from /proc/swaps -h, --help display help and exit -v, --verbose verbose mode -V, --version display version and exit
pl: -a, --all wy³±czenie wszystkich obszarów wymiany z /proc/swaps -h, --help wy¶wietlenie opisu i zakoñczenie -v, --verbose tryb szczegó³owych informacji -V, --version wy¶wietlenie informacji o wersji i zakoñczenie

source: %s: unexpected file format
pl: %s: nieoczekiwany format pliku

source: %s: reinitializing the swap.
pl: %s: ponowna inicjalizacja swapa.

source: execv failed
pl: wywo³anie execv nie powiod³o siê

source: waitpid failed
pl: wywo³anie waitpid nie powiod³o siê

source: %s: lseek failed
pl: %s: lseek nie powiód³ siê

source: %s: write signature failed
pl: %s: zapis sygnatury nie powiód³ siê

source: %s: found swap signature: version %d, page-size %d, %s byte order
pl: %s: znaleziono sygnaturê swapa: wersja %d, rozmiar strony %d, %s kolejno¶æ bajtów

source: different
pl: inna

source: same
pl: taka sama

source: %s: insecure permissions %04o, %04o suggested.
pl: %s: niebezpieczne uprawnienia %04o, powinno byæ %04o.

source: %s: insecure file owner %d, 0 (root) suggested.
pl: %s: niebezpieczny w³a¶ciciel pliku %d, sugerowany 0 (root).

source: %s: skipping - it appears to have holes.
pl: %s: pominiêto - wydaje siê mieæ dziury.

source: %s: get size failed
pl: %s: odczyt rozmiaru nie powiód³ siê

source: %s: read swap header failed
pl: %s: odczyt nag³ówka swapa nie powiód³ siê

source: %s: last_page 0x%08llx is larger than actual size of swapspace
pl: %s: last_page 0x%08llx wynosi wiêcej ni¿ rozmiar przestrzeni wymiany

source: %s: swap format pagesize does not match.
pl: %s: rozmiar strony formatu swapa nie zgadza siê.

source: %s: swap format pagesize does not match. (Use --fixpgsz to reinitialize it.)
pl: %s: rozmiar strony formatu swapa nie zgadza siê (--fixpgsz pozwali to przeinicjowaæ).

source: %s: software suspend data detected. Rewriting the swap signature.
pl: %s: wykryto dane programowego wstrzymania. Ponowny zapis sygnatury swapa.

source: %s on %s
pl: %s na %s

source: %s: swapon failed
pl: %s: swapon nie powiod³o siê

source: cannot find the device for %s
pl: nie mo¿na odnale¼æ urz±dzenia dla %s

source: Not superuser.
pl: Trzeba byæ superu¿ytkownikiem.

source: %s: swapoff failed
pl: %s: swapoff nie powiod³o siê

source: '%s' is unsupported program name (must be 'swapon' or 'swapoff').
pl: '%s' nie jest obs³ugiwan± nazw± programu (musi byæ 'swapon' lub 'swapoff').

source: umount: compiled without support for -f
pl: umount: skompilowano bez obs³ugi -f

source: umount: cannot set group id: %s
pl: umount: nie mo¿na ustawiæ identyfikatora grupy: %s

source: umount: cannot set user id: %s
pl: umount: nie mo¿na ustawiæ identyfikatora u¿ytkownika: %s

source: umount: cannot fork: %s
pl: umount: nie mo¿na wykonaæ fork: %s

source: umount: %s: invalid block device
pl: umount: %s: nieprawid³owe urz±dzenie blokowe

source: umount: %s: not mounted
pl: umount: %s: nie jest zamontowane

source: umount: %s: can't write superblock
pl: umount: %s: nie mo¿na zapisaæ superbloku

source: umount: %s: device is busy. (In some cases useful info about processes that use the device is found by lsof(8) or fuser(1))
pl: umount: %s: urz±dzenie jest zajête. (w niektórych przypadkach informacje o procesach korzystaj±cych z urz±dzenia mo¿na znale¼æ przy pomocy lsof(8) lub fuser(1))

source: umount: %s: not found
pl: umount: %s: nie znaleziono

source: umount: %s: must be superuser to umount
pl: umount: %s: trzeba byæ superu¿ytkownikiem, ¿eby odmontowaæ

source: umount: %s: block devices not permitted on fs
pl: umount: %s: urz±dzenia blokowe nie s± dozwolone w systemie plików

source: umount: internal error: invalid abs path: %s
pl: umount: b³±d wewnêtrzny: b³êdna ¶cie¿ka bezwzglêdna: %s

source: umount: failed to chdir to %s: %s
pl: umount: b³±d podczas zmiany katalogu na %s: %s

source: umount: failed to obtain current directory: %s
pl: umount: nie uda³o uzyskaæ bie¿±cego katalogu: %s

source: umount: mountpoint moved (%s -> %s)
pl: umount: punkt montowania przeniesiony (%s -> %s)

source: current directory moved to %s
pl: bie¿±cy katalog przeniesiono do %s

source: no umount2, trying umount...
pl: brak umount2, próba wykonania umount...

source: umount: %s busy - remounted read-only
pl: umount: %s jest zajêty - przemontowano tylko do odczytu

source: umount: could not remount %s read-only
pl: umount: nie uda³o siê przemontowaæ %s tylko do odczytu

source: %s has been unmounted
pl: %s zosta³ odmontowany

source: umount: cannot find list of filesystems to unmount
pl: umount: nie mo¿na odnale¼æ listy systemów plików do odmontowania
