Repository: RMerl/asuswrt-merlin
Catalog: release/src/router/util-linux/po/*.po
Languages: pl

source: Detected an OSF/1 disklabel on %s, entering disklabel mode.
pl: Na %s wykryto etykietê dysku OSF/1, wej¶cie w tryb etykiety dysku

source: Command (m for help):
pl: Polecenie (m wy¶wietla pomoc):

source: The current boot file is: %s
pl: Obecny plik rozruchowy to: %s

source: Please enter the name of the new boot file:
pl: Proszê wpisaæ nazwê nowego pliku rozruchowego:

source: Boot file unchanged
pl: Plik rozruchowy pozosta³ bez zmian

source: Sorry, no experts menu for SGI partition tables available.
pl: Niestety menu eksperta dla tablicy partycji SGI nie jest dostêpne.

source: There is a valid Mac label on this disk. Unfortunately fdisk(1) cannot handle these disks. Use either pdisk or parted to modify the partition table. Nevertheless some advice: 1. fdisk will destroy its contents on write. 2. Be sure that this disk is NOT a still vital part of a volume group. (Otherwise you may erase the other disks as well, if unmirrored.)
pl: Na tym dysku istnieje poprawna etykieta typu Mac. Niestety Linux nie obecnie nie potrafi obs³u¿yæ takich dysków. Tym niemniej kilka uwag: 1. fdisk zniszczy jej zawarto¶æ przy zapisie. 2. Nale¿y siê upewniæ, ¿e ten dysk NIE pozostaje aktywn± czê¶ci± ¿adnej grupy wolumenów (w przeciwnym wypadku mo¿na usun±æ tak¿e zawarto¶æ innych dysków, je¶li nie maj± kopii).

source: According to MIPS Computer Systems, Inc the Label must not contain more than 512 bytes
pl: Zgodnie z wytycznymi MIPS Computer Systems, Inc etykieta nie mo¿e zawieraæ wiêcej ni¿ 512 bajtów

source: Detected sgi disklabel with wrong checksum.
pl: Wykryto etykietê dysku SGI z b³êdn± sum± kontroln±.

source: Disk %s (SGI disk label): %d heads, %llu sectors %d cylinders, %d physical cylinders %d extra sects/cyl, interleave %d:1 %s Units = %s of %d * %d bytes
pl: Dysk %s (etykieta dysku SGI): g³owic: %d, sektorów: %llu cylindrów: %d, fizycznych cylindrów: %d dodatkowych sektorów/cylinder: %d, przeplot %d:1 %s Jednostka = %s, czyli %d * %d bajtów

source: Disk %s (SGI disk label): %d heads, %llu sectors, %d cylinders Units = %s of %d * %d bytes
pl: Dysk %s (etykieta dysku SGI): g³owic: %d, sektorów: %llu, cylindrów: %d Jednostka: %s, czyli %d * %d bajtów

source: ----- partitions ----- Pt# %*s Info Start End Sectors Id System
pl: ----- partycje ----- Pt# %*s Info Pocz±tek Koniec Sektorów ID System

source: ----- Bootinfo ----- Bootfile: %s ----- Directory Entries -----
pl: ----- Rozruch ----- Plik rozruchu: %s ----- Wpisy katalogu -----

source: %2d: %-10s sector%5u size%8u
pl: %2d: %-10s sektor%5u rozmiar%8u

source: Invalid Bootfile! The bootfile must be an absolute non-zero pathname, e.g. "/unix" or "/unix.save".
pl: Niepoprawny plik rozruchowy! Plik rozruchowy musi byæ bezwzglêdn±, niepust± ¶cie¿k±, np. "/unix" lub "/unix.save".

source: Name of Bootfile too long: 16 bytes maximum.
pl: Nazwa pliku rozruchowego zbyt d³uga: maksimum to 16 bajtów.

source: Bootfile must have a fully qualified pathname.
pl: Plik rozruchowy musi mieæ pe³n± ¶cie¿kê.

source: Be aware, that the bootfile is not checked for existence. SGI's default is "/unix" and for backup "/unix.save".
pl: Uwaga: program nie sprawdza istnienia pliku rozruchowego. Domy¶lny dla SGI to "/unix" oraz "unix.save" dla kopii zapasowej.

source: Bootfile is changed to "%s".
pl: Plik rozruchowy zmieniony na "%s".

source: More than one entire disk entry present.
pl: Istnieje wiêcej ni¿ jeden wpis dla ca³ego dysku.

source: No partitions defined
pl: Nie zdefiniowano ¿adnej partycji

source: IRIX likes when Partition 11 covers the entire disk.
pl: IRIX lubi gdy partycja 11 pokrywa ca³y dysk.

source: The entire disk partition should start at block 0, not at diskblock %d.
pl: Partycja ca³ego dysku powinna zaczynaæ siê od bloku 0, a nie bloku dysku %d.

source: The entire disk partition is only %d diskblock large, but the disk is %d diskblocks long.
pl: Partycja ca³ego dysku ma rozmiar tylko %d bloków dysku, podczas gdy dysk ma %d bloków.

source: One Partition (#11) should cover the entire disk.
pl: Jedna partycja (#11) powinna pokrywaæ ca³y dysk.

source: Partition %d does not start on cylinder boundary.
pl: Partycja %d nie zaczyna siê na granicy cylindra.

source: Partition %d does not end on cylinder boundary.
pl: Partycja %d nie koñczy siê na granicy cylindra.

source: The Partition %d and %d overlap by %d sectors.
pl: Partycje %d i %d zachodz± na siebie %d sektorami.

source: Unused gap of %8u sectors - sectors %8u-%u
pl: Nieu¿ywany odstêp %8u sektorów - sektory %8u-%u

source: The boot partition does not exist.
pl: Partycja rozruchowa nie istnieje.

source: The swap partition does not exist.
pl: Partycja wymiany nie istnieje.

source: The swap partition has no swap type.
pl: Partycja wymiany nie jest typu swap.

source: You have chosen an unusual boot file name.
pl: Wybrano niestandardow± nazwê pliku rozruchowego.

source: Sorry, only for non-empty partitions you can change the tag.
pl: Niestety znacznik mo¿na zmieniaæ tylko dla niepustych partycji.

source: It is highly recommended that the partition at offset 0 is of type "SGI volhdr", the IRIX system will rely on it to retrieve from its directory standalone tools like sash and fx. Only the "SGI volume" entire disk section may violate this. Type YES if you are sure about tagging this partition differently.
pl: Zdecydowanie zaleca siê, aby partycja pod offsetem 0 by³a typu "SGI volhdr"; system IRIX polega na tym przy odczycie z katalogu samodzielnych narzêdzi, takich jak sash i fx. Jedynie sekcja ca³ego dysku "SGI volume" mo¿e byæ niezgodna z tym zaleceniem. Proszê wpisaæ TAK, je¶li na pewno ta partycja ma byæ oznaczona inaczej.

source: YES
pl: TAK

source: Do You know, You got a partition overlap on the disk?
pl: Na tym dysku partycje zachodz± na siebie.

source: Attempting to generate entire disk entry automatically.
pl: Próba automatycznego wygenerowania wpisy dla ca³ego dysku.

source: The entire disk is already covered with partitions.
pl: Ca³y dysk jest ju¿ pokryty partycjami.

source: You got a partition overlap on the disk. Fix it first!
pl: Na tym dysku partycje zachodz± na siebie. Najpierw trzeba to poprawiæ!

source: It is highly recommended that eleventh partition covers the entire disk and is of type `SGI volume'
pl: Zdecydowanie zaleca siê, aby partycja jedenasta pokrywa³a ca³y dysk i by³a typu `SGI volume'

source: You will get a partition overlap on the disk. Fix it first!
pl: Na tym dysku partycje bêd± zachodzi³y na siebie. Najpierw trzeba to poprawiæ!

source: Last %s
pl: Ostatni %s

source: Building a new SGI disklabel. Changes will remain in memory only, until you decide to write them. After that, of course, the previous content will be unrecoverably lost.
pl: Tworzenie nowej etykiety dysku SGI. Zmiany pozostan± tylko w pamiêci do chwili ich zapisania. Potem, oczywi¶cie, poprzednia zawarto¶æ bêdzie nie do odzyskania.

source: Warning: BLKGETSIZE ioctl failed on %s. Using geometry cylinder value of %d. This value may be truncated for devices > 33.8 GB.
pl: Uwaga: ioctl BLKGETSIZE na %s nie powiód³ siê. Przyjêto liczbê cylindrów %d. Ta warto¶æ mo¿e byæ uciêta dla urz±dzeñ > 33.8GB.

source: Trying to keep parameters of partition %d.
pl: Próba zachowania parametrów partycji %d.

source: ID=%02x START=%d LENGTH=%d
pl: ID=%02x POCZ¡TEK=%d D£UGO¦Æ=%d

source: Unassigned
pl: Bez przydzia³u

source: Whole disk
pl: Ca³y dysk

source: Detected sun disklabel with wrong checksum. Probably you'll have to set all the values, e.g. heads, sectors, cylinders and partitions or force a fresh label (s command in main menu)
pl: Wykryto etykietê dysku Suna z b³êdn± sum± kontroln±. Prawdopodobnie bêdzie trzeba ustawiæ wszystkie warto¶ci, tzn. g³owice, sektory, cylindry i partycje albo wymusiæ utworzenie nowej etykiety (polecenie s w menu g³ównym)

source: Detected sun disklabel with wrong version [0x%08x].
pl: Wykryto etykietê dysku Suna z b³êdn± wersj± [0x%08x].

source: Detected sun disklabel with wrong sanity [0x%08x].
pl: Wykryto etykietê dysku Suna z b³êdnym znacznikiem poprawno¶ci [0x%08x].

source: Detected sun disklabel with wrong num_partitions [%u].
pl: Wykryto etykietê dysku Suna z b³êdn± liczb± partycji [%u].

source: Warning: Wrong values need to be fixed up and will be corrected by w(rite)
pl: Uwaga: B³êdne warto¶ci musz± byæ poprawione, co nast±pi przy zapisie (w)

source: Building a new sun disklabel. Changes will remain in memory only, until you decide to write them. After that, of course, the previous content won't be recoverable.
pl: Tworzenie nowej etykiety dysku Suna. Zmiany pozostan± tylko w pamiêci do chwili ich zapisania. Potem, oczywi¶cie, poprzednia zawarto¶æ bêdzie nie do odzyskania.

source: Sectors/track
pl: Sektorów/¶cie¿kê

source: Partition %d doesn't end on cylinder boundary
pl: Partycja %d nie koñczy siê na granicy cylindra

source: Partition %d overlaps with others in sectors %d-%d
pl: Partycja %d zachodzi na inne w sektorach %d-%d

source: Unused gap - sectors 0-%d
pl: Nieu¿ywany odstêp - sektory 0-%d

source: Unused gap - sectors %d-%d
pl: Nieu¿ywany odstêp - sektory %d-%d

source: Other partitions already cover the whole disk. Delete some/shrink them before retry.
pl: Inne partycje ju¿ pokrywaj± ca³y dysk. Najpierw trzeba co¶ usun±æ/zmniejszyæ.

source: It is highly recommended that the third partition covers the whole disk and is of type `Whole disk'
pl: Zdecydowanie zaleca siê, aby trzecia partycja pokrywa³a ca³y dysk i by³a typu `Ca³y dysk'

source: Sector %d is already allocated
pl: Sektor %d jest ju¿ przydzielony

source: You haven't covered the whole disk with the 3rd partition, but your value %d %s covers some other partition. Your entry has been changed to %d %s
pl: Nie pokryto ca³ego dysku trzeci± partycj±, ale warto¶æ %d %s pokrywa inn± partycjê. Wpis zosta³ zmieniony na %d %s

source: If you want to maintain SunOS/Solaris compatibility, consider leaving this partition as Whole disk (5), starting at 0, with %u sectors
pl: Aby zachowaæ kompatybilno¶æ z SunOS-em/Solarisem, najlepiej pozostawiæ tê partycjê jako ca³y dysk (5), zaczynaj±c± siê od 0, o %u sektorach

source: It is highly recommended that the partition at offset 0 is UFS, EXT2FS filesystem or SunOS swap. Putting Linux swap there may destroy your partition table and bootblock. Type YES if you're very sure you would like that partition tagged with 82 (Linux swap):
pl: Zdecydowanie zaleca siê, aby partycja pod offsetem 0 by³a typu UFS, EXT2FS lub SunOS swap. Umieszczenie tutaj partycji wymiany Linuksa mo¿e zniszczyæ tablicê partycji i blok rozruchowy. Proszê wpisaæ TA, je¶li na pewno ta partycja ma mieæ typ 82 (Linux swap):

source: Disk %s (Sun disk label): %u heads, %llu sectors, %d rpm %u cylinders, %d alternate cylinders, %d physical cylinders %d extra sects/cyl, interleave %d:1 Label ID: %s Volume ID: %s Units = %s of %d * 512 bytes
pl: Dysk %s (etykieta dysku Suna): g³owic: %u, sektorów: %llu, rpm: %d cylindrów: %u, zmiennych cylindrów: %d, fizycznych cylindrów: %d dodatkowych sektorów/cylinder: %d, przeplot: %d:1 ID etykiety: %s ID wolumenu: %s Jednostka: %s, czyli %d * 512 bajtów

source: Disk %s (Sun disk label): %u heads, %llu sectors, %u cylinders Units = %s of %d * 512 bytes
pl: Dysk %s (etykieta dysku Suna): g³owic: %u, sektorów: %llu, cylindrów: %u Jednostka: %s, czyli %d * 512 bajtów

source: %*s Flag Start End Blocks Id System
pl: %*s Flaga Pocz±tek Koniec Bloków Id System

source: Number of alternate cylinders
pl: Liczba zmiennych cylindrów

source: Extra sectors per cylinder
pl: Dodatkowych sektorów na cylinder

source: Interleave factor
pl: Wspó³czynnik przeplotu

source: Rotation speed (rpm)
pl: Prêdko¶æ obrotowa (rpm)

source: Number of physical cylinders
pl: Liczba fizycznych cylindrów

source: Empty
pl: Brak

source: Extended
pl: Rozszerzona

source: AIX bootable
pl: AIX startowa

source: W95 Ext'd (LBA)
pl: W95 Rozsz. (LBA)

source: Hidden FAT12
pl: Ukryta FAT12

source: Hidden FAT16 <32M
pl: Ukryta FAT16 <32M

source: Hidden FAT16
pl: Ukryta FAT16

source: Hidden HPFS/NTFS
pl: Ukryta HPFS/NTFS

source: Hidden W95 FAT32
pl: Ukryta W95 FAT32

source: Hidden W95 FAT32 (LBA)
pl: Ukryta W95 FAT32 (LBA)

source: Hidden W95 FAT16 (LBA)
pl: Ukryta W95 FAT16 (LBA)

source: Hidden NTFS WinRE
pl: Ukryta HPFS WinRE

source: QNX4.x 2nd part
pl: QNX4.x part. 2.

source: QNX4.x 3rd part
pl: QNX4.x part. 3.

source: GNU HURD or SysV
pl: GNU HURD lub SysV

source: Old Minix
pl: Stary Minix

source: Minix / old Linux
pl: Minix / stary Linux

source: OS/2 hidden C: drive
pl: OS/2 ukryty dysk C:

source: Linux extended
pl: Linux ext

source: Boot Wizard hidden
pl: Ukryta Boot Wizard

source: seek error on %s - cannot seek to %lu
pl: b³±d przemieszczania na %s - nie mo¿na przesun±æ na %lu

source: seek error: wanted 0x%08x%08x, got 0x%08x%08x
pl: b³±d przemieszczania: ¿±dano 0x%08x%08x, otrzymano 0x%08x%08x

source: out of memory - giving up
pl: brak pamiêci - poddajê siê

source: read error on %s - cannot read sector %lu
pl: b³±d odczytu na %s - nie mo¿na odczytaæ sektora %lu

source: ERROR: sector %lu does not have an msdos signature
pl: B£¡D: sektor %lu nie zawiera sygnatury MSDOS

source: write error on %s - cannot write sector %lu
pl: b³±d zapisu na %s - nie mo¿na zapisaæ sektora %lu

source: cannot open partition sector save file (%s)
pl: nie mo¿na otworzyæ pliku zapisu sektora partycji (%s)

source: write error on %s
pl: b³±d zapisu na %s

source: cannot stat partition restore file (%s)
pl: nie mo¿na wykonaæ stat na pliku odtwarzania partycji (%s)

source: partition restore file has wrong size - not restoring
pl: plik odtwarzania partycji ma b³êdny rozmiar - bez odtwarzania

source: out of memory?
pl: brak pamiêci?

source: cannot open partition restore file (%s)
pl: nie mo¿na otworzyæ pliku odtwarzania partycji (%s)

source: error reading %s
pl: b³±d odczytu %s

source: cannot open device %s for writing
pl: nie mo¿na otworzyæ urz±dzenia %s do zapisu

source: error writing sector %lu on %s
pl: b³±d zapisu sektora %lu na %s

source: Disk %s: cannot get geometry
pl: Dysk %s: nie mo¿na pobraæ geometrii

source: Disk %s: cannot get size
pl: Dysk %s: nie mo¿na pobraæ rozmiaru

source: Warning: start=%lu - this looks like a partition rather than the entire disk. Using fdisk on it is probably meaningless. [Use the --force option if you really want this]
pl: Uwaga: pocz±tek=%lu - wygl±da to na partycjê, a nie ca³y dysk. U¿ywanie na niej fdiska prawdopodobnie nic nie da. [Je¶li naprawdê o to chodzi - proszê u¿yæ opcji --force]

source: Warning: HDIO_GETGEO says that there are %lu heads
pl: Uwaga: HDIO_GETGEO twierdzi, ¿e liczba g³owic to %lu

source: Warning: HDIO_GETGEO says that there are %lu sectors
pl: Uwaga: HDIO_GETGEO twierdzi, ¿e liczba sektorów to %lu

source: Warning: BLKGETSIZE/HDIO_GETGEO says that there are %lu cylinders
pl: Uwaga: BLKGETSIZE/HDIO_GETGEO twierdzi, ¿e liczba cylindrów to %lu

source: Warning: unlikely number of sectors (%lu) - usually at most 63 This will give problems with all software that uses C/H/S addressing.
pl: Uwaga: ma³o prawdopodobna liczba sektorów (%lu) - zwykle s± najwy¿ej 63 Spowoduje to problemy z ka¿dym oprogramowaniem u¿ywaj±cym adresowania C/H/S.

source: Disk %s: %lu cylinders, %lu heads, %lu sectors/track
pl: Dysk %s: cylindrów: %lu, g³owic: %lu, sektorów na ¶cie¿ce: %lu

source: %s of partition %s has impossible value for head: %lu (should be in 0-%lu)
pl: %s dla partycji %s ma niemo¿liw± liczbê g³owic: %lu (powinna byæ 0-%lu)

source: %s of partition %s has impossible value for sector: %lu (should be in 1-%lu)
pl: %s dla partycji %s ma niemo¿liw± liczbê sektorów: %lu (powinna byæ 1-%lu)

source: %s of partition %s has impossible value for cylinders: %lu (should be in 0-%lu)
pl: %s dla partycji %s ma niemo¿liw± liczbê cylindrów: %lu (powinna byæ 0-%lu)

source: Id Name
pl: Id Nazwa

source: Re-reading the partition table ...
pl: Ponowny odczyt tablicy partycji...

source: The command to re-read the partition table failed. Run partprobe(8), kpartx(8) or reboot your system now, before using mkfs
pl: Polecenie ponownego odczytu tablicy partycji nie powiod³o siê. Przed mkfs nale¿y uruchomiæ partprobe(8), kpartx(8) lub zrestartowaæ system.

source: Error closing %s
pl: B³±d zamykania %s

source: %s: no such partition
pl: %s: nie ma takiej partycji

source: unrecognized format - using sectors
pl: nierozpoznany format - u¿ycie sektorów

source: unimplemented format - using %s
pl: format niezaimplementowany - u¿ycie %s

source: Units = cylinders of %lu bytes, blocks of 1024 bytes, counting from %d
pl: Jednostka = cylindry, czyli %lu bajtów, bloki 1024-bajtowe liczone od %d

source: Device Boot Start End #cyls #blocks Id System
pl: Urz±dz.Rozr. Pocz±tek Koniec #cyl. #bloków Id System

source: Units = sectors of 512 bytes, counting from %d
pl: Jednostka = sektory 512-bajtowe, liczone od %d

source: Device Boot Start End #sectors Id System
pl: Urz±dz. Rozruch Pocz±tek Koniec #sektorów Id System

source: Units = blocks of 1024 bytes, counting from %d
pl: Jednostka = bloki 1024-bajtowe, liczone od %d

source: Device Boot Start End #blocks Id System
pl: Urz±dz.Rozruch Pocz±tek Koniec #bloków Id System

source: Units = mebibytes of 1048576 bytes, blocks of 1024 bytes, counting from %d
pl: Jednostka = mebibajty (1048576 bajtów), bloki 1024-bajtowe, liczone od %d

source: Device Boot Start End MiB #blocks Id System
pl: Urz±dz.Rozr. Pocz. Koniec MiB #bloków Id System

source: start: (c,h,s) expected (%ld,%ld,%ld) found (%ld,%ld,%ld)
pl: pocz±tek: (c,h,s) oczekiwane (%ld,%ld,%ld), otrzymano (%ld,%ld,%ld)

source: end: (c,h,s) expected (%ld,%ld,%ld) found (%ld,%ld,%ld)
pl: end: (c,h,s) oczekiwane (%ld,%ld,%ld), otrzymano (%ld,%ld,%ld)

source: partition ends on cylinder %ld, beyond the end of the disk
pl: partycja koñczy siê na cylindrze %ld, za koñcem dysku

source: No partitions found
pl: Nie znaleziono ¿adnej partycji

source: Warning: The partition table looks like it was made for C/H/S=*/%ld/%ld (instead of %ld/%ld/%ld). For this listing I'll assume that geometry.
pl: Uwaga: tablica partycji wygl±da, jakby zosta³a utworzona dla C/H/S=*/%ld/%ld (zamiast %ld/%ld/%ld). Dla tego listingu za³o¿ono tê geometriê.

source: no partition table present.
pl: tablica partycji nie istnieje.

source: strange, only %d partitions defined.
pl: dziwne, zdefiniowano tylko %d partycji.

source: Warning: partition %s has size 0 but is not marked Empty
pl: Uwaga: partycja %s ma rozmiar 0, ale nie jest zaznaczona jako pusta

source: Warning: partition %s has size 0 and is bootable
pl: Uwaga: partycja %s ma rozmiar 0, a jest rozruchowa

source: Warning: partition %s has size 0 and nonzero start
pl: Uwaga: partycja %s ma rozmiar 0 i niezerowy pocz±tek

source: Warning: partition %s is not contained in partition %s
pl: Uwaga: partycja %s nie zawiera siê w partycji %s

source: Warning: partitions %s and %s overlap
pl: Uwaga: partycje %s i %s zachodz± na siebie

source: Warning: partition %s contains part of the partition table (sector %lu), and will destroy it when filled
pl: Uwaga: partycja %s zawiera czê¶æ tablicy partycji (sektor %lu) i zostanie zniszczona po jej wype³nieniu

source: Warning: partition %s starts at sector 0
pl: Uwaga: partycja %s zaczyna siê od sektora 0

source: Warning: partition %s extends past end of disk
pl: Uwaga: partycja %s wystaje za koniec dysku

source: Among the primary partitions, at most one can be extended (although this is not a problem under Linux)
pl: Spo¶ród partycji g³ównych najwy¿ej jedna mo¿e byæ rozszerzona (jednak¿e nie jest to problemem pod Linuksem)

source: Warning: partition %s does not start at a cylinder boundary
pl: Uwaga: partycja %s nie zaczyna siê na granicy cylindra

source: Warning: partition %s does not end at a cylinder boundary
pl: Uwaga: partycja %s nie koñczy siê na granicy cylindra

source: Warning: more than one primary partition is marked bootable (active) This does not matter for LILO, but the DOS MBR will not boot this disk.
pl: Uwaga: wiêcej ni¿ jedna g³ówna partycja jest zaznaczona jako rozruchowa (aktywna). Dla LILO nie ma to znaczenia, ale DOS-owy MBR nie uruchomi systemu z tego dysku.

source: Warning: usually one can boot from primary partitions only LILO disregards the `bootable' flag.
pl: Uwaga: zwykle mo¿na uruchomiæ system tylko z partycji g³ównych. LILO nie bierze pod uwagê flagi rozruchu.

source: Warning: no primary partition is marked bootable (active) This does not matter for LILO, but the DOS MBR will not boot this disk.
pl: Uwaga: ¿adna partycja g³ówna nie jest zaznaczona jako rozruchowa (aktywna). Nie ma to znaczenia dla LILO, ale DOS-owy MBR nie uruchomi systemu z tego dysku.

source: start
pl: pocz±tek

source: partition %s: start: (c,h,s) expected (%ld,%ld,%ld) found (%ld,%ld,%ld)
pl: partycja %s: pocz±tek: (c,h,s) oczekiwane (%ld,%ld,%ld), otrzymano (%ld,%ld,%ld)

source: end
pl: koniec

source: partition %s: end: (c,h,s) expected (%ld,%ld,%ld) found (%ld,%ld,%ld)
pl: partycja %s: koniec: (c,h,s) oczekiwane (%ld,%ld,%ld), otrzymano (%ld,%ld,%ld)

source: partition %s ends on cylinder %ld, beyond the end of the disk
pl: partycja %s koñczy siê na cylindrze %ld, za koñcem dysku

source: Warning: shifted start of the extd partition from %ld to %ld (For listing purposes only. Do not change its contents.)
pl: Uwaga: przesuniêto pocz±tek partycji rozszerzonej z %ld na %ld (tylko na potrzeby listy - bez zmiany zawarto¶ci).

source: Warning: extended partition does not start at a cylinder boundary. DOS and Linux will interpret the contents differently.
pl: Uwaga: partycja rozszerzona nie zaczyna siê na granicy cylindra. DOS i Linux inaczej zinterpretuj± jej zawarto¶æ.

source: too many partitions - ignoring those past nr (%d)
pl: zbyt du¿o partycji - zignorowano przekraczaj±ce nr %d

source: tree of partitions?
pl: drzewo partycji?

source: detected Disk Manager - unable to handle that
pl: wykryto Disk Manager - program nie mo¿e tego obs³u¿yæ

source: DM6 signature found - giving up
pl: wykryto sygnaturê DM6 - poddajê siê

source: strange..., an extended partition of size 0?
pl: dziwne... partycja rozszerzona rozmiaru 0?

source: strange..., a BSD partition of size 0?
pl: dziwne... partycja BSD rozmiaru 0?

source: %s: unrecognized partition table type
pl: %s: nierozpoznany typ tablicy partycji

source: -n flag was given: Nothing changed
pl: podano flagê -n: bez zmian

source: Failed saving the old sectors - aborting
pl: Nie uda³o siê zapisaæ starych sektorów - przerwano

source: Failed writing the partition on %s
pl: Nie uda³o siê zapisaæ partycji na %s

source: long or incomplete input line - quitting
pl: d³uga lub niekompletna linia na wej¶ciu - zakoñczenie

source: input error: `=' expected after %s field
pl: b³±d wej¶cia: oczekiwano `=' po polu %s

source: input error: unexpected character %c after %s field
pl: b³±d wej¶cia: oczekiwano znaku %c po polu %s

source: unrecognized input: %s
pl: nierozpoznane wej¶cie: %s

source: number too big
pl: liczba zbyt du¿a

source: trailing junk after number
pl: koñcowe ¶mieci po liczbie

source: no room for partition descriptor
pl: brak miejsca na deskryptor partycji

source: cannot build surrounding extended partition
pl: nie mo¿na zbudowaæ otaczaj±cej partycji rozszerzonej

source: too many input fields
pl: zbyt du¿o pól wej¶ciowych

source: No room for more
pl: Brak miejsca na wiêcej

source: Illegal type
pl: Niedozwolony typ

source: Warning: given size (%lu) exceeds max allowable size (%lu)
pl: Uwaga: podany rozmiar (%lu) przekracza maksymalny dopuszczalny (%lu)

source: Warning: empty partition
pl: Uwaga: pusta partycja

source: Warning: bad partition start (earliest %lu)
pl: Uwaga: b³êdny pocz±tek partycji (najbli¿szy %lu)

source: unrecognized bootable flag - choose - or *
pl: nierozpoznana flaga rozruchu - proszê wybraæ - lub *

source: partial c,h,s specification?
pl: czê¶ciowa specyfikacja c,h,s?
