Repository: RMerl/asuswrt-merlin
Catalog: release/src/router/util-linux/po/*.po
Languages: pl

source: Extended partition not where expected
pl: Partycja rozszerzona nie tam, gdzie jej oczekiwano

source: bad input
pl: b³êdne wej¶cie

source: too many partitions
pl: zbyt du¿o partycji

source: Input in the following format; absent fields get a default value. <start> <size> <type [E,S,L,X,hex]> <bootable [-,*]> <c,h,s> <c,h,s> Usually you only need to specify <start> and <size> (and perhaps <type>).
pl: Wej¶cie jest w nastêpuj±cej postaci (puste pola oznaczaj± warto¶æ domy¶ln±): <pocz±tek> <rozmiar> <typ [E,S,L,X,hex]> <rozruch [-,*> <c,h,s> <c,h,s> Zwykle trzeba podaæ tylko <pocz±tek> i <rozmiar> (oraz ewentualnie <typ>).

source: Usage:
pl: Sk³adnia:

source: %s [options] <device> [...]
pl: %s [opcje] <urz±dzenie> [...]

source: Options:
pl: Opcje:

source: -s, --show-size list size of a partition -c, --id change or print partition Id --change-id change Id --print-id print Id
pl: -s, --show-size wypisanie rozmiaru partycji -c, --id zmiana lub wypisanie identyfikatora partycji --change-id zmiana identyfikatora --print-id wypisanie identyfikatora

source: -l, --list list partitions of each device -d, --dump idem, but in a format suitable for later input -i, --increment number cylinders etc. from 1 instead of from 0 -u, --unit <letter> units to be used; <letter> can be one of S (sectors), C (cylinders), B (blocks), or M (MB)
pl: -l, --list wypisanie partycji na ka¿dym urz±dzeniu -d, --dump jw., ale w formacie nadaj±cym siê dla wej¶cia -i, --increment numerowanie cylindrów itp. od 1 zamiast od 0 -u, --unit <litera> u¿ywane jednostki; <litera> mo¿e byæ jedn± z: S (sektory), C (cylindry), B (bloki) lub M (MB)

source: -1, --one-only reserved option that does nothing currently -T, --list-types list the known partition types -D, --DOS for DOS-compatibility: waste a little space -E, --DOS-extended DOS extended partition compatibility -R, --re-read make the kernel reread the partition table
pl: -1, --one-only opcja zarezerwowana, obecnie bez znaczenia -T, --list-types wypisanie znanych typów partycji -D, --DOS kompatybilno¶æ z DOS; zmarnowanie odrobiny miejsca -E, --DOS-extended kompatybilno¶æ z rozszerzon± partycj± DOS -R, --re-read wymuszenie ponownego odczytu tabl. part. przez j±dro

source: -N <number> change only the partition with this <number> -n do not actually write to disk -O <file> save the sectors that will be overwritten to <file> -I <file> restore sectors from <file>
pl: -N <numer> zmiana tylko partycji o podanym <numerze> -n bez w³a¶ciwego zapisu na dysk -O <plik> zapis nadpisywanych sektorów do <pliku> -I <plik> odtworzenie sektorów z <pliku>

source: -V, --verify check that the listed partitions are reasonable -v, --version display version information and exit -h, --help display this help text and exit
pl: -V, --verify sprawdzenie sensowno¶ci wypisywanych partycji -v, --version wy¶wietlenie informacji o wersji i zakoñczenie -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: Dangerous options:
pl: Opcje niebezpieczne:

source: -f, --force disable all consistency checking --no-reread do not check whether the partition is in use -q, --quiet suppress warning messages -L, --Linux do not complain about things irrelevant for Linux
pl: -f, --force wy³±czenie wszelkiego sprawdzania spójno¶ci --no-reread bez sprawdzania, czy partycje s± u¿ywane -q, --quiet pominiêcie komunikatów ostrze¿eñ -L, --Linux bez ostrze¿eñ o faktach nieistotnych dla Linuksa

source: -g, --show-geometry print the kernel's idea of the geometry -G, --show-pt-geometry print geometry guessed from the partition table
pl: -g, --show-geometry wypisanie geometrii wg informacji z j±dra -G, --show-pt-geometry wypisanie geometrii odgadniêtej z tabl. partycji

source: -A, --activate[=<device>] activate bootable flag -U, --unhide[=<dev>] set partition unhidden -x, --show-extended also list extended partitions in the output, or expect descriptors for them in the input
pl: -A, --activate[=<urz±dz>] ustawienie flagi partycji rozruchowej -U, --unhide[=<urz±dz>] ustawienie partycji jako nie ukrytej -x, --show-extended wypisywanie na wyj¶ciu tak¿e partycji rozszerzonych lub oczekiwanie ich deskryptorów na wej¶ciu

source: --leave-last do not allocate the last cylinder --IBM same as --leave-last
pl: --leave-last bez przydzielania ostatniego cylindra --IBM to samo, co --leave-last

source: --in-order partitions are in order --not-in-order partitions are not in order --inside-outer all logicals inside outermost extended --not-inside-outer not all logicals inside outermost extended
pl: --in-order partycje s± w kolejno¶ci --not-in-order partycje nie s± w kolejno¶ci --inside-outer wszystkie logiczne wewn±trz zewnêtrznej rozszerzonej --not-inside-outer nie wszystkie logiczne wewn±trz zewn. rozszerzonej

source: --nested every partition is disjoint from all others --chained like nested, but extended partitions may lie outside --onesector partitions are mutually disjoint
pl: --nested ka¿da partycja jest roz³±czna z pozosta³ymi --chained jak --nested, ale part. rozsz. mog± byæ na zewn±trz --onesector partycje s± wzajemnie roz³±czone

source: Override the detected geometry using: -C, --cylinders <number> set the number of cylinders to use -H, --heads <number> set the number of heads to use -S, --sectors <number> set the number of sectors to use
pl: Mo¿na wymusiæ u¿ycie innej geometrii ni¿ wykryta przy u¿yciu: -C, --cylinders <liczba> ustawienie liczby cylindrów -H, --heads <liczba> ustawienie liczby g³owic -S, --sectors <liczba> ustawienie liczby sektorów

source: Usage:
pl: Sk³adnia:

source: %s device list active partitions on device
pl: %s urz±dzenie wypisanie aktywnych partycji na urz±dzeniu

source: %s device n1 n2 ... activate partitions n1 ..., inactivate the rest
pl: %s urz±dzenie n1 n2 ... uaktywnienie partycji n1 ..., wy³±czenie reszty

source: %s -An device activate partition n, inactivate the other ones
pl: %s -An urz±dzenie uaktywnienie partycji n, wy³±czenie pozosta³ych

source: WARNING: GPT (GUID Partition Table) detected on '%s'! The util sfdisk doesn't support GPT. Use GNU Parted.
pl: UWAGA: na '%s' wykryto tablicê partycji GPT (GUID Partition Table)! Narzêdzie sfdisk nie obs³uguje GPT. Nale¿y u¿yæ GNU Parteda.

source: Use the --force flag to overrule this check.
pl: Aby wy³±czyæ ten test, nale¿y u¿yæ flagi --force.

source: no command?
pl: brak polecenia?

source: total: %llu blocks
pl: razem: %llu bloków

source: usage: sfdisk --print-id device partition-number
pl: Sk³adnia: sfdisk --print-id urz±dzenie numer-partycji

source: usage: sfdisk --change-id device partition-number Id
pl: Sk³adnia: sfdisk --change-id urz±dzenie numer-partycji ID

source: usage: sfdisk --id device partition-number [Id]
pl: Sk³adnia: sfdisk --id urz±dzenie numer-partycji [ID]

source: can specify only one device (except with -l or -s)
pl: mo¿na okre¶liæ tylko jedno urz±dzenie (chyba ¿e z -l lub -s)

source: cannot open %s read-write
pl: nie mo¿na otworzyæ %s do odczytu i zapisu

source: cannot open %s for reading
pl: nie mo¿na otworzyæ %s do odczytu

source: %s: %ld cylinders, %ld heads, %ld sectors/track
pl: %s: cylindrów: %ld, g³owic: %ld, sektorów na ¶cie¿ce: %ld

source: Cannot get size of %s
pl: Nie mo¿na pobraæ rozmiaru %s

source: bad active byte: 0x%x instead of 0x80
pl: b³êdny bajt rozruchu: 0x%x zamiast 0x80

source: Done
pl: Gotowe

source: You have %d active primary partitions. This does not matter for LILO, but the DOS MBR will only boot a disk with 1 active partition.
pl: Na dysku s± %d aktywne partycje g³ówne. Nie ma to znaczenia dla LILO, ale DOS-owy MBR potrafi uruchomiæ dysk tylko z jedn± aktywn± partycj±.

source: partition %s has id %x and is not hidden
pl: partycja %s ma ID %x i nie jest ukryta

source: Bad Id %lx
pl: B³êdny ID %lx

source: This disk is currently in use.
pl: Ten dysk jest aktualnie u¿ywany.

source: Fatal error: cannot find %s
pl: B³±d krytyczny: nie mo¿na odnale¼æ %s

source: Warning: %s is not a block device
pl: Uwaga: %s nie jest urz±dzeniem blokowym

source: Checking that no-one is using this disk right now ...
pl: Sprawdzanie czy nikt nie u¿ywa teraz tego dysku...

source: This disk is currently in use - repartitioning is probably a bad idea. Umount all file systems, and swapoff all swap partitions on this disk. Use the --no-reread flag to suppress this check.
pl: Ten dysk jest aktualnie u¿ywany - repartycjonowanie jest raczej z³ym pomys³em. Proszê odmontowaæ wszystkie systemy plików oraz wy³±czyæ partycje wymiany z tego dysku. Aby pomin±æ ten test, mo¿na u¿yæ flagi --no-reread.

source: Use the --force flag to overrule all checks.
pl: Mo¿na u¿yæ flagi --force, aby pomin±æ wszystkie testy.

source: Old situation:
pl: Stara sytuacja:

source: Partition %d does not exist, cannot change it
pl: Partycja %d nie istnieje, nie mo¿na jej zmieniæ

source: New situation:
pl: Nowa sytuacja:

source: I don't like these partitions - nothing changed. (If you really want this, use the --force option.)
pl: Nie podobaj± mi siê te partycje - nie zmieniono (je¶li na pewno tak maj± wygl±daæ - proszê u¿yæ opcji --force).

source: I don't like this - probably you should answer No
pl: Nie podoba mi siê to - prawdopodobnie nale¿y odpowiedzieæ Nie

source: Are you satisfied with this? [ynq]
pl: Czy te zmiany s± satysfakcjonuj±ce? [ynq]

source: Do you want to write this to disk? [ynq]
pl: Czy zapisaæ zmiany na dysk [ynq]

source: sfdisk: premature end of input
pl: sfdisk: przedwczesny koniec wej¶cia

source: Quitting - nothing changed
pl: Wyj¶cie - bez zmian

source: Please answer one of y,n,q
pl: Proszê odpowiedzieæ jednym z y,n,q

source: Successfully wrote the new partition table
pl: Zapisano now± tablicê partycji

source: If you created or changed a DOS partition, /dev/foo7, say, then use dd(1) to zero the first 512 bytes: dd if=/dev/zero of=/dev/foo7 bs=512 count=1 (See fdisk(8).)
pl: Je¶li utworzono lub zmieniono partycjê typu DOS, np. /dev/foo7, nale¿y u¿yæ dd(1), aby wyzerowaæ pierwsze 512 bajtów: dd if=/dev/zero of=/dev/foo7 bs=512 count=1 (wiêcej w fdisk(8))

source: failed to read: %s
pl: nie uda³o siê odczytaæ: %s

source: parse error: %s
pl: b³±d sk³adni: %s

source: Locking disk %s ...
pl: Blokowanie dysku %s...

source: (waiting)
pl: (oczekiwanie)

source: succeeded
pl: powiod³o siê

source: failed
pl: nie powiod³o siê

source: WARNING: couldn't open %s
pl: UWAGA: nie uda³o siê otworzyæ %s

source: WARNING: bad format on line %d of %s
pl: UWAGA: b³êdny format w linii %d pliku %s

source: WARNING: Your /etc/fstab does not contain the fsck passno field. I will kludge around things for you, but you should fix your /etc/fstab file as soon as you can.
pl: UWAGA: plik /etc/fstab nie zawiera pola fsck passno. Tym razem to obejdê, ale plik nale¿a³oby poprawiæ jak najszybciej.

source: %s: not found
pl: %s: nie znaleziono

source: wait: no more child process?!?
pl: wait: brak procesu potomnego?!?

source: Warning... %s for device %s exited with signal %d.
pl: Uwaga... %s dla urz±dzenia %s zakoñczone sygna³em %d.

source: %s %s: status is %x, should never happen.
pl: %s %s: status to %x, to nie powinno siê nigdy zdarzyæ.

source: Finished with %s (exit status %d)
pl: Zakoñczono %s (kod wyj¶cia %d)

source: error %d while executing fsck.%s for %s
pl: b³±d %d podczas wywo³ywania fsck.%s dla %s

source: Either all or none of the filesystem types passed to -t must be prefixed with 'no' or '!'.
pl: Albo wszystkie, albo ¿aden z typów przekazanych opcji -t musi byæ poprzedzony 'no' lub '!'.

source: %s: skipping bad line in /etc/fstab: bind mount with nonzero fsck pass number
pl: %s: pominiêto b³êdn± liniê w /etc/fstab: montowanie typu bind z niezerowym numerem przebiegu fsck

source: %s: skipping nonexistent device
pl: %s: pominiêto nieistniej±ce urz±dzenie

source: %s: nonexistent device ("nofail" fstab option may be used to skip this device)
pl: %s: urz±dzenie nie istnieje (mo¿na u¿yæ opcji fstaba "nofail" do pominiêcia tego urz±dzenia)

source: cannot check %s: fsck.%s not found
pl: nie mo¿na sprawdziæ %s: nie znaleziono fsck.%s

source: Checking all file systems.
pl: Sprawdzanie wszystkich systemów plików.

source: --waiting-- (pass %d)
pl: --oczekiwanie-- (przebieg %d)

source: Usage: %s [fsck-options] [fs-options] [filesys ...]
pl: Sk³adnia: %s [opcje-fsck] [opcje-fs] [system-plików ...]

source: Options: -A check all filesystems -R skip root filesystem; useful only with `-A' -M do not check mounted filesystems -t <type> specify filesystem types to be checked; type is allowed to be comma-separated list -P check filesystems in parallel, including root -s serialize fsck operations -l lock the device using flock() -N do not execute, just show what would be done -T do not show the title on startup -C <fd> display progress bar; file descriptor is for GUIs -V explain what is being done -? display this help and exit See fsck.* commands for fs-options.
pl: Opcje: -A sprawdzenie wszystkich systemów plików -R pominiêcie g³ównego systemu plików; przydatne tylko z `-A' -M bez sprawdzania zamontowanych systemów plików -t <typ> okre¶lenie typów systemów plików do sprawdzenia; mo¿e to byæ lista typów oddzielonych przecinkami -P równoleg³e sprawdzanie systemów plików wraz z g³ównym -s szeregowe operacje fsck -N bez wywo³ywania; tylko wypisanie, co zosta³oby zrobione -T bez wy¶wietlania tytu³u na pocz±tku -C <fd> wy¶wietlanie paska postêpu; deskryptor pliku jest dla GUI -V wyja¶nianie wykonywanych czynno¶ci -? wy¶wietlenie tego opisu i zakoñczenie Informacje o opcjach-fs mo¿na znale¼æ w fsck.*

source: too many devices
pl: zbyt du¿o urz±dzeñ

source: couldn't open %s
pl: nie mo¿na otworzyæ %s

source: Is /proc mounted?
pl: Czy /proc jest zamontowany?

source: must be root to scan for matching filesystems: %s
pl: trzeba byæ rootem, aby znale¼æ pasuj±ce systemy plików: %s

source: couldn't find matching filesystem: %s
pl: nie uda³o siê odnale¼æ pasuj±cego systemu plików: %s

source: too many arguments
pl: zbyt du¿o argumentów

source: the -l option can be used with one device only -- ignore
pl: opcji -l mo¿na u¿yæ tylko z jednym urz±dzeniem - zignorowano

source: Try `%s --help' for more information.
pl: `%s --help' wy¶wietli wiêcej informacji.

source: empty long option after -l or --long argument
pl: pusta opcja d³uga po opcji -l lub --long

source: unknown shell after -s or --shell argument
pl: nieznana pow³oka po opcji -s lub --shell

source: %1$s optstring parameters %1$s [options] [--] optstring parameters %1$s [options] -o|--options optstring [options] [--] parameters
pl: %1$s optstring parametry %1$s [opcje] [--] optstring parametry %1$s [opcje] -o|--options optstring [opcje] [--] parametry

source: -a, --alternative Allow long options starting with single -
pl: -a, --alternative Zezwolenie na d³ugie opcje z jednym - na pocz±tku

source: -h, --help This small usage guide
pl: -h, --help Ten krótki opis u¿ycia

source: -l, --longoptions <longopts> Long options to be recognized
pl: -l, --longoptions <opcje> D³ugie opcje, jakie maj± byæ rozpoznawane

source: -n, --name <progname> The name under which errors are reported
pl: -n, --name <program> Nazwa z jak± maj± byæ zg³aszane b³êdy

source: -o, --options <optstring> Short options to be recognized
pl: -o, --options <optstring> Krótkie opcje, jakie maj± byæ rozpoznawane

source: -q, --quiet Disable error reporting by getopt(3)
pl: -q, --quiet Wy³±czenie komunikatów b³êdów z getopt(3)

source: -Q, --quiet-output No normal output
pl: -Q, --quiet-output Bez normalnego wyj¶cia

source: -s, --shell <shell> Set shell quoting conventions
pl: -s, --shell <pow³oka> Ustawienie konwencji cytowania pow³oki

source: -T, --test Test for getopt(1) version
pl: -T, --test Sprawdzenie wersji getopt(1)

source: -u, --unquote Do not quote the output
pl: -u, --unquote Bez cytowania wyj¶cia

source: -V, --version Output version information
pl: -V, --version Wypisanie informacji o wersji

source: missing optstring argument
pl: brak parametru optstring

source: internal error, contact the author.
pl: b³±d wewnêtrzny, proszê skontaktowaæ siê autorem.

source: booted from MILO
pl: uruchomiono z MILO

source: Ruffian BCD clock
pl: Zegar Ruffian BCD

source: clockport adjusted to 0x%x
pl: clockport zmieniony na 0x%x

source: funky TOY!
pl: dziwny znacznik TOY!

source: atomic %s failed for 1000 iterations!
pl: atomowe %s nie powiod³o siê dla 1000 iteracji!

source: cmos_read(): write to control address %X failed: %s
pl: cmos_read(): zapis pod adres steruj±cy %X nie powiód³ siê: %s

source: cmos_read(): read data address %X failed: %s
pl: cmos_read(): odczyt danych spod adresu %X nie powiód³ siê: %s

source: cmos_write(): write to control address %X failed: %s
pl: cmos_write(): zapis pod adres steruj±cy %X nie powiód³ siê: %s

source: cmos_write(): write to data address %X failed: %s
pl: cmos_write(): zapis danych pod adres %X nie powiód³ siê: %s

source: Cannot open /dev/port
pl: Nie mo¿na otworzyæ /dev/port

source: I failed to get permission because I didn't try.
pl: Nie uda³o siê uzyskaæ uprawnieñ, poniewa¿ tego nie próbowano.

source: unable to get I/O port access: the iopl(3) call failed.
pl: nie uda³o siê uzyskaæ dostêpu do portów we/wy: wywo³anie iopl(3) nie powiod³o siê.

source: Probably you need root privileges.
pl: Prawdopodobnie wymagane s± uprawnienia administratora.

source: cannot write %s
pl: nie mo¿na zapisaæ %s

source: Assuming hardware clock is kept in %s time.
pl: Przyjêto, ¿e zegar sprzêtowy przechowuje czas %s.

source: local
pl: lokalny

source: Warning: unrecognized third line in adjtime file (Expected: `UTC' or `LOCAL' or nothing.)
pl: Uwaga: nierozpoznana trzecia linia w pliku adjtime (Oczekiwano: `UTC', `LOCAL' lub niczego).

source: Last drift adjustment done at %ld seconds after 1969
pl: Ostatnia korekta niedok³adno¶ci wykonana %ld sekund po 1969

source: Last calibration done at %ld seconds after 1969
pl: Ostatnia kalibracja wykonana %ld sekund po 1969

source: Hardware clock is on %s time
pl: Zegar sprzêtowy przechowuje czas %s

source: unknown
pl: nieznany

source: Waiting for clock tick...
pl: Oczekiwanie na przeskok zegara...

source: ...synchronization failed
pl: ...synchronizacja nie powiod³a siê

source: ...got clock tick
pl: ...wy³apano przeskok zegara

source: Invalid values in hardware clock: %4d/%.2d/%.2d %.2d:%.2d:%.2d
pl: B³êdne warto¶ci w zegarze sprzêtowym: %4d-%.2d-%.2d %.2d:%.2d:%.2d

source: Hw clock time : %4d/%.2d/%.2d %.2d:%.2d:%.2d = %ld seconds since 1969
pl: Czas zegara sprzêtowego: %4d-%.2d-%.2d %.2d:%.2d:%.2d = %ld sekund po 1969

source: Time read from Hardware Clock: %4d/%.2d/%.2d %02d:%02d:%02d
pl: Czas odczytany z zegara sprzêtowego: %4d-%.2d-%.2d %.2d:%.2d:%.2d

source: Setting Hardware Clock to %.2d:%.2d:%.2d = %ld seconds since 1969
pl: Ustawianie zegara sprzêtowego na %.2d:%.2d:%.2d = %ld sekund od 1969

source: Clock not changed - testing only.
pl: Zegar nie zmieniony - to tylko test.

source: Time elapsed since reference time has been %.6f seconds. Delaying further to reach the new time.
pl: Czas miniony od wzorcowego to %.6f sekund. Dalsze oczekiwanie w celu osi±gniêcia nowego czasu.

source: The Hardware Clock registers contain values that are either invalid (e.g. 50th day of month) or beyond the range we can handle (e.g. Year 2095).
pl: Rejestry zegara sprzêtowego zawieraj± warto¶ci nieprawid³owe (np. 50. dzieñ miesi±ca) lub spoza zakresu, który ten program mo¿e obs³u¿yæ (np. rok 2095).

source: %s %.6f seconds
pl: %s %.6f sekund

source: No --date option specified.
pl: Nie podano opcji --date.

source: --date argument too long
pl: Parametr --date zbyt d³ugi

source: The value of the --date option is not a valid date. In particular, it contains quotation marks.
pl: Warto¶æ opcji --date nie jest poprawn± dat±. W szczególno¶ci zawiera znaki cytowania.

source: Issuing date command: %s
pl: Wywo³ywanie polecenia date: %s

source: Unable to run 'date' program in /bin/sh shell. popen() failed
pl: Nie uda³o siê uruchomiæ programu 'date' pow³ok± /bin/sh. popen() nie powiod³o siê

source: response from date command = %s
pl: odpowied¼ z polecenia date = %s

source: The date command issued by %s returned unexpected results. The command was: %s The response was: %s
pl: Polecenie date wywo³ane przez %s zwróci³o nieoczekiwany wynik. Wykonane polecenie: %s Otrzymana odpowied¼: %s

source: The date command issued by %s returned something other than an integer where the converted time value was expected. The command was: %s The response was: %s
pl: Polecenie date wywo³ane przez %s zwróci³o co¶ innego ni¿ liczba ca³kowita, gdzie oczekiwano skonwertowanego czasu. Wykonane polecenie: %s Otrzymana odpowied¼: %s

source: date string %s equates to %ld seconds since 1969.
pl: ³añcuch date %s równy jest %ld sekund od 1969.

source: The Hardware Clock does not contain a valid time, so we cannot set the System Time from it.
pl: Zegar sprzêtowy nie zawiera prawid³owego czasu, wiêc nie mo¿na z niego ustawiæ czasu systemowego.

source: Calling settimeofday:
pl: Wywo³ywanie settimeofday:

source: Not setting system clock because running in test mode.
pl: Bez ustawiania zegara systemowego - tryb testowy.

source: Must be superuser to set system clock.
pl: Do ustawienia zegara systemowego trzeba byæ superu¿ytkownikiem.

source: settimeofday() failed
pl: settimeofday() nie powiod³o siê

source: Current system time: %ld = %s
pl: Aktualny czas systemowy: %ld = %s

source: Not adjusting drift factor because the Hardware Clock previously contained garbage.
pl: Bez zmiany wspó³czynnika korekty, poniewa¿ zegar sprzêtowy poprzednio zawiera³ ¶mieci.

source: Not adjusting drift factor because last calibration time is zero, so history is bad and calibration startover is necessary.
pl: Bez zmiany wspó³czynnika korekty, poniewa¿ czas ostatniej kalibracji jest zerowy, wiêc historia jest b³êdna i trzeba ponownie zacz±æ kalibracjê.

source: Not adjusting drift factor because it has been less than a day since the last calibration.
pl: Bez zmiany wspó³czynnika korekty, poniewa¿ nie min±³ dzieñ od poprzedniej kalibracji.

source: Clock drifted %.1f seconds in the past %d seconds in spite of a drift factor of %f seconds/day. Adjusting drift factor by %f seconds/day
pl: Zegar zboczy³ o %.1f sekund przez ostatnie %d sekund mimo wspó³czynnika korekty %f sekund/dzieñ. Zmiana wspó³czynnika korekty o %f sekund/dzieñ

source: Time since last adjustment is %d seconds
pl: Czas od ostatniej korekty to %d sekund

source: Need to insert %d seconds and refer time back %.6f seconds ago
pl: Wymagane wstawienie %d sekund i przesuniêcie czasu wzorcowego %.6f sekund wstecz

source: Not updating adjtime file because of testing mode.
pl: Bez uaktualniania pliku adjtime - tryb testowy.

source: Would have written the following to %s: %s
pl: Zapisano by nastêpuj±ce dane do %s: %s

source: Could not open file with the clock adjustment parameters in it (%s) for writing
pl: Nie uda³o siê otworzyæ pliku z parametrami korekty zegara (%s) do zapisu

source: Could not update file with the clock adjustment parameters (%s) in it
pl: Nie uda³o siê uaktualniæ pliku z parametrami korekty zegara (%s)

source: Drift adjustment parameters not updated.
pl: Parametry korekty zegara nie zosta³y zapisane.

source: The Hardware Clock does not contain a valid time, so we cannot adjust it.
pl: Zegar sprzêtowy nie zawiera prawid³owego czasu, wiêc nie mo¿na go skorygowaæ.

source: Not setting clock because last adjustment time is zero, so history is bad.
pl: Bez ustawiania zegara, poniewa¿ czas ostatniej poprawki jest zerowy, wiêc historia jest b³êdna.

source: Needed adjustment is less than one second, so not setting clock.
pl: Wymagana korekta jest mniejsza ni¿ jedna sekunda - bez ustawiania zegara.

source: Using %s.
pl: U¿ywany interfejs: %s.

source: No usable clock interface found.
pl: Nie znaleziono u¿ytecznego interfejsu zegara.
