Repository: RMerl/asuswrt-merlin
Catalog: release/src/router/util-linux/po/*.po
Languages: pl

source: For more information see fstrim(1).
pl: Wiêcej informacji w fstrim(1).

source: failed to parse length: %s
pl: nie uda³o siê przeanalizowaæ d³ugo¶ci: %s

source: failed to parse offset: %s
pl: nie uda³o siê przeanalizowaæ offsetu: %s

source: failed to parse minimum extent length: %s
pl: nie uda³o siê przeanalizowaæ minimalnej d³ugo¶ci ekstentu: %s

source: no mountpoint specified.
pl: nie podano punktu montowania.

source: %s: not a directory
pl: %s: nie jest katalogiem

source: %s: FITRIM ioctl failed
pl: %s: ioctl FITRIM nie powiód³ siê

source: %s: %<PRIu64> bytes were trimmed
pl: %s: obciêto bajtów: %<PRIu64>

source: -M <size> create shared memory segment of size <size> -S <nsems> create semaphore array with <nsems> elements -Q create message queue -p <mode> permission for the resource (default is 0644)
pl: -M <rozmiar> utworzenie segmentu pamiêci dzielonej o danym rozmiarze -S <lsem> utworzenie tablicy semaforów o <lsem> elementach -Q utworzenie kolejki komunikatów -p <tryb> uprawnienia dla zasobu (domy¶lne to 0644)

source: For more information see ipcmk(1).
pl: Wiêcej informacji mo¿na znale¼æ w ipcmk(1).

source: create share memory failed
pl: tworzenie pamiêci dzielonej nie powiod³o siê

source: Shared memory id: %d
pl: Identyfikator pamiêci dzielonej: %d

source: create message queue failed
pl: tworzenie kolejki komunikatów nie powiod³o siê

source: Message queue id: %d
pl: Identyfikator kolejki komunikatów: %d

source: create semaphore failed
pl: tworzenie semaforów nie powiod³o siê

source: Semaphore id: %d
pl: Identyfikator tablicy semaforów: %d

source: invalid id: %s
pl: b³êdny identyfikator: %s

source: cannot remove id %s (%s)
pl: nie mo¿na usun±æ identyfikatora %s (%s)

source: deprecated usage: %s {shm | msg | sem} id ...
pl: przestarza³a sk³adnia: %s {shm | msg | sem} id ...

source: unknown resource type: %s
pl: nieznany rodzaj zasobu: %s

source: resource(s) deleted
pl: zasoby usuniête

source: usage: %s [ [-q msqid] [-m shmid] [-s semid] [-Q msgkey] [-M shmkey] [-S semkey] ... ]
pl: Sk³adnia: %s [ [-q id_msg] [-m id_shm] [-s id_sem] [-Q klucz_msg] [-M klucz_shm] [-S klucz_sem] ... ]

source: %s: illegal key (%s)
pl: %s: niedozwolony klucz (%s)

source: permission denied for key
pl: brak uprawnieñ do tego klucza

source: already removed key
pl: klucz ju¿ usuniêty

source: invalid key
pl: b³êdny klucz

source: unknown error in key
pl: nieznany b³±d w kluczu

source: permission denied for id
pl: brak uprawnieñ do tego identyfikatora

source: invalid id
pl: b³êdny identyfikator

source: already removed id
pl: identyfikator ju¿ usuniêty

source: unknown error in id
pl: nieznany b³±d w identyfikatorze

source: %s: unknown argument: %s
pl: %s: nieznany argument: %s

source: Usage: %1$s [-asmq] [-t|-c|-l|-u|-p] %1$s [-s|-m|-q] -i id %1$s -h for help
pl: Sk³adnia: %1$s [-asmq] [-t|-c|-l|-u|-p] %1$s [-s|-m|-q] -i id %1$s -h wy¶wietla opis

source: Usage: %1$s [resource]... [output-format] %1$s [resource] -i id
pl: Sk³adnia: %1$s [zasób]... [format-wyj¶ciowy] %1$s [zasób] -i id

source: Provide information on IPC facilities for which you have read access.
pl: Udostêpnianie informacji o obiektach IPC, do których ma siê prawo odczytu.

source: -h display this help -i id print details on resource identified by id
pl: -h wy¶wietlenie tego opisu -i id wypisanie szczegó³ów na temat zasobu o podanym identyfikatorze

source: Resource options: -m shared memory segments -q message queues -s semaphores -a all (default)
pl: Opcje zasobów: -m segmenty pamiêci dzielonej -q kolejki komunikatów -s semafory -a wszystko (domy¶lne)

source: Output format: -t time -p pid -c creator -l limits -u summary
pl: Format wyj¶ciowy: -t czas -p pid -c twórca -l limity -u podsumowanie

source: kernel not configured for shared memory
pl: j±dro nie zosta³o skonfigurowane do obs³ugi pamiêci dzielonej

source: ------ Shared Memory Limits --------
pl: ------ Limity pamiêci dzielonej ----

source: max number of segments = %lu
pl: maksymalna liczba segmentów = %lu

source: max seg size (kbytes) = %lu
pl: maksymalny rozmiar segmentu (kB) = %lu

source: max total shared memory (kbytes) = %llu
pl: maksymalny rozmiar ca³ej pamiêci dzielonej (kB) = %llu

source: min seg size (bytes) = %lu
pl: minimalny rozmiar segmentu (B) = %lu

source: ------ Shared Memory Status --------
pl: ------ Stan pamiêci dzielonej ------

source: segments allocated %d pages allocated %ld pages resident %ld pages swapped %ld Swap performance: %ld attempts %ld successes
pl: segmentów przydzielonych %d stron przydzielonych %ld stron w pamiêci %ld stron wymienionych %ld Wydajno¶æ swapa: %ld prób %ld sukcesów

source: ------ Shared Memory Segment Creators/Owners --------
pl: ------ Twórcy/w³a¶ciciele pamiêci dzielonej ---------

source: shmid
pl: id_shm

source: perms
pl: uprawn.

source: ------ Shared Memory Attach/Detach/Change Times --------
pl: ------ Czas do³±czania/od³±czania/zmian pam.dziel. -----

source: owner
pl: w³a¶ciciel

source: attached
pl: pod³±czenie

source: detached
pl: od³±czenie

source: changed
pl: zmiana

source: ------ Shared Memory Creator/Last-op PIDs --------
pl: ------ PID twórcy/ost.op. na pamiêci dziel. ------

source: ------ Shared Memory Segments --------
pl: ------ Segmenty pamiêci dzielonej ----

source: key
pl: klucz

source: bytes
pl: bajtów

source: nattch
pl: pod³±czeñ

source: status
pl: stan

source: Not set
pl: Nie ustawiono

source: locked
pl: blok.

source: kernel not configured for semaphores
pl: j±dro nie zosta³o skonfigurowane do obs³ugi semaforów

source: ------ Semaphore Limits --------
pl: ------ Limity semaforów --------

source: max number of arrays = %d
pl: maksymalna liczba tablic = %d

source: max semaphores per array = %d
pl: maksymalna liczba semaforów w tablicy = %d

source: max semaphores system wide = %d
pl: maksymalna liczba semaforów w systemie = %d

source: max ops per semop call = %d
pl: maksymalna liczba operacji na sem. w wywo³aniu = %d

source: semaphore max value = %d
pl: maksymalna warto¶æ semafora = %d

source: ------ Semaphore Status --------
pl: ------ Stan semaforów ----------

source: used arrays = %d
pl: tablic u¿ywanych: %d

source: allocated semaphores = %d
pl: semaforów przydzielonych: %d

source: ------ Semaphore Arrays Creators/Owners --------
pl: ------ Twórcy/w³a¶ciciele tablic semaforów -----

source: semid
pl: id_sem

source: ------ Semaphore Operation/Change Times --------
pl: ------ Czasy operacji/zmian semaforów ----------

source: last-op
pl: ost.op.

source: last-changed
pl: ost.zmiana

source: ------ Semaphore Arrays --------
pl: ------ Tablice semaforów -------

source: nsems
pl: lsem

source: kernel not configured for message queues
pl: j±dro nie zosta³o skonfigurowane do obs³ugi kolejek komunikatów

source: ------ Messages Limits --------
pl: ------ Limity komunikatów ------

source: max queues system wide = %d
pl: maksymalna liczba kolejek w systemie = %d

source: max size of message (bytes) = %d
pl: maksymalny rozmiar komunikatu (B) = %d

source: default max size of queue (bytes) = %d
pl: domy¶lny maksymalny rozmiar kolejki (B) = %d

source: ------ Messages Status --------
pl: ------ Stan komunikatów --------

source: allocated queues = %d
pl: kolejki przydzielone: %d

source: used headers = %d
pl: u¿ywane nag³ówki: %d

source: used space = %d bytes
pl: u¿ywane miejsce: %d B

source: ------ Message Queues Creators/Owners --------
pl: ----- Twórcy/w³a¶ciciele kolejek komunikatów -

source: msqid
pl: id_msq

source: ------ Message Queues Send/Recv/Change Times --------
pl: ------ Kolejki komunikatów: czas odb./wys./zmiany ---

source: send
pl: wys³anie

source: recv
pl: odbiór

source: change
pl: zmiana

source: ------ Message Queues PIDs --------
pl: ------ Kolejki komunikatów: PID-y -

source: ------ Message Queues --------
pl: ------ Kolejki komunikatów ---

source: used-bytes
pl: bajtów

source: messages
pl: komunikatów

source: shmctl failed
pl: shmctl nie powiod³o siê

source: Shared memory Segment shmid=%d
pl: Identyfikator segmentu pamiêci dzielonej (shmid)=%d

source: mode=%#o access_perms=%#o
pl: tryb=%#o prawa_dostêpu=%#o

source: bytes=%lu lpid=%d cpid=%d nattch=%ld
pl: bajtów=%lu lpid=%d cpid=%d pod³±czeñ=%ld

source: att_time=%-26.24s
pl: czas_pod³=%-26.24s

source: det_time=%-26.24s
pl: czas_od³=%-26.24s

source: change_time=%-26.24s
pl: czas_zmiany=%-26.24s

source: msgctl failed
pl: msgctl nie powiod³o siê

source: Message Queue msqid=%d
pl: Identyfikator kolejki komunikatów (msqid)=%d

source: uid=%u gid=%u cuid=%u cgid=%u mode=%#o
pl: uid=%u gid=%u cuid=%u cgid=%u tryb=%#o

source: cbytes=%ld qbytes=%ld qnum=%ld lspid=%d lrpid=%d
pl: bajtów=%ld maxbajtów=%ld lkom=%ld lspid=%d lrpid=%d

source: send_time=%-26.24s
pl: czas_wys³ania=%-26.24s

source: rcv_time=%-26.24s
pl: czas_odbioru=%-26.24s

source: semctl failed
pl: semctl nie powiod³o siê

source: Semaphore Array semid=%d
pl: Identyfikator tablicy semaforów (semid)=%d

source: mode=%#o, access_perms=%#o
pl: tryb=%#o, uprawnienia=%#o

source: nsems = %ld
pl: lsem = %ld

source: semnum
pl: n.sem.

source: value
pl: warto¶æ

source: ncount
pl: oczek.n.

source: zcount
pl: oczek.z.

source: invalid iflag: %s
pl: b³êdna flaga: %s

source: %s [ -dhV78neo12 ] [ -s <speed> ] [ -i [-]<iflag> ] <ldisc> <device>
pl: %s [ -dhV78neo12 ] [-s <szybko¶æ> ] [ -i [-]<flaga> ] <dyscl> <urz±dzenie>

source: Known <ldisc> names:
pl: Znane nazwy <dyscl>:

source: Known <iflag> names:
pl: Znane nazwy <flag>:

source: invalid speed: %s
pl: b³êdna szybko¶æ: %s

source: ldattach from %s
pl: ldattach z pakietu %s

source: invalid option
pl: b³êdna opcja

source: invalid line discipline: %s
pl: b³êdna dyscyplina linii: %s

source: %s is not a serial line
pl: %s nie jest interfejsem szeregowym

source: cannot get terminal attributes for %s
pl: nie mo¿na pobraæ atrybutów terminala dla %s

source: speed %d unsupported
pl: szybko¶æ %d nie jest obs³ugiwana

source: cannot set terminal attributes for %s
pl: nie mo¿na ustawiæ atrybutów terminala dla %s

source: cannot set line discipline
pl: nie mo¿na ustawiæ dyscypliny linii

source: cannot daemonize
pl: nie mo¿na staæ siê demonem

source: none
pl: brak

source: full
pl: pe³na

source: error: cannot open %s
pl: b³±d: nie mo¿na otworzyæ %s

source: failed to callocate cpu set
pl: nie uda³o siê wykonaæ calloc dla zbioru CPU

source: failed to parse CPU list %s
pl: nie uda³o siê przeanalizowaæ listy CPU %s

source: failed to parse CPU mask %s
pl: b³±d sk³adni maski CPU %s

source: error: uname failed
pl: b³±d: uname nie powiod³o siê

source: # The following is the parsable format, which can be fed to other # programs. Each different item in every column has an unique ID # starting from zero.
pl: # Poni¿ej lista w formacie ³atwym do przetworzenia przez inne programy. # Ka¿dy inny element w ka¿dej kolumnie ma unikalny identyfikator # z numeracj± zaczynaj±c± od zera.

source: Architecture:
pl: Architektura:

source: CPU op-mode(s):
pl: Tryb(y) pracy CPU:

source: Byte Order:
pl: Kolejno¶æ bajtów:

source: CPU(s):
pl: CPU:

source: On-line CPU(s) mask:
pl: Maska aktywnych CPU:

source: On-line CPU(s) list:
pl: Lista aktywnych CPU:

source: Off-line CPU(s) mask:
pl: Maska nieaktywnych CPU:

source: Off-line CPU(s) list:
pl: Lista nieaktywnych CPU:

source: Thread(s) per core:
pl: W±tków na rdzeñ:

source: Core(s) per socket:
pl: Rdzeni na gniazdo:

source: Socket(s) per book:
pl: Gniazd na tom:

source: Book(s):
pl: Tomów:

source: Socket(s):
pl: Gniazd:

source: NUMA node(s):
pl: Wêz³ów NUMA:

source: Vendor ID:
pl: ID producenta:

source: CPU family:
pl: Rodzina CPU:

source: Stepping:
pl: Wersja:

source: Virtualization:
pl: Wirtualizacja:

source: Hypervisor vendor:
pl: Producent hiperwizora:

source: Virtualization type:
pl: Typ wirtualizacji:

source: %s cache:
pl: Cache %s:

source: NUMA node%d CPU(s):
pl: Procesory wêz³a NUMA %d:

source: -h, --help print this help -p, --parse <list> print out a parsable instead of a readable format -s, --sysroot <dir> use directory DIR as system root -x, --hex print hexadecimal masks rather than lists of CPUs
pl: -h, --help wy¶wietlenie tego opisu -p, --parse <lista> wypisanie danych w formacie do przetworzenia programowego -s, --sysroot <kat> u¿ycie podanego katalogu jako drzewa systemowego -x, --hex wypisywanie szesnastkowych masek zamiast list CPU

source: %1$s [-qd] /path/to/directory %1$s -x /dev/device
pl: %1$s [-qd] /¶cie¿ka/do/katalogu %1$s -x /dev/urz±dzenie

source: -q, --quiet quiet mode - don't print anything -d, --fs-devno print maj:min device number of the filesystem -x, --devno print maj:min device number of the block device -h, --help this help
pl: -q, --quiet tryb cichy - bez wypisywania niczego -d, --fs-devno wypisanie numeru major:minor urz±dzenia systemu plików -x, --devno wypisanie numeru major:minor urz±dzenia blokowego -h, --help ten opis

source: For more information see mountpoint(1).
pl: Wiêcej informacji w mountpoint(1).

source: %s is not a mountpoint
pl: %s nie jest punktem montowania

source: %s is a mountpoint
pl: %s jest punktem montowania

source: %s: Usage: "%s [options] -m <mapfile> (defaults: "%s" and "%s") -p <pro-file> (default: "%s") -M <mult> set the profiling multiplier to <mult> -i print only info about the sampling step -v print verbose data -a print all symbols, even if count is 0 -b print individual histogram-bin counts -s print individual counters within functions -r reset all the counters (root only) -n disable byte order auto-detection -V print version and exit
pl: %s: Sk³adnia: "%s [opcje] -m <plik_mapy> (domy¶lnie: "%s" i "%s") -p <profil> (domy¶lny: "%s") -M <mno¿nik> ustawienie mno¿nika profiluj±cego -i wypisanie tylko informacji o kroku próbkowania -v szczegó³owe wypisywanie danych -a wypisanie wszystkich symboli, nawet z zerami -b wypisanie liczników dla poszczególnych histogramów -s wypisanie liczników wewn. poszczególnych funkcji -r wyzerowanie liczników (tylko dla roota) -n wy³±czenie wykrywania kolejno¶ci bajtów -V wypisanie informacji o wersji i zakoñczenie

source: readprofile: error writing %s: %s
pl: readprofile: b³±d zapisu %s: %s

source: Assuming reversed byte order. Use -n to force native byte order.
pl: Przyjêto odwrócon± kolejno¶æ bajtów. Opcja -n wymusi natywn± kolejno¶æ.

source: Sampling_step: %i
pl: Krok próbkowania: %i

source: %s: %s(%i): wrong map line
pl: %s: %s(%i): b³êdna linia mapy

source: %s: can't find "_stext" in %s
pl: %s: nie znaleziono "_stext" w %s

source: %s: profile address out of range. Wrong map file?
pl: %s: adres profilu spoza zakresu. B³êdny plik mapy?

source: total
pl: razem

source: %1$s [-n] <priority> [-p] <pid> [<pid> ...] %1$s [-n] <priority> -g <pgrp> [<pgrp> ...] %1$s [-n] <priority> -u <user> [<user> ...]
pl: %1$s [-n] <priorytet> [-p] <pid> [<pid> ...] %1$s [-n] <priorytet> -g <grupaproc> [<grupaproc> ...] %1$s [-n] <priorytet> -u <u¿ytkownik> [<u¿ytkownik> ...]

source: -g, --pgrp <id> interpret as process group ID -h, --help print help -n, --priority <num> set the nice increment value -p, --pid <id> force to be interpreted as process ID -u, --user <name|id> interpret as username or user ID -v, --version print version
pl: -g, --pgrp <id> interpretowanie jako ID grupy procesów -h, --help wy¶wietlenie tego opisu -n, --priority <liczba> ustawienie warto¶ci zwiêkszenia nice -p, --pid <id> interpretowanie jako ID procesu -u, --user <nazwa|id> interpretowanie jako nazwy lub ID u¿ytkownika -v, --version wy¶wietlenie wersji

source: For more information see renice(1).
pl: Wiêcej informacji w renice(1).

source: renice from %s
pl: renice z pakietu %s

source: unknown user %s
pl: nieznany u¿ytkownik %s

source: bad value %s
pl: b³êdna warto¶æ %s

source: process ID
pl: ID procesu

source: user ID
pl: ID u¿ytkownika

source: process group ID
pl: ID grupy procesów

source: failed to get priority for %d (%s)
pl: nie uda³o siê odczytaæ priorytetu dla %d (%s)

source: failed to set priority for %d (%s)
pl: nie uda³o siê ustawiæ priorytetu dla %d (%s)

source: %d (%s) old priority %d, new priority %d
pl: %d (%s): stary priorytet %d, nowy priorytet %d

source: -d, --device <device> select rtc device (rtc0|rtc1|...) -n, --dry-run does everything, but suspend -l, --local RTC uses local timezone -m, --mode <mode> standby|mem|... sleep mode -s, --seconds <seconds> seconds to sleep -t, --time <time_t> time to wake -u, --utc RTC uses UTC -v, --verbose verbose messages -V, --version show version
pl: -d, --device <urz±dzenie> wybór urz±dzenia RTC (rtc0|rtc1|...) -n, --dry-run wykonanie wszystkiego poza u¶pieniem -l, --local RTC u¿ywa lokalnej strefy czasowej -m, --mode <tryb> tryb snu standby|mem|... -s, --seconds <sekundy> liczba sekund snu -t, --time <time_t> czas pobudki -u, --utc RTC u¿ywa UTC -v, --verbose szczegó³owe komunikaty -V, --version wy¶wietlenie wersji

source: For more information see rtcwake(8).
pl: Wiêcej informacji w rtcwake(8).

source: read rtc time failed
pl: odczyt czasu RTC nie powiód³ siê

source: read system time failed
pl: odczyt czasu systemowego nie powiód³ siê

source: convert rtc time failed
pl: przeliczanie czasu RTC nie powiod³o siê

source: set rtc alarm failed
pl: ustawianie alarmu RTC nie powiod³o siê

source: enable rtc alarm failed
pl: w³±czanie alarmu RTC nie powiod³o siê

source: set rtc wake alarm failed
pl: ustawianie budzika RTC nie powiod³o siê

source: read rtc alarm failed
pl: odczyt alarmu RTC nie powiód³ siê

source: alarm: off
pl: alarm: wy³±czony

source: convert time failed
pl: przeliczanie czasu nie powiod³o siê

source: alarm: on %s
pl: alarm: w³±czony %s

source: unrecognized suspend state '%s'
pl: nieznany stan u¶pienia '%s'

source: failed to parse seconds value
pl: nie uda³o siê przeanalizowaæ warto¶ci sekund

source: failed to parse time_t value
pl: nie uda³o siê przeanalizowaæ warto¶ci time_t

source: %s: assuming RTC uses UTC ...
pl: %s: za³o¿ono, ¿e RTC u¿ywa UTC...

source: Using UTC time.
pl: U¿ycie czasu UTC.

source: Using local time.
pl: U¿ycie czasu lokalnego.

source: must provide wake time (see -t and -s options)
pl: trzeba podaæ czas pobudki (opcja -t lub -s)

source: %s not enabled for wakeup events
pl: %s nie ma w³±czonych zdarzeñ budzenia

source: alarm %ld, sys_time %ld, rtc_time %ld, seconds %u
pl: alarm %ld, sys_time %ld, rtc_time %ld, sekund: %u

source: suspend to "%s" unavailable
pl: u¶pienie w tryb "%s" nie jest dostêpne

source: time doesn't go backward to %s
pl: czas nie biegnie wstecz do %s

source: %s: wakeup using %s at %s
pl: %s: pobudka przy u¿yciu %s w chwili %s

source: %s: wakeup from "%s" using %s at %s
pl: %s: pobudka z trybu "%s" przy u¿yciu %s w chwili %s

source: suspend mode: no; leaving
pl: tryb u¶pienia: brak; opuszczanie

source: suspend mode: off; executing %s
pl: tryb u¶pienia: wy³±czenie; wywo³ywanie %s

source: unable to execute %s
pl: nie uda³o siê uruchomiæ %s

source: suspend mode: on; reading rtc
pl: tryb u¶pienia: w³±czony; odczytywanie RTC

source: rtc read failed
pl: odczyt RTC nie powiód³ siê

source: suspend mode: disable; disabling alarm
pl: tryb u¶pienia: wy³±czony; wy³±czanie budzika

source: suspend mode: show; printing alarm info
pl: tryb u¶pienia: wy¶wietlenie; wypisywanie informacji o budziku

source: suspend mode: %s; suspending system
pl: tryb u¶pienia: %s; usypianie systemu

source: disable rtc alarm interrupt failed
pl: wy³±czanie przerwania pobudki RTC nie powiod³o siê

source: Switching on %s.
pl: W³±czanie %s.

source: Usage: %s%s [options] [program [program arguments]] Options:
pl: Sk³adnia: %s%s [opcje] [program [program argumenty]] Opcje:

source: -h, --help displays this help text -v, --verbose says what options are being switched on -R, --addr-no-randomize disables randomization of the virtual address space -F, --fdpic-funcptrs makes function pointers point to descriptors -Z, --mmap-page-zero turns on MMAP_PAGE_ZERO -L, --addr-compat-layout changes the way virtual memory is allocated -X, --read-implies-exec turns on READ_IMPLIES_EXEC -B, --32bit turns on ADDR_LIMIT_32BIT -I, --short-inode turns on SHORT_INODE -S, --whole-seconds turns on WHOLE_SECONDS -T, --sticky-timeouts turns on STICKY_TIMEOUTS -3, --3gb limits the used address space to a maximum of 3 GB --4gb ignored (for backward compatibility only)
pl: -h, --help wy¶wietlenie tego opisu -v, --verbose szczegó³owa informacja o w³±czanych opcjach -R, --addr-no-randomize wy³±czenie losowo¶ci wirtualnej przestrzeni adresowej -F, --fdpic-funcptrs wska¼niki funkcji wskazuj±ce na deskryptory -Z, --mmap-page-zero w³±czenie MMAP_PAGE_ZERO -L, --addr-compat-layout zmiany w sposobie przydzielania pamiêci wirtualnej -X, --read-implies-exec w³±czenie READ_IMPLIES_EXEC -B, --32bit w³±czenie ADDR_LIMIT_32BIT -I, --short-inode w³±czenie SHORT_INODE -S, --whole-seconds w³±czenie WHOLE_SECONDS -T, --sticky-timeouts w³±czenie STICKY_TIMEOUTS -3, --3gb ograniczenie przestrzeni adresowej do maksimum 3 GB --4gb ignorowane (tylko dla kompatybilno¶ci wstecznej)

source: For more information see setarch(8).
pl: Wiêcej informacji mo¿na znale¼æ w setarch(8).

source: %s: %s Try `%s --help' for more information.
pl: %s: %s `%s --help' wy¶wietli wiêcej informacji.

source: %s: Unrecognized architecture
pl: %s: Nieznana architektura

source: Not enough arguments
pl: Za ma³o argumentów

source: Failed to set personality to %s
pl: Nie uda³o siê ustawiæ osobowo¶ci na %s

source: usage: %s program [arg ...]
pl: Sk³adnia: %s program [argument ...]

source: Usage: %s <device> [ -i <IRQ> | -t <TIME> | -c <CHARS> | -w <WAIT> | -a [on|off] | -o [on|off] | -C [on|off] | -q [on|off] | -s | -T [on|off] ]
pl: Sk³adnia: %s <urz±dzenie> [ -i <IRQ> | -t <CZAS> | -c <ZNAKI> | -w <OCZEKIW> | -a [on|off] | -o [on|off] | -C [on|off] | -q [on|off] | -s | -T [on|off] ]

source: %s: bad value
pl: %s: b³êdna warto¶æ

source: %s: %s not an lp device.
pl: %s: %s nie jest urz±dzeniem lp.

source: LPGETSTATUS error
pl: b³±d LPGETSTATUS

source: %s status is %d
pl: Stan drukarki %s: %d

source: , busy
pl: , zajêta

source: , ready
pl: , gotowa

source: , out of paper
pl: , brak papieru

source: , on-line
pl: , w³±czona

source: , error
pl: , b³±d

source: tunelp: ioctl failed
pl: tunelp: ioctl nie powiód³ siê

source: LPGETIRQ error
pl: b³±d LPGETIRQ

source: %s using IRQ %d
pl: %s u¿ywa IRQ %d

source: %s using polling
pl: %s u¿ywa odpytywania

source: %s [options] <program> [args...]
pl: %s [opcje] <program> [argumenty...]

source: -h, --help usage information (this) -m, --mount unshare mounts namespace -u, --uts unshare UTS namespace (hostname etc) -i, --ipc unshare System V IPC namespace -n, --net unshare network namespace
pl: -h, --help opis u¿ycia (czyli ten tekst) -m, --mount oddzielenie przestrzeni montowania -u, --uts oddzielenie przestrzeni UTS (nazwa hosta itp.) -i, --ipc oddzielenie przestrzeni SysV IPC -n, --net oddzielenie przestrzeni sieciowej

source: For more information see unshare(1).
pl: Wiêcej informacji mo¿na znale¼æ w unshare(1).

source: unshare failed
pl: unshare nie powiod³o siê

source: cannot set group id
pl: nie mo¿na ustawiæ identyfikatora grupy

source: cannot set user id
pl: nie mo¿na ustawiæ identyfikatora u¿ytkownika

source: %s: can't change root directory %s: %m
pl: %s: nie mo¿na zmieniæ katalogu g³ównego %s: %m

source: %s: can't change working directory %s: %m
pl: %s: nie mo¿na zmieniæ katalogu roboczego %s: %m

source: %s: can't change process priority: %m
pl: %s: nie mo¿na zmieniæ priorytetu procesu: %m

source: %s: can't exec %s: %m
pl: %s: nie mo¿na wywo³aæ %s: %m

source: failed to allocate memory: %m
pl: nie uda³o siê przydzieliæ pamiêci: %m

source: bad timeout value: %s
pl: b³êdna warto¶æ limitu czasu: %s

source: not enough arguments
pl: za ma³o argumentów

source: bad speed: %s
pl: b³êdna szybko¶æ: %s

source: too many alternate speeds
pl: zbyt du¿o zamiennych szybko¶ci
