Repository: RMerl/asuswrt-merlin
Catalog: release/src/router/util-linux/po/*.po
Languages: pl

source: All rights reserved. ------------------------------------------------------- h this screen q or Q quit program <newline> next page f skip a page forward d or ^D next halfpage l next line $ last page /regex/ search forward for regex ?regex? or ^regex^ search backward for regex . or ^L redraw screen w or z set page size and go to next page s filename save current file to filename !command shell escape p go to previous file n go to next file Many commands accept preceding numbers, for example: +1<newline> (next page); -1<newline> (previous page); 1<newline> (first page). See pg(1) for more information. -------------------------------------------------------
pl: Wszelkie prawa zastrze¿one. ------------------------------------------------------- h ten ekran q lub Q zakoñczenie programu <nowa linia> nastêpna strona f przewiniêcie strony w przód d lub ^D nastêpne pó³ strony l nastêpna linia $ ostatnia strona /wyr_reg/ szukanie wyra¿enia regularnego w przód ?wyr_reg? lub ^wyr_reg^ szukanie wyra¿enia regularnego w ty³ . lub ^L przerysowanie ekranu w lub z ustawienie rozmiaru strony i przej¶cie na nastêpn± s nazwa_pliku zapisanie bie¿±cego pliku pod podan± nazw± !polecenie wywo³anie polecenia w pow³oce p przej¶cie do poprzedniego pliku n przej¶cie do nastêpnego pliku Wiele poleceñ przyjmuje liczby poprzedzaj±ce, np.: +1<nowa linia> (nastêpna strona); -1<nowa linia> (poprzednia strona); 1<nowa linia> (pierwsza strona). Wiêcej informacji mo¿na znale¼æ w pg(1). -------------------------------------------------------

source: %s: Usage: %s [-number] [-p string] [-cefnrs] [+line] [+/pattern/] [files]
pl: %s: Sk³adnia: %s [-liczba] [-p ³añcuch] [-cefnrs] [+linia] [+/wzorzec/] [pliki]

source: %s: option requires an argument -- %s
pl: %s: opcja musi mieæ argument -- %s

source: %s: illegal option -- %s
pl: %s: b³êdna opcja -- %s

source: ...skipping forward
pl: ...przewijanie w przód

source: ...skipping backward
pl: ...przewijanie w ty³

source: No next file
pl: Brak nastêpnego pliku

source: No previous file
pl: Brak poprzedniego pliku

source: %s: Read error from %s file
pl: %s: B³±d odczytu z pliku %s

source: %s: Unexpected EOF in %s file
pl: %s: Nieoczekiwany EOF w pliku %s

source: %s: Unknown error in %s file
pl: %s: Nieznany b³±d w pliku %s

source: %s: Cannot create tempfile
pl: %s: Nie mo¿na utworzyæ pliku tymczasowego

source: RE error:
pl: B³±d wyra¿enia regularnego:

source: No remembered search string
pl: Brak zapamiêtanego szukanego ³añcucha

source: Cannot open
pl: Nie mo¿na otworzyæ

source: saved
pl: zapisano

source: : !command not allowed in rflag mode.
pl: : !polecenie nie jest dozwolone w trybie z opcj± -r.

source: fork() failed, try again later
pl: fork() nie powiód³ siê, proszê spróbowaæ pó¼niej

source: (Next file:
pl: (Nastêpny plik:

source: Usage: %s [options] [file ...]
pl: Sk³adnia: %s [opcje] [plik ...]

source: Options: -V, --version output version information and exit -h, --help display this help and exit
pl: Opcje: -V, --version wypisanie informacji o wersji i zakoñczenie -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: For more information see rev(1).
pl: Wiêcej informacji mo¿na znale¼æ w rev(1).

source: cannot open "%s" for read
pl: nie mo¿na otworzyæ "%s" do odczytu

source: cannot stat "%s"
pl: nie mo¿na wykonaæ stat na "%s"

source: incomplete write to "%s" (written %zd, expected %zd)
pl: niepe³ny zapis do "%s" (zapisano %zd, oczekiwano %zd)

source: %s: cannot add inotify watch (limit of inotify watches was reached).
pl: %s: nie mo¿na dodaæ obserwatora inotify (osi±gniêto limit obserwatorów).

source: %s: cannot add inotify watch.
pl: %s: nie mo¿na dodaæ obserwatora inotify.

source: %s: cannot read inotify events
pl: %s: nie mo¿na odczytaæ zdarzeñ inotify

source: Usage: %s [option] file
pl: Sk³adnia: %s [opcja] plik

source: Options: -n, --lines NUMBER output the last NUMBER lines -NUMBER same as `-n NUMBER' -V, --version output version information and exit -h, --help display this help and exit
pl: Opcje: -n, --lines LICZBA wypisanie podanej LICZBY ostatnich linii -LICZBA to samo, `-n LICZBA' -V, --version wypisanie informacji o wersji i zakoñczenie -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: failed to parse number of lines
pl: nie uda³o siê przeanalizowaæ liczby linii

source: no input file specified
pl: nie podano pliku wej¶ciowego

source: Usage: %s [options] [file...]
pl: Sk³adnia: %s [opcje] [plik...]

source: Options: -t, --terminal TERMINAL override the TERM environment variable -i, --indicated underlining is indicated via a separate line -V, --version output version information and exit -h, --help display this help and exit
pl: Opcje: -t, --terminal TERMINAL wymuszenie zmiennej ¶rodowiskowej TERM -i, --indicated podkre¶lanie oznaczone dodatkow± lini± -V, --version wypisanie informacji o wersji i zakoñczenie -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: trouble reading terminfo
pl: problem z odczytem terminfo

source: terminal `%s' is not known, defaulting to `dumb'
pl: terminal `%s' jest nieznany, u¿ycie domy¶lnego `dumb'

source: unknown escape sequence in input: %o, %o
pl: nieznana sekwencja specjalna na wej¶ciu: %o, %o

source: Input line too long.
pl: Linia wej¶ciowa zbyt d³uga.
