Repository: RMerl/asuswrt-merlin
Catalog: release/src/router/util-linux/po/*.po
Languages: pl

source: %s: can't unlock %s: %s (your changes are still in %s)
pl: %s: nie mo¿na odblokowaæ %s: %s (zmiany s± nadal w %s)

source: fork failed
pl: wywo³anie fork nie powiod³o siê

source: %s: %s unchanged
pl: %s: %s niezmieniony

source: %s: no changes made
pl: %s: nie wykonano zmian

source: You are using shadow groups on this system.
pl: W tym systemie u¿ywane s± grupy ukryte (shadow).

source: You are using shadow passwords on this system.
pl: W tym systemie u¿ywane s± has³a ukryte (shadow).

source: Would you like to edit %s now [y/n]?
pl: Czy modyfikowaæ teraz %s [y/n]?

source: illegal day value
pl: niedozwolona warto¶æ dnia

source: illegal day value: use 1-%d
pl: niedozwolona warto¶æ dnia: dopuszczalne to 1-%d

source: illegal month value: use 1-12
pl: niedozwolona warto¶æ miesi±ca: dopuszczalne to 1-12

source: illegal year value: use 1-9999
pl: niedozwolona warto¶æ roku: dopuszczalne to 1-9999

source: %s [options] [[[day] month] year]
pl: Sk³adnia: %s [-13smjyV] [[[dzieñ] miesi±c] rok]

source: -1, --one show only current month (default) -3, --three show previous, current and next month -s, --sunday Sunday as first day of week -m, --monday Monday as first day of week -j, --julian output Julian dates -y, --year show whole current year -V, --version display version information and exit -h, --help display this help text and exit
pl: -1, --one wy¶wietlenie tylko bie¿±cego miesi±ca (domy¶lne) -3, --three wy¶wietlenie poprzedniego, bie¿±cego i nastêpnego miesi±ca -s, --sunday niedziela jako pierwszy dzieñ tygodnia -m, --monday poniedzia³ek jako pierwszy dzieñ tygodnia -j, --julian wy¶wietlanie dat juliañskich -y, --year wy¶wietlenie ca³ego bie¿±cego roku -V, --version wy¶wietlenie informacji o wersji i zakoñczenie -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: usage: %s [+format] [day month year]
pl: Sk³adnia: %s [+format] [dzieñ miesi±c rok]

source: St. Tib's Day
pl: Dzieñ ¦wiêtego Tiba

source: Usage: %s LABEL=<label>|UUID=<uuid>
pl: Sk³adnia: %s LABEL=<etykieta>|UUID=<uuid>

source: unable to resolve '%s'
pl: nie mo¿na odnale¼æ '%s'

source: source device
pl: urz±dzenie ¼ród³owe

source: mountpoint
pl: punkt montowania

source: filesystem type
pl: typ systemu plików

source: all mount options
pl: wszystkie opcje montowania

source: VFS specific mount options
pl: opcje montowania specyficzne dla VFS

source: FS specific mount options
pl: opcje montowania specyficzne dla FS

source: filesystem label
pl: etykieta systemu plików

source: filesystem UUID
pl: UUID systemu plików

source: major:minor device number
pl: numer urz±dzenia g³ówny:poboczny

source: action detected by --poll
pl: akcja wykryta przez --poll

source: old mount options saved by --poll
pl: stare opcje montowania zapisane przez --poll

source: old mountpoint saved by --poll
pl: stary punkt montowania zapisany przez --poll

source: unknown action: %s
pl: nieznana opcja: %s

source: unknown column: %s
pl: nieznana kolumna: %s

source: mount
pl: montowanie

source: umount
pl: odmontowanie

source: remount
pl: przemontowanie

source: move
pl: przeniesienie

source: failed to add line to output
pl: nie uda³o siê dodaæ linii do wyj¶cia

source: %s: parse error at line %d
pl: %s: b³±d sk³adni w linii %d

source: failed to initialize libmount table
pl: nie uda³o siê zainicjowaæ tablicy libmount

source: can't read %s
pl: nie mo¿na odczytaæ %s

source: failed to initialize libmount tabdiff
pl: nie uda³o siê zainicjowaæ tablicy tabdiff libmount

source: poll() failed
pl: poll() nie powiod³o siê

source: Usage: %1$s [options] %1$s [options] <device> | <mountpoint> %1$s [options] <device> <mountpoint> %1$s [options] [--source <device>] [--target <mountpoint>]
pl: Sk³adnia: %1$s [opcje] %1$s [opcje] <urz±dzenie> | <punkt_montowania> %1$s [opcje] <urz±dzenie> <punkt_montowania> %1$s [opcje] [--source <urz±dzenie>] [--target <punkt_montowania>]

source: Options: -s, --fstab search in static table of filesystems -m, --mtab search in table of mounted filesystems -k, --kernel search in kernel table of mounted filesystems (default)
pl: Opcje: -s, --fstab szukanie w statycznej tablicy systemów plików -m, --mtab szukanie w tablicy zamontowanych systemów plików -k, --kernel szukanie w tablicy j±dra zamontowanych systemów plików (domy¶lne)

source: -p, --poll[=<list>] monitor changes in table of mounted filesystems -w, --timeout <num> upper limit in milliseconds that --poll will block
pl: -p, --poll[=<lista>] monitorowanie zmian w tablicy zamontowanych syst.plików -w, --timeout <ile> górny limit oczekiwania przy --poll (w milisekundach)

source: -a, --ascii use ASCII chars for tree formatting -c, --canonicalize canonicalize printed paths -d, --direction <word> direction of search, 'forward' or 'backward' -e, --evaluate convert tags (LABEL/UUID) to device names -f, --first-only print the first found filesystem only
pl: -a, --ascii u¿ycie znaków ASCII do formatowania drzewa -c, --canonicalize wypisywanie ¶cie¿ek w postaci kanonicznej -d, --direction <jak> kierunek wyszukiwania: 'forward' lub 'backward' -e, --evaluate zamiana znaczników (ETYKIETA/UUID) na nazwy urz±dzeñ -f, --first-only wypisanie tylko pierwszego znalezionego syst. plików

source: -h, --help display this help text and exit -i, --invert invert the sense of matching -l, --list use list format output -n, --noheadings don't print column headings -u, --notruncate don't truncate text in columns
pl: -h, --help wy¶wietlenie tego opisu i zakoñczenie -i, --invert odwrócenie dopasowania -l, --list wyj¶cie w formacie listy -n, --noheadings bez wypisywania nag³ówków kolumn -u, --notruncate bez ucinania tekstu w kolumnach

source: -O, --options <list> limit the set of filesystems by mount options -o, --output <list> the output columns to be shown -P, --pairs use key="value" output format -r, --raw use raw output format -t, --types <list> limit the set of filesystems by FS types
pl: -O, --options <lista> ograniczenie zbioru systemów plików wg opcji montowania -o, --output <lista> kolumny do wypisania na wyj¶ciu -P, --pairs wyj¶cie w formacie klucz="warto¶æ" -r, --raw wyj¶cie w formacie surowym -t, --types <lista> ograniczenie zbioru systemów plików wg typów FS

source: -v, --nofsroot don't print [/dir] for bind or btrfs mounts -R, --submounts print all submounts for the matching filesystems -S, --source <string> the device to mount (by name, LABEL= or UUID=) -T, --target <string> the mountpoint to use
pl: -v, --nofsroot bez wypisywania [/dir] dla montowañ bind lub btrfs -R, --submounts wypisanie wszystkich podmontowañ dla pasuj±cych fs -S, --source <³añcuch> urz±dzenie do zamontowania (nazwa, LABEL=, UUID=) -T, --target <³añcuch> punkt montowania do u¿ycia

source: Available columns:
pl: Dostêpne kolumny:

source: For more information see findmnt(1).
pl: Wiêcej informacji w findmnt(1).

source: options are mutually exclusive
pl: opcje wykluczaj± siê wzajemnie

source: unknown direction '%s'
pl: nieznany kierunek '%s'

source: failed to parse timeout
pl: nie uda³o siê przeanalizowaæ limitu czasu

source: options --target and --source can't be used together with command line element that is not an option
pl: opcji --target i --source nie mo¿na u¿ywaæ jednocze¶nie z elementem polecenia, który nie jest opcj±

source: failed to initialize libmount cache
pl: nie uda³o siê zainicjowaæ pamiêci podrêcznej libmount

source: failed to initialize output table
pl: nie uda³o siê zainicjowaæ tabeli wyj¶ciowej

source: %s column is requested, but --poll is not enabled
pl: za¿±dano kolumny %s, ale nie w³±czono --poll

source: failed to initialize output column
pl: nie uda³o siê zainicjowaæ kolumny wyj¶ciowej

source: %s: unknown signal %s
pl: %s: nieznany sygna³ %s

source: failed to parse sigval
pl: nie uda³o siê przeanalizowaæ okre¶lenia sygna³u

source: %s: can't find process "%s"
pl: %s: nie znaleziono procesu "%s"

source: %s: unknown signal %s; valid signals:
pl: %s: nieznany sygna³ %s; poprawne sygna³y:

source: usage: %s [ -s signal | -p ] [ -a ] pid ...
pl: Sk³adnia: %s [ -s sygna³ | -p ] [ -a ] PID ...

source: %s -l [ signal ]
pl: %s -l [ sygna³ ]

source: openlog %s: pathname too long
pl: openlog %s: ¶cie¿ka zbyt d³uga

source: %s [options] [message]
pl: %s [opcje] [komunikat]

source: -d, --udp use UDP (TCP is default) -i, --id log the process ID too -f, --file <file> log the contents of this file -h, --help display this help text and exit
pl: -d, --udp u¿ycie UDP (domy¶lne jest TCP) -i, --id zalogowanie tak¿e ID procesu -f, --file <plik> zalogowanie zawarto¶ci podanego pliku -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: -n, --server <name> write to this remote syslog server -P, --port <number> use this UDP port -p, --priority <prio> mark given message with this priority -s, --stderr output message to standard error as well
pl: -n, --server <nazwa> zapisanie do sysloga podanego zdalnego serwera -P, --port <numer> u¿ycie podanego portu UDP -p, --priority <prio> oznaczenie komunikatu podanym priorytetem -s, --stderr wypisanie komunikatu tak¿e na stderr

source: -t, --tag <tag> mark every line with this tag -u, --socket <socket> write to this Unix socket -V, --version output version information and exit
pl: -t, --tag <znacznik> oznaczenie ka¿dej linii podanym znacznikiem -u, --socket <gniazdo> zapisanie do podanego gniazda uniksowego -V, --version wypisanie informacji o wersji i zakoñczenie

source: file %s
pl: plik %s

source: failed to parse port number
pl: nie uda³o siê przeanalizowaæ numeru portu

source: port `%ld' out of range
pl: port `%ld' jest spoza zakresu

source: unknown facility name: %s.
pl: nieznana nazwa kategorii: %s.

source: unknown priority name: %s.
pl: nieznana nazwa priorytetu: %s.

source: %s [options] string [file]
pl: %s [opcje] ³añcuch [plik]

source: -a, --alternative use alternate dictionary -d, --alphanum compare only alpha numeric characters -f, --ignore-case ignore when comparing -t, --terminate <char> define string termination character -V, --version output version information and exit -h, --help display this help and exit
pl: -a, --alternative u¿ycie s³ownika alternatywnego -d, --alphanum porównywanie tylko znaków alfanumerycznych -f, --ignore-case ignorowanie wielko¶ci liter przy porównywaniu -t, --terminate <znak> okre¶lenie znaku koñcz±cego ³añcuch -V, --version wypisanie informacji o wersji i zakoñczenie -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: device name
pl: nazwa urz±dzenia

source: internal kernel device name
pl: wewnêtrzna nazwa urz±dzenia w j±drze

source: where the device is mounted
pl: miejsce zamontowania urz±dzenia

source: filesystem LABEL
pl: etykieta systemu plików

source: read-only device
pl: urz±dzenie tylko do odczytu

source: removable device
pl: urz±dzenie wyjmowalne

source: rotational device
pl: urz±dzenie obrotowe

source: device identifier
pl: identyfikator urz±dzenia

source: size of the device
pl: rozmiar urz±dzenia

source: state of the device
pl: stan urz±dzenia

source: user name
pl: nazwa u¿ytkownika

source: group name
pl: nazwa grupy

source: device node permissions
pl: uprawnienia pliku urz±dzenia

source: alignment offset
pl: wyrównanie

source: minimum I/O size
pl: minimalny rozmiar we/wy

source: optimal I/O size
pl: optymalny rozmiar we/wy

source: physical sector size
pl: rozmiar sektora fizycznego

source: logical sector size
pl: rozmiar sektora logicznego

source: I/O scheduler name
pl: nazwa planisty we/wy

source: request queue size
pl: rozmiar kolejki ¿±dañ

source: device type
pl: typ urz±dzenia

source: discard alignment offset
pl: wyrównanie usuwania

source: discard granularity
pl: rozdzielczo¶æ usuwania

source: discard max bytes
pl: maks. bajtów usuwania

source: discard zeroes data
pl: dane usuwania zerami

source: %s: failed to get device path
pl: %s: nie uda³o siê pobraæ ¶cie¿ki urz±dzenia

source: %s: unknown device name
pl: %s: nieznana nazwa urz±dzenia

source: %s: failed to initialize sysfs handler
pl: %s: nie uda³o siê zainicjowaæ obs³ugi sysfs

source: %s: failed to get dm name
pl: %s: nie uda³o siê odczytaæ nazwy dm

source: failed to open device directory in sysfs
pl: nie uda³o siê otworzyæ katalogu urz±dzenia w sysfs

source: %s: failed to get whole-disk device number
pl: %s: nie uda³o siê pobraæ numeru urz±dzenia ca³ego dysku

source: failed to compose sysfs path for %s
pl: nie uda³o siê utworzyæ ¶cie¿ki sysfs dla %s

source: %s: failed to read link
pl: %s: nie uda³o siê odczytaæ dowi±zania

source: failed to parse list '%s'
pl: nie uda³o siê przeanalizowaæ listy '%s'

source: the list of excluded devices is too large (limit is %d devices)
pl: lista wykluczonych urz±dzeñ zbyt d³uga (limit liczby urz±dzeñ to %d)

source: Usage: %s [options] [<device> ...]
pl: Sk³adnia: %s [opcje] [<urz±dzenie> ...]

source: Options: -a, --all print all devices -b, --bytes print SIZE in bytes rather than in human readable format -d, --nodeps don't print slaves or holders -D, --discard print discard capabilities -e, --exclude <list> exclude devices by major number (default: RAM disks) -f, --fs output info about filesystems -h, --help usage information (this) -i, --ascii use ascii characters only -m, --perms output info about permissions -l, --list use list format ouput -n, --noheadings don't print headings -o, --output <list> output columns -P, --pairs use key="value" output format -r, --raw use raw output format -t, --topology output info about topology
pl: Opcje: -a, --all wypisanie wszystkich urz±dzeñ -b, --bytes wypisywanie rozmiarów w bajtach zamiast formatu czytelnego dla cz³owieka -d, --nodeps bez wypisywania urz±dzeñ podporz±dkowanych i nadrzêdnych -D, --discard wypisanie mo¿liwo¶ci usuwania -e, --exclude <lista> wykluczenie urz±dzeñ po numerach (domy¶lnie: ramdyski) -f, --fs wypisanie informacji o systemach plików -h, --help informacja o sk³adni (ten opis) -i, --ascii u¿ywanie wy³±cznie znaków ASCII -m, --perms wypisanie informacji o uprawnieniach -l, --list wyj¶cie w formacie listy -n, --noheadings bez wypisywania nag³ówków -o, --output <lista> kolumny do wypisania -r, --raw surowy format wyj¶cia -t, --topology wypisanie informacji o topologii

source: For more information see lsblk(8).
pl: Wiêcej informacji w lsblk(8).

source: %s [options]
pl: %s [opcje]

source: -f, --file <file> use file as a cookie seed -v, --verbose explain what is being done -V, --version output version information and exit -h, --help display this help and exit
pl: -f, --file <plik> u¿ycie pliku jako zarodka ciasteczka -v, --verbose wyja¶nianie wykonywanych czynno¶ci -V, --version wypisanie informacji o wersji i zakoñczenie -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: Could not open %s
pl: Nie mo¿na otworzyæ %s

source: Got %d bytes from %s
pl: Odebrano %d bajtów od %s

source: closing %s failed
pl: zamkniêcie %s nie powiod³o siê

source: failed to read symlink: %s
pl: nie uda³o siê odczytaæ dowi±zania symbolicznego: %s

source: could not stat '%s'
pl: nie uda³o siê wykonaæ stat na '%s'

source: %s - No such file or directory
pl: %s - nie ma takiego pliku ani katalogu

source: %s [options] pathname [pathname ...]
pl: %s [opcje] ¶cie¿ka [¶cie¿ka ...]

source: -h, --help displays this help text -V, --version output version information and exit -x, --mountpoints show mount point directories with a 'D' -m, --modes show the mode bits of each file -o, --owners show owner and group name of each file -l, --long use a long listing format (-m -o -v) -n, --nosymlinks don't follow symlinks -v, --vertical vertical align of modes and owners
pl: -h, --help wy¶wietlenie tego opisu -V, --version wypisanie informacji o wersji i zakoñczenie -x, --mountpoints wypisanie katalogów punktów montowania z 'D' -m, --modes wypisanie bitów uprawnieñ ka¿dego pliku -o, --owners wypisanie w³a¶ciciela i grupy ka¿dego pliku -l, --long u¿ycie d³ugiego formatu listy (-m -o -v) -n, --nosymlinks bez pod±¿ania za dowi±zaniami symbolicznymi -v, --vertical pionowe wyrównanie uprawnieñ i w³a¶cicieli

source: For more information see namei(1).
pl: Wiêcej informacji w namei(1).

source: pathname argument is missing
pl: brak argumentu bêd±cego ¶cie¿k±

source: %s: exceeded limit of symlinks
pl: %s: przekroczono limit dowi±zañ symbolicznych

source: renaming %s to %s failed
pl: zmiana nazwy %s na %s nie powiod³a siê

source: %s [options] expression replacement file...
pl: %s [opcje] wyra¿enie zamiennik plik...

source: -v, --verbose explain what is being done -V, --version output version information and exit -h, --help display this help and exit
pl: -v, --verbose wyja¶nianie wykonywanych czynno¶ci -V, --version wypisanie informacji o wersji i zakoñczenie -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: -p, --pid <path> path to pid file -s, --socket <path> path to socket -T, --timeout <sec> specify inactivity timeout -k, --kill kill running daemon -r, --random test random-based generation -t, --time test time-based generation -n, --uuids <num> request number of uuids -d, --debug run in debugging mode -q, --quiet turn on quiet mode -V, --version output version information and exit -h, --help display this help and exit
pl: -p, --pid <¶cie¿ka> ¶cie¿ka do pliku pid -s, --socket <¶cie¿ka> ¶cie¿ka do gniazda -T, --timeout <sek> okre¶lenie limitu czasu nieaktywno¶ci -k, --kill zabicie dzia³aj±cego demona -r, --random test generowania losowego -t, --time test generowania wg czasu -n, --uuids <ile> ¿±dana liczba uuidów -d, --debug tryb diagnostyczny -q, --quiet w³±czenie trybu cichego -V, --version wypisanie informacji o wersji i zakoñczenie -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: bad arguments
pl: b³êdne argumenty

source: write
pl: zapis

source: read count
pl: odczytany rozmiar

source: bad response length
pl: b³êdna d³ugo¶æ odpowiedzi

source: Failed to open/create %s: %s
pl: Nie uda³o siê otworzyæ/utworzyæ %s: %s

source: Failed to lock %s: %s
pl: Nie uda³o siê zablokowaæ %s: %s

source: uuidd daemon already running at pid %s
pl: demon uuidd ju¿ dzia³a z pidem %s

source: Couldn't create unix stream socket: %s
pl: Nie uda³o siê utworzyæ gniazda uniksowego: %s

source: Couldn't bind unix socket %s: %s
pl: Nie uda³o siê dowi±zaæ gniazda uniksowego %s: %s

source: Couldn't listen on unix socket %s: %s
pl: Nie uda³o siê uruchomiæ nas³uchiwania na gnie¼dzie uniksowym %s: %s

source: Error reading from client, len = %d
pl: B³±d odczytu od klienta, d³ugo¶æ = %d

source: operation %d, incoming num = %d
pl: operacja %d, odebrana liczba = %d

source: operation %d
pl: operacja %d

source: Generated time UUID: %s
pl: Wygenerowany UUID czasowy: %s

source: Generated random UUID: %s
pl: Wygenerowany UUID losowy: %s

source: Generated time UUID %s and %d following
pl: Wygenerowany UUID czasowy %s i %d kolejny

source: Generated %d UUID:
pl: Wygenerowano %d UUID:

source: Invalid operation %d
pl: Nieprawid³owa operacja %d

source: Unexpected reply length from server %d
pl: Nieoczekiwana d³ugo¶æ odpowiedzi od serwera %d

source: Bad number: %s
pl: B³êdna liczba: %s

source: Error calling uuidd daemon (%s): %s
pl: B³±d wywo³ania demona uuidd (%s): %s

source: %s and %d subsequent UUID
pl: %s i %d kolejny UUID

source: List of UUIDs:
pl: Lista UUID-ów:

source: Couldn't kill uuidd running at pid %d: %s
pl: Nie uda³o siê zabiæ uuidd dzia³aj±cego z pidem %d: %s

source: Killed uuidd running at pid %d
pl: Zabito uuidd dzia³aj±cego z pidem %d

source: -r, --random generate random-based uuid -t, --time generate time-based uuid -V, --version output version information and exit -h, --help display this help and exit
pl: -r, --random generowanie uuidów losowych -t, --time generowanie uuidów wg czasu -V, --version wypisanie informacji o wersji i zakoñczenie -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: %s [options] file
pl: %s [opcje] plik

source: -f <file> define search scope -b search only binaries -B <dirs> define binaries lookup path -m search only manual paths -M <dirs> define man lookup path -s search only sources path -S <dirs> define sources lookup path -u search from unusual enties -V output version information and exit -h display this help and exit
pl: -f <plik> okre¶lenie przedmiotu wyszukiwania -b wyszukiwanie tylko binariów -B <katalogi> okre¶lenie ¶cie¿ek wyszukiwania binariów -m wyszukiwanie tylko ¶cie¿ek stron podrêcznika (man) -M <katalogi> okre¶lenie ¶cie¿ek wyszukiwania stron podrêcznika -s wyszukiwanie tylko ¶cie¿ek ¼róde³ -S <katalogi> okre¶lenie ¶cie¿ek wyszukiwania ¼róde³ -u wyszukiwanie tylko wpisów niezwyk³ych -V wypisanie informacji o wersji i zakoñczenie -h wy¶wietlenie tego opisu i zakoñczenie

source: See how to use file and dirs arguments from whereis(1) manual.
pl: Opis sposobu u¿ycia argumentów plikowych i katalogowych znajduje siê w whereis(1).

source: calloc failed
pl: calloc nie powiod³o siê

source: error: %s: probing initialization failed
pl: b³±d: %s: inicjalizacja próbowania nie powiod³a siê

source: WARNING: %s: appears to contain '%s' partition table
pl: UWAGA: %s: wydaje siê zawieraæ tablicê partycji '%s'

source: no magic string found at offset 0x%jx -- ignored
pl: nie znaleziono ³añcucha magicznego pod offsetem 0x%jx - zignorowano

source: %s: failed to seek to offset 0x%jx
pl: %s: nie uda³o siê zmieniæ po³o¿enia na 0x%jx

source: %s: write failed
pl: zapis nie powiód³ siê: %s

source: %zd bytes were erased at offset 0x%jx (%s) they were:
pl: %zd bajtów usuniêtych pod offsetem 0x%jx (%s) oto one:

source: invalid offset value '%s' specified
pl: podano b³êdn± warto¶æ offsetu '%s'

source: %s [options] <device>
pl: %s [opcje] <urz±dzenie>

source: -a, --all wipe all magic strings (BE CAREFUL!) -h, --help show this help text -n, --no-act do everything except the actual write() call -o, --offset <num> offset to erase, in bytes -p, --parsable print out in parsable instead of printable format -V, --version output version information and exit
pl: -a, --all usuniêcie wszystkich ³añcuchów magicznych (OSTRO¯NIE!) -h, --help wy¶wietlenie tego opisu -n, --no-act wszystko poza w³a¶ciwymi operacjami zapisu -o, --offset <n> offset do usuniêcia w bajtach -p, --parsable wyj¶cie w formacie do przetworzenia -V, --version wypisanie informacji o wersji i zakoñczenie

source: For more information see wipefs(8).
pl: Wiêcej informacji w wipefs(8).

source: --offset and --all are mutually exclusive
pl: --offset i --all wykluczaj± siê wzajemnie

source: only one device as argument is currently supported.
pl: obs³ugiwane jest tylko jedno urz±dzenie jako argument.

source: warning: error reading %s: %s
pl: uwaga: b³±d odczytu %s: %s

source: warning: failed to read mtab
pl: uwaga: nie uda³o siê odczytaæ pliku mtab

source: warning: can't open %s: %s
pl: uwaga: nie mo¿na otworzyæ %s: %s

source: mount: could not open %s - using %s instead
pl: mount: nie uda³o siê otworzyæ %s - u¿ycie %s

source: can't create lock file %s: %s (use -n flag to override)
pl: nie mo¿na utworzyæ pliku blokady %s: %s (opcja -n pominie to)

source: can't link lock file %s: %s (use -n flag to override)
pl: nie mo¿na dowi±zaæ pliku blokady %s: %s (opcja -n pominie to)

source: can't open lock file %s: %s (use -n flag to override)
pl: nie mo¿na otworzyæ pliku blokady %s: %s (opcja -n pominie to)

source: Can't lock lock file %s: %s
pl: Nie mo¿na zablokowaæ pliku blokady %s: %s

source: can't lock lock file %s: %s
pl: nie mo¿na zablokowaæ pliku blokady %s: %s

source: timed out
pl: up³yn±³ limit czasu

source: Cannot create link %s Perhaps there is a stale lock file?
pl: Nie mo¿na utworzyæ dowi±zania %s Byæ mo¿e pozosta³ nieaktualny plik blokady?

source: cannot open %s (%s) - mtab not updated
pl: nie mo¿na otworzyæ %s (%s) - nie uaktualniono pliku mtab

source: error writing %s: %s
pl: b³±d zapisu %s: %s

source: %s: cannot fflush changes: %s
pl: %s: nie mo¿na wykonaæ fflush zmian: %s

source: error changing mode of %s: %s
pl: b³±d podczas zmiany uprawnieñ pliku %s: %s
