Repository: RMerl/asuswrt-merlin
Catalog: release/src/router/util-linux/po/*.po
Languages: pl

source: %s: unable to allocate buffer for inodes
pl: %s: nie uda³o siê przydzieliæ bufora dla i-wêz³ów

source: %lu inodes
pl: i-wêz³ów: %lu

source: %lu blocks
pl: bloków: %lu

source: %s: seek failed during testing of blocks
pl: %s: przemieszczenie nie powiod³o siê podczas sprawdzania bloków

source: Weird values in do_check: probably bugs
pl: Dziwna warto¶æ w do_check: prawdopodobnie b³êdy

source: %s: seek failed in check_blocks
pl: %s: przemieszczenie nie powiod³o siê w check_blocks

source: %s: bad blocks before data-area: cannot make fs
pl: %s: wadliwe bloki przed obszarem danych: nie mo¿na utworzyæ systemu plików

source: %d bad blocks
pl: %d wadliwych bloków

source: one bad block
pl: jeden wadliwy blok

source: %s: can't open file of bad blocks
pl: %s: nie mo¿na otworzyæ pliku z wadliwymi blokami

source: badblock number input error on line %d
pl: b³êdny numer wadliwego bloku w linii %d

source: %s: cannot read badblocks file
pl: %s: nie mo¿na odczytaæ pliku wadliwych bloków

source: %s: bad inode size
pl: %s: b³êdny rozmiar i-wêz³a

source: strtol error: number of blocks not specified
pl: b³±d strtol: nie podano liczby bloków

source: %s: stat failed
pl: %s: stat nie powiód³ siê

source: %s: open failed
pl: %s: nie uda³o siê otworzyæ

source: %s: device is misaligned
pl: %s: urz±dzenie jest b³êdnie wyrównane

source: block size smaller than physical sector size of %s
pl: rozmiar bloku mniejszy ni¿ rozmiar fizycznego sektora na %s

source: cannot determine size of %s
pl: nie mo¿na okre¶liæ rozmiaru %s

source: will not try to make filesystem on '%s'
pl: odmowa utworzenia systemu plików na '%s'

source: %s: number of blocks too small
pl: %s: liczba bloków zbyt ma³a

source: Bad user-specified page size %lu
pl: B³êdny podany przez u¿ytkownika rozmiar strony %lu

source: Using user-specified page size %d, instead of the system value %d
pl: U¿ycie podanego przez u¿ytkownika rozmiaru strony %d zamiast systemowego %d

source: Bad swap header size, no label written.
pl: B³êdny rozmiar nag³ówka obszaru wymiany, nie zapisano etykiety.

source: Label was truncated.
pl: Etykieta zosta³a skrócona.

source: no label,
pl: brak etykiety,

source: no uuid
pl: brak uuida

source: Usage: %s [options] device [size]
pl: Sk³adnia: %s [opcje] urz±dzenie [rozmiar]

source: Options: -c, --check check bad blocks before creating the swap area -f, --force allow swap size area be larger than device -p, --pagesize SIZE specify page size in bytes -L, --label LABEL specify label -v, --swapversion NUM specify swap-space version number -U, --uuid UUID specify the uuid to use -V, --version output version information and exit -h, --help display this help and exit
pl: Opcje: -c, --check test b³êdnych bloków przed utw. obszaru wymiany -f, --force zezwolenie na obszar wymiany wiêkszy ni¿ urz±dzenie -p, --pagesize ROZMIAR okre¶lenie rozmiaru strony w bajtach -L, --label ETYKIETA okre¶lenie etykiety -v, --swapversion NUMER okre¶lenie numeru wersji obszaru wymiany -U, --uuid UUID okre¶lenie uuida do u¿ycia -V, --version wypisanie informacji o wersji i zakoñczenie -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: too many bad pages
pl: za du¿o wadliwych stron

source: seek failed in check_blocks
pl: przemieszczenie nie powiod³o siê w check_blocks

source: one bad page
pl: jedna wadliwa strona

source: %lu bad pages
pl: %lu wadliwych stron

source: unable to rewind swap-device
pl: nie uda³o siê przewin±æ urz±dzenia swapa

source: unable to alloc new libblkid probe
pl: nie uda³o siê przydzieliæ nowej sondy libblkid

source: unable to assign device to libblkid probe
pl: nie uda³o siê przypisaæ urz±dzenia do sondy libblkid

source: unable to erase bootbits sectors
pl: nie uda³o siê usun±æ sektorów rozruchowych

source: %s: warning: don't erase bootbits sectors
pl: %s: uwaga: nie usuniêto sektorów rozruchowych

source: (%s partition table detected).
pl: (wykryto tablicê partycji %s).

source: on whole disk.
pl: na ca³ym dysku.

source: (compiled without libblkid).
pl: (zbudowano bez libblkid).

source: parse page size failed
pl: nie uda³o siê przeanalizowaæ rozmiaru strony

source: parse version number failed
pl: nie uda³o siê przeanalizowaæ numeru wersji

source: warning: ignore -U (UUIDs are unsupported by %s)
pl: uwaga: zignorowano -U (UUID-y nie s± obs³ugiwane przez %s)

source: does not support swapspace version %lu.
pl: brak obs³ugi obszaru wymiany w wersji %lu.

source: error: UUID parsing failed
pl: b³±d: analiza UUID-a nie powiod³a siê

source: error: Nowhere to set up swap on?
pl: b³±d: Nie ma gdzie utworzyæ obszaru wymiany?

source: error: size %llu KiB is larger than device size %llu KiB
pl: b³±d: rozmiar %llu KiB jest wiêkszy ni¿ rozmiar urz±dzenia %llu KiB

source: error: swap area needs to be at least %ld KiB
pl: b³±d: obszar wymiany musi mieæ przynajmniej %ld KiB

source: warning: truncating swap area to %llu KiB
pl: uwaga: zmniejszono rozmiar wymiany do %llu KiB

source: error: will not try to make swapdevice on '%s'
pl: b³±d: odmowa utworzenia obszaru wymiany na '%s'

source: error: %s is mounted; will not make swapspace.
pl: b³±d: %s jest zamontowany; odmowa utworzenia obszaru wymiany.

source: warning: %s is misaligned
pl: uwaga: %s jest b³êdnie wyrównane

source: Unable to set up swap-space: unreadable
pl: Nie uda³o siê utworzyæ obszaru wymiany: nieczytelny

source: Setting up swapspace version 1, size = %llu KiB
pl: Tworzenie obszaru wymiany w wersji 1, rozmiar = %llu KiB

source: %s: unable to write signature page
pl: %s: nie uda³o siê zapisaæ strony sygnatury

source: fsync failed
pl: fsync nie powiód³ siê

source: %s: unable to obtain selinux file label
pl: %s: nie uda³o siê uzyskaæ etykiety pliku SELinuksa

source: unable to matchpathcon()
pl: matchpathcon() nie powiod³o siê

source: unable to create new selinux context
pl: nie uda³o siê utworzyæ nowego kontekstu SELinuksa

source: couldn't compute selinux context
pl: nie uda³o siê wyliczyæ kontekstu SELinuksa

source: unable to relabel %s to %s
pl: nie uda³o siê przeetykietowaæ %s na %s

source: Usage: %1$s %2$srawN <major> <minor> %1$s %2$srawN /dev/<blockdevice> %1$s -q %2$srawN %1$s -qa
pl: Sk³adnia: %1$s %2$srawN <major> <minor> %1$s %2$srawN /dev/<urz±dzenie-blokowe> %1$s -q %2$srawN %1$s -qa

source: Device '%s' is the control raw device (use raw<N> where <N> is greater than zero)
pl: Urz±dzenie '%s' jest steruj±cym urz±dzeniem surowym (nale¿y u¿yæ raw<N>, gdzie <N> jest wiêksze od zera)

source: Cannot locate block device '%s' (%s)
pl: Nie mo¿na zlokalizowaæ urz±dzenia blokowego '%s' (%s)

source: Device '%s' is not a block device
pl: Urz±dzenie '%s' nie jest urz±dzeniem blokowym

source: Cannot open master raw device '%s' (%s)
pl: Nie mo¿na otworzyæ nadrzêdnego urz±dzenia surowego '%s' (%s)

source: Cannot locate raw device '%s' (%s)
pl: Nie mo¿na zlokalizowaæ urz±dzenia surowego '%s' (%s)

source: Raw device '%s' is not a character dev
pl: Urz±dzenie surowe '%s' nie jest urz±dzeniem znakowym

source: Device '%s' is not a raw dev
pl: Urz±dzenie '%s' nie jest urz±dzeniem surowym

source: Error querying raw device (%s)
pl: B³±d odpytywania urz±dzenia surowego (%s)

source: %sraw%d: bound to major %d, minor %d
pl: %sraw%d: przypisano do urz±dzenia major %d, minor %d

source: Error setting raw device (%s)
pl: B³±d ustawiania urz±dzenia surowego (%s)

source: %s: unable to probe device
pl: %s: nie uda³o siê sprawdziæ urz±dzenia

source: %s: ambivalent probing result, use wipefs(8)
pl: %s: niejednoznaczny wynik próby, proszê u¿yæ wipefs(8)

source: %s: not a valid swap partition
pl: %s: nie jest poprawn± partycj± wymiany

source: %s: unsupported swap version '%s'
pl: %s: nieobs³ugiwana wersja obszaru wymiany '%s'

source: %s: failed to open
pl: %s: nie uda³o siê otworzyæ

source: failed to parse UUID: %s
pl: nie uda³o siê przeanalizowaæ UUID-a: %s

source: %s: failed to seek to swap UUID
pl: %s: nie uda³o siê zmieniæ po³o¿enia na UUID obszaru wymiany

source: %s: failed to write UUID
pl: %s: nie uda³o siê zapisaæ UUID-a

source: %s: failed to seek to swap label
pl: %s: nie uda³o siê zmieniæ po³o¿enia na etykietê obszaru wymiany

source: label is too long. Truncating it to '%s'
pl: etykieta jest zbyt d³uga. Obciêto do '%s'

source: %s: failed to write label
pl: %s: nie uda³o siê zapisaæ etykiety

source: Usage: %s [options] <device> Options:
pl: Sk³adnia: %s [opcje] <urz±dzenie> Opcje:

source: -h, --help this help -L, --label <label> specify a new label -U, --uuid <uuid> specify a new uuid
pl: -h, --help ten opis -L, --label <etykieta> okre¶lenie nowej etykiety -U, --uuid <uuid> okre¶lenie nowego UUID-a

source: For more information see swaplabel(8).
pl: Wiêcej informacji w swaplabel(8).

source: ignore -U (UUIDs are unsupported)
pl: zignorowano -U (UUID-y nie s± obs³ugiwane przez)

source: %s: Out of memory!
pl: %s: Zabrak³o pamiêci!

source: Unusable
pl: Bezu¿yteczne

source: Free Space
pl: Wolne miejsce

source: Disk has been changed.
pl: Dysk zosta³ zmieniony.

source: Reboot the system to ensure the partition table is correctly updated.
pl: Nale¿y zrestartowaæ system, aby zapewniæ poprawne uaktualnienie tablicy partycji.

source: WARNING: If you have created or modified any DOS 6.x partitions, please see the cfdisk manual page for additional information.
pl: UWAGA: je¶li zosta³y utworzone lub zmodyfikowane jakiekolwiek partycje DOS 6.x, proszê poszukaæ dodatkowych informacji w podrêczniku do cfdiska.

source: FATAL ERROR
pl: B£¡D KRYTYCZNY

source: Press any key to exit cfdisk
pl: Proszê nacisn±æ dowolny klawisz, aby zakoñczyæ cfdisk

source: Cannot seek on disk drive
pl: Nie uda³o przemie¶ciæ siê po dysku

source: Cannot read disk drive
pl: Nie uda³o siê odczytaæ dysku

source: Cannot write disk drive
pl: Nie uda³o siê zapisaæ dysku

source: Too many partitions
pl: Zbyt du¿o partycji

source: Partition begins before sector 0
pl: Partycja zaczyna siê przed sektorem 0

source: Partition ends before sector 0
pl: Partycja koñczy siê przed sektorem 0

source: Partition begins after end-of-disk
pl: Partycja zaczyna siê za koñcem dysku

source: Partition ends after end-of-disk
pl: Partycja koñczy siê za koñcem dysku

source: logical partitions not in disk order
pl: Partycje logiczne nie s± w kolejno¶ci na dysku

source: logical partitions overlap
pl: Partycje logiczne zachodz± na siebie

source: enlarged logical partitions overlap
pl: Powiêkszone partycje logiczne zachodz± na siebie

source: !!!! Internal error creating logical drive with no extended partition !!!!
pl: !!!! B³±d wewnêtrzny przy tworzeniu partycji logicznej bez rozszerzonej !!!!

source: Cannot create logical drive here -- would create two extended partitions
pl: Nie mo¿na tu utworzyæ napêdu logicznego - powsta³yby dwie partycje rozszerzone

source: Menu item too long. Menu may look odd.
pl: Za d³uga pozycja w menu, mo¿e wygl±daæ dziwnie.

source: Illegal key
pl: Niedozwolony klawisz

source: Press a key to continue
pl: Proszê nacisn±æ klawisz, aby kontynuowaæ

source: Primary
pl: G³ówna

source: Create a new primary partition
pl: Utworzenie nowe partycji g³ównej

source: Logical
pl: Logiczna

source: Create a new logical partition
pl: Utworzenie nowej partycji logicznej

source: Cancel
pl: Anuluj

source: Don't create a partition
pl: Bez tworzenia partycji

source: !!! Internal error !!!
pl: !!! B³±d wewnêtrzny !!!

source: Size (in MB):
pl: Rozmiar (w MB):

source: Beginning
pl: Pocz±tek

source: Add partition at beginning of free space
pl: Dodanie partycji na pocz±tku wolnego miejsca

source: End
pl: Koniec

source: Add partition at end of free space
pl: Dodanie partycji na koñcu wolnego miejsca

source: No room to create the extended partition
pl: Brak miejsca na utworzenie partycji rozszerzonej

source: No partition table.
pl: Brak tablicy partycji.

source: No partition table. Starting with zero table.
pl: Brak tablicy partycji. Rozpoczêcie od pustej tablicy.

source: Bad signature on partition table
pl: B³êdna sygnatura tablicy partycji

source: Unknown partition table type
pl: Nieznany typ tablicy partycji

source: Do you wish to start with a zero table [y/N] ?
pl: Czy zacz±æ od pustej tablicy [t/N] ?

source: You specified more cylinders than fit on disk
pl: Podano wiêcej cylindrów ni¿ mie¶ci siê na dysku

source: Cannot open disk drive
pl: Nie mo¿na otworzyæ urz±dzenia dysku

source: Opened disk read-only - you have no permission to write
pl: Otwarto dysk w trybie tylko do odczytu - brak prawa zapisu

source: Warning!! Unsupported GPT (GUID Partition Table) detected. Use GNU Parted.
pl: Uwaga! Wykryto nieobs³ugiwan± tablicê GPT (GUID Partition Table). Nale¿y u¿yæ GNU Parteda.

source: Cannot get disk size
pl: Nie mo¿na pobraæ rozmiaru dysku

source: Bad primary partition
pl: B³êdna partycja g³ówna

source: Bad logical partition
pl: B³êdna partycja logiczna

source: Warning!! This may destroy data on your disk!
pl: Uwaga! To mo¿e zniszczyæ dane na dysku!

source: Are you sure you want to write the partition table to disk? (yes or no):
pl: Czy na pewno zapisaæ na dysk tablicê partycji? (tak lub nie):

source: no
pl: nie

source: Did not write partition table to disk
pl: Nie zapisano tablicy partycji

source: yes
pl: tak

source: Please enter `yes' or `no'
pl: Proszê wpisaæ "tak" lub "nie"

source: Writing partition table to disk...
pl: Zapisywanie tablicy partycji na dysku...

source: Wrote partition table to disk
pl: Zapisano tablicê partycji

source: Wrote partition table, but re-read table failed. Run partprobe(8), kpartx(8) or reboot to update table.
pl: Zapisano tablicê partycji, ale ponowny odczyt nie powiód³ siê. Proszê uruchomiæ partprobe(8), kpartx(8) lub zrestartowaæ system, aby uaktualniæ tablicê.

source: No primary partitions are marked bootable. DOS MBR cannot boot this.
pl: ¯adna z g³ównych partycji nie jest zaznaczona jako rozruchowa. DOS-owy MBR tego nie uruchomi.

source: More than one primary partition is marked bootable. DOS MBR cannot boot this.
pl: Wiêcej ni¿ jedna g³ówna partycja jest zaznaczona jako rozruchowa. DOS-owy MBR tego nie uruchomi.

source: Enter filename or press RETURN to display on screen:
pl: Proszê wprowadziæ nazwê pliku lub wcisn±æ RETURN, aby wy¶wietliæ na ekranie:

source: Cannot open file '%s'
pl: Nie mo¿na otworzyæ pliku '%s'

source: Disk Drive: %s
pl: Urz±dzenie dysku: %s

source: Sector 0:
pl: Sektor 0:

source: Sector %d:
pl: Sektor %d:

source: None
pl: Brak

source: Pri/Log
pl: G³./Log.

source: Primary
pl: G³ówna

source: Logical
pl: Logiczna

source: Unknown
pl: Nieznany

source: Boot
pl: Rozruch

source: None
pl: Brak

source: Partition Table for %s
pl: Tablica partycji dla %s

source: First Last
pl: Pierwszy Ostatni

source: # Type Sector Sector Offset Length Filesystem Type (ID) Flag
pl: # Typ sektor sektor Offset D³ugo¶æ ID systemu plików Flaga

source: ---Starting---- ----Ending----- Start Number of
pl: --Pocz±tkowe--- ----Koñcowe---- Pierwszy Liczba

source: # Flags Head Sect Cyl ID Head Sect Cyl Sector Sectors
pl: # Flagi G³ow.Sekt. Cyl. ID G³ow.Sekt. Cyl. Sektor sektorów

source: Raw
pl: Surowy

source: Print the table using raw data format
pl: Wypisanie tablicy w surowym formacie danych

source: Sectors
pl: Sektory

source: Print the table ordered by sectors
pl: Wypisanie tablicy w kolejno¶ci sektorów

source: Table
pl: Tablica

source: Just print the partition table
pl: Zwyk³e wypisanie tablicy partycji

source: Don't print the table
pl: Bez wypisywania tablicy

source: Help Screen for cfdisk
pl: Ekran pomocy dla cfdiska

source: This is cfdisk, a curses based disk partitioning program, which
pl: To jest cfdisk - oparty na curses program do partycjonowania dysku,

source: allows you to create, delete and modify partitions on your hard
pl: pozwalaj±cy tworzyæ, usuwaæ i modyfikowaæ partycje na twardym

source: disk drive.
pl: dysku.

source: Copyright (C) 1994-1999 Kevin E. Martin & aeb
pl: Copyright (C) 1994-1999 Kevin E. Martin i aeb

source: Command Meaning
pl: Polecenie Znaczenie

source: b Toggle bootable flag of the current partition
pl: b Prze³±czenie flagi rozruchu dla bie¿±cej partycji

source: d Delete the current partition
pl: d Usuniêcie bie¿±cej partycji

source: g Change cylinders, heads, sectors-per-track parameters
pl: g Zmiana parametrów cylindrów, g³owic i sektorów na ¶cie¿ce

source: WARNING: This option should only be used by people who
pl: UWAGA: ta opcja powinna byæ u¿ywana tylko przez osoby

source: know what they are doing.
pl: wiedz±ce co robi±.

source: h Print this screen
pl: h Wy¶wietlenie tego ekranu

source: m Maximize disk usage of the current partition
pl: m Zmaksymalizowanie wykorzystania dysku przez bie¿±c± partycjê

source: Note: This may make the partition incompatible with
pl: Uwaga: mo¿e to spowodowaæ niekompatybilno¶æ partycji

source: DOS, OS/2, ...
pl: z DOS-em, OS/2 itp.

source: n Create new partition from free space
pl: n Utworzenie nowej partycji na wolnym miejscu

source: p Print partition table to the screen or to a file
pl: p Wypisanie tablicy partycji na ekranie lub do pliku

source: There are several different formats for the partition
pl: Mo¿na wybraæ jeden z kilku ró¿nych formatów listy

source: that you can choose from:
pl: partycji:

source: r - Raw data (exactly what would be written to disk)
pl: r - surowe dane (w takiej postaci, jak na dysku)

source: s - Table ordered by sectors
pl: s - tablica w kolejno¶ci sektorów

source: t - Table in raw format
pl: t - tablica w formacie surowym

source: q Quit program without writing partition table
pl: q Zakoñczenie programu bez zapisu tablicy partycji

source: t Change the filesystem type
pl: t Zmiana typu systemu plików

source: u Change units of the partition size display
pl: u Zmiana jednostek wy¶wietlania rozmiaru partycji

source: Rotates through MB, sectors and cylinders
pl: Prze³±cza miêdzy MB, sektorami i cylindrami

source: W Write partition table to disk (must enter upper case W)
pl: W Zapis tablicy partycji na dysk (musi byæ wielkie W)

source: Since this might destroy data on the disk, you must
pl: Poniewa¿ mo¿e to zniszczyæ dane na dysku, nale¿y

source: either confirm or deny the write by entering `yes' or
pl: potwierdziæ lub anulowaæ zapis wpisuj±c "tak" lub

source: `no'
pl: "nie"

source: Up Arrow Move cursor to the previous partition
pl: Góra Przesuniêcie kursora na poprzedni± partycjê

source: Down Arrow Move cursor to the next partition
pl: Dó³ Przesuniêcie kursora na nastêpn± partycjê

source: CTRL-L Redraws the screen
pl: Ctrl-L Odrysowanie ekranu

source: ? Print this screen
pl: ? Wy¶wietlenie tego ekranu

source: Note: All of the commands can be entered with either upper or lower
pl: Uwaga: wszystkie polecenia mog± byæ uruchomione wielkimi lub ma³ymi

source: case letters (except for Writes).
pl: literami (z wyj±tkiem zapisu - W).

source: Cylinders
pl: Cylindry

source: Change cylinder geometry
pl: Zmiana liczby cylindrów

source: Heads
pl: G³owice

source: Change head geometry
pl: Zmiana liczby g³owic

source: Change sector geometry
pl: Zmiana liczby sektorów

source: Done
pl: Koniec

source: Done with changing geometry
pl: Zakoñczenie zmian w geometrii

source: Enter the number of cylinders:
pl: Liczba cylindrów:

source: Illegal cylinders value
pl: Niedozwolona liczba cylindrów

source: Enter the number of heads:
pl: Liczba g³owic:

source: Illegal heads value
pl: Niedozwolona liczba g³owic

source: Enter the number of sectors per track:
pl: Liczba sektorów na ¶cie¿ce:

source: Illegal sectors value
pl: Niedozwolona liczba sektorów

source: Enter filesystem type:
pl: Typ systemu plików:

source: Cannot change FS Type to empty
pl: Nie mo¿na zmieniæ typu systemu plików na pusty

source: Cannot change FS Type to extended
pl: Nie mo¿na zmieniæ typu systemu plików na partycjê rozszerzon±

source: Unk(%02X)
pl: ???(%02X)

source: , NC
pl: , NK

source: NC
pl: NK

source: Pri/Log
pl: G³/Log

source: Unknown (%02X)
pl: Nieznany (%02X)

source: Disk Drive: %s
pl: Urz±dzenie: %s

source: Size: %lld bytes, %lld MB
pl: Rozmiar: %lld bajtów, %lld MB

source: Size: %lld bytes, %lld.%lld GB
pl: Rozmiar: %lld bajtów, %lld.%lld GB

source: Heads: %d Sectors per Track: %d Cylinders: %lld
pl: G³owic: %d Sektorów na ¶cie¿ce: %d Cylindrów: %lld

source: Name
pl: Nazwa

source: Flags
pl: Flagi

source: Part Type
pl: Typ partycji

source: FS Type
pl: System plików

source: [Label]
pl: [Etykieta]

source: Sectors
pl: Sektorów

source: Cylinders
pl: Cylindrów

source: Size (MB)
pl: Rozmiar (MB)

source: Size (GB)
pl: Rozmiar (GB)

source: No more partitions
pl: Nie ma wiêcej partycji

source: Bootable
pl: Rozruch

source: Toggle bootable flag of the current partition
pl: Prze³±czenie flagi rozruchu dla bie¿±cej partycji

source: Delete
pl: Usuñ

source: Delete the current partition
pl: Usuniêcie bie¿±cej partycji

source: Geometry
pl: Geometria

source: Change disk geometry (experts only)
pl: Zmiana geometrii dysku (tylko dla ekspertów)

source: Help
pl: Pomoc

source: Print help screen
pl: Wy¶wietlenie ekranu pomocy

source: Maximize
pl: Maksymalizuj

source: Maximize disk usage of the current partition (experts only)
pl: Zmaksymalizowanie wykorzystania dysku przez bie¿±c± partycjê (tylko dla ekspertów)

source: New
pl: Nowa

source: Create new partition from free space
pl: Utworzenie nowej partycji na wolnym miejscu

source: Print
pl: Wypisz

source: Print partition table to the screen or to a file
pl: Wypisanie tablicy partycji na ekranie lub do pliku

source: Quit
pl: Zakoñcz

source: Quit program without writing partition table
pl: Zakoñczenie programu bez zapisu tablicy partycji

source: Type
pl: Typ

source: Change the filesystem type (DOS, Linux, OS/2 and so on)
pl: Zmiana typu systemu plików (DOS, Linux, OS/2 itd.)

source: Units
pl: Jednostki

source: Change units of the partition size display (MB, sect, cyl)
pl: Zmiana jednostek wy¶wietlania rozmiaru partycji (MB, sekt., cyl.)

source: Write
pl: Zapisz

source: Write partition table to disk (this might destroy data)
pl: Zapis tablicy partycji na dysk (mo¿e to zniszczyæ dane)

source: Cannot make this partition bootable
pl: Nie mo¿na uczyniæ tej partycji rozruchow±

source: Cannot delete an empty partition
pl: Nie mo¿na usun±æ pustej partycji

source: Cannot maximize this partition
pl: Nie mo¿na zmaksymalizowaæ tej partycji

source: This partition is unusable
pl: Ta partycja jest bezu¿yteczna

source: This partition is already in use
pl: Ta partycja ju¿ jest u¿ywana

source: Cannot change the type of an empty partition
pl: Nie mo¿na zmieniæ typu pustej partycji

source: Illegal command
pl: Niedozwolone polecenie

source: Copyright (C) 1994-2002 Kevin E. Martin & aeb
pl: Copyright (C) 1994-2002 Kevin E. Martin i aeb

source: Usage: Print version: %s -v Print partition table: %s -P {r|s|t} [options] device Interactive use: %s [options] device Options: -a: Use arrow instead of highlighting; -z: Start with a zero partition table, instead of reading the pt from disk; -c C -h H -s S: Override the kernel's idea of the number of cylinders, the number of heads and the number of sectors/track.
pl: Sk³adnia: Wypisanie wersji: %s -v Wypisanie tablicy partycji: %s -P {r|s|t} [opcje] urz±dzenie U¿ycie interaktywne: %s [opcje] urz±dzenie Opcje: -a: u¿ycie strza³ki zamiast pod¶wietlenia; -z: rozpoczêcie od pustej tablicy partycji zamiast odczytu jej z dysku; -c C -h H -s S: wymuszenie innej liczby cylindrów, g³owic i sektorów na ¶cie¿ce ni¿ przyjêta przez j±dro.
