Repository: RMerl/asuswrt-merlin
Catalog: release/src/router/util-linux/po/*.po
Languages: pl

source: set read-only
pl: ustawienie tylko do odczytu

source: set read-write
pl: ustawienie do odczytu i zapisu

source: get read-only
pl: pobranie flagi tylko do odczytu

source: get discard zeroes support status
pl: pobranie statusu obs³ugi usuwania zerami

source: get logical block (sector) size
pl: pobranie rozmiaru bloku (sektora) logicznego

source: get physical block (sector) size
pl: pobranie rozmiaru bloku (sektora) fizycznego

source: get minimum I/O size
pl: pobranie minimalnego rozmiaru we/wy

source: get optimal I/O size
pl: pobranie optymalnego rozmiaru we/wy

source: get alignment offset in bytes
pl: pobranie wyrównania w bajtach

source: get max sectors per request
pl: pobranie maksymalnej liczby sektorów na ¿±danie

source: get blocksize
pl: pobranie rozmiaru bloku

source: set blocksize
pl: ustawienie rozmiaru bloku

source: get 32-bit sector count (deprecated, use --getsz)
pl: pobranie 32-bitowej liczby sektorów (przestarza³e, lepiej u¿ywaæ --getsz)

source: get size in bytes
pl: pobranie rozmiaru w bajtach

source: set readahead
pl: ustawienie odczytu z wyprzedzeniem

source: get readahead
pl: pobranie ustawienia odczytu z wyprzedzeniem

source: set filesystem readahead
pl: ustawienie odczytu z wyprzedzeniem dla systemu plików

source: get filesystem readahead
pl: pobranie ustawienia odczytu z wyprzedzeniem dla systemu plików

source: flush buffers
pl: opró¿nienie buforów

source: reread partition table
pl: ponowne odczytanie tablicy partycji

source: Usage: %1$s -V %1$s --report [devices] %1$s [-v|-q] commands devices Available commands:
pl: Sk³adnia: %1$s -V %1$s --report [urz±dzenia] %1$s [-v|-q] polecenia urz±dzenia

source: %-25s get size in 512-byte sectors
pl: %-25s pobranie rozmiaru w sektorach 512-bajtowych

source: cannot open %s
pl: nie mo¿na otworzyæ %s

source: could not get device size
pl: nie uda³o siê pobraæ rozmiaru urz±dzenia

source: Unknown command: %s
pl: Nieznane polecenie: %s

source: %s requires an argument
pl: %s wymaga argumentu

source: %s failed.
pl: %s nie powiod³o siê.

source: %s succeeded.
pl: %s powiod³o siê.

source: ioctl error on %s
pl: b³±d ioctl na %s

source: RO RA SSZ BSZ StartSec Size Device
pl: RO RA SSZ BSZ PoczSektor Rozmiar Urz±dzenie

source: usage:
pl: Sk³adnia:

source: NOTE: elvtune only works with 2.4 kernels
pl: :UWAGA: elvtune dzia³a tylko z j±drami 2.4

source: missing blockdevice, use -h for help
pl: brak urz±dzenia blokowego, -h wy¶wietli pomoc

source: elvtune is only useful on older kernels; for 2.6 use IO scheduler sysfs tunables instead..
pl: elvtune jest u¿yteczny tylko ze starszymi j±drami; dla j±der 2.6 nale¿y u¿yæ ustawieñ sysfs planisty I/O.

source: Formatting ...
pl: Formatowanie...

source: done
pl: zakoñczone

source: Verifying ...
pl: Weryfikacja...

source: cannot open file %s
pl: nie mo¿na otworzyæ pliku %s

source: Read:
pl: Odczyt:

source: Problem reading cylinder %d, expected %d, read %d
pl: Problem odczytu cylindra %d, oczekiwano %d, odczytano %d

source: bad data in cyl %d Continuing ...
pl: b³êdne dane na cylindrze %d Kontynuacja...

source: Usage: %s [options] device
pl: Sk³adnia: %s [opcje] urz±dzenie

source: Options: -n, --no-verify disable the verification after the format -V, --version output version information and exit -h, --help display this help and exit
pl: Opcje: -n, --no-verify wy³±czenie weryfikacji po sformatowaniu -V, --version wypisanie informacji o wersji i zakoñczenie -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: %s from %s
pl: %s z pakietu %s

source: cannot stat file %s
pl: nie mo¿na wykonaæ stat na pliku %s

source: %s: not a block device
pl: %s: nie jest urz±dzeniem blokowym

source: cannot access file %s
pl: nie mo¿na dostaæ siê do pliku %s

source: Could not determine current format type
pl: Nie mo¿na okre¶liæ rodzaju aktualnego formatu

source: %s-sided, %d tracks, %d sec/track. Total capacity %d kB.
pl: %sstronne, %d ¶cie¿ek, %d sekt./¶cie¿kê. £±czna pojemno¶æ %d kB.

source: Double
pl: Dwu

source: Single
pl: Jedno

source: usage: %s [-hv] [-x dir] file -h print this help -x dir extract into dir -v be more verbose file file to test
pl: Sk³adnia: %s [-hv] [-x katalog] plik -h wy¶wietlenie tego opisu -x katalog rozpakowanie do katalogu -v wiêksza liczba komunikatów plik plik do sprawdzenia

source: stat failed: %s
pl: stat nie powiod³o siê: %s

source: open failed: %s
pl: otwarcie nie powiod³o siê: %s

source: ioctl failed: unable to determine device size: %s
pl: ioctl nie powiod³o siê: nie mo¿na okre¶liæ rozmiaru urz±dzenia: %s

source: not a block device or file: %s
pl: nie jest to urz±dzenie blokowe ani plik: %s

source: file length too short
pl: d³ugo¶æ pliku zbyt ma³a

source: read failed: %s
pl: odczyt nie powiód³ siê: %s

source: superblock magic not found
pl: nie znaleziono liczby magicznej superbloku

source: cramfs endianness is %s
pl: kolejno¶æ bajtów w s³owie cramfs to %s

source: big
pl: big-endian

source: little
pl: little-endian

source: unsupported filesystem features
pl: nieobs³ugiwane cechy systemu plików

source: superblock size (%d) too small
pl: rozmiar superbloku (%d) zbyt ma³y

source: zero file count
pl: zerowa liczba plików

source: warning: file extends past end of filesystem
pl: uwaga: plik wychodzi poza koniec systemu plików

source: warning: old cramfs format
pl: uwaga: stary format cramfs

source: unable to test CRC: old cramfs format
pl: nie mo¿na sprawdziæ CRC: stary format cramfs

source: crc error
pl: b³±d CRC

source: root inode is not directory
pl: g³ówny i-wêze³ nie jest katalogiem

source: bad root offset (%lu)
pl: b³êdny offset g³ównego katalogu (%lu)

source: data block too large
pl: blok danych zbyt du¿y

source: decompression error %p(%d): %s
pl: b³±d dekompresji %p(%d): %s

source: hole at %ld (%zd)
pl: dziura pod %ld (%zd)

source: uncompressing block at %ld to %ld (%ld)
pl: dekompresja bloku pod %ld do %ld (%ld)

source: non-block (%ld) bytes
pl: nie blok (%ld bajtów)

source: non-size (%ld vs %ld) bytes
pl: b³êdny rozmiar (%ld vs %ld bajtów)

source: write failed: %s
pl: zapis nie powiód³ siê: %s

source: lchown failed: %s
pl: lchown nie powiod³o siê: %s

source: chown failed: %s
pl: chown nie powiod³o siê: %s

source: utime failed: %s
pl: utime nie powiod³o siê: %s

source: directory inode has zero offset and non-zero size: %s
pl: i-wêze³ katalogu ma zerowy offset i niezerowy rozmiar: %s

source: mkdir failed: %s
pl: mkdir nie powiod³o siê: %s

source: filename length is zero
pl: zerowa d³ugo¶æ nazwy pliku

source: bad filename length
pl: b³êdna d³ugo¶æ nazwy pliku

source: bad inode offset
pl: b³êdny offset i-wêz³a

source: file inode has zero offset and non-zero size
pl: i-wêze³ pliku ma zerowy offset i niezerowy rozmiar

source: file inode has zero size and non-zero offset
pl: i-wêze³ pliku ma zerowy rozmiar i niezerowy offset

source: symbolic link has zero offset
pl: dowi±zanie symboliczne ma zerowy offset

source: symbolic link has zero size
pl: dowi±zanie symboliczne ma zerowy rozmiar

source: size error in symlink: %s
pl: b³±d rozmiaru dowi±zania symbolicznego: %s

source: symlink failed: %s
pl: symlink nie powiod³o siê: %s

source: special file has non-zero offset: %s
pl: plik specjalny ma niezerowy offset: %s

source: fifo has non-zero size: %s
pl: fifo ma niezerowy rozmiar: %s

source: socket has non-zero size: %s
pl: gniazdo ma niezerowy rozmiar: %s

source: bogus mode: %s (%o)
pl: b³êdny tryb: %s (%o)

source: mknod failed: %s
pl: mknod nie powiod³o siê: %s

source: directory data start (%ld) < sizeof(struct cramfs_super) + start (%ld)
pl: pocz±tek danych katalogu (%ld) < sizeof(struct cramfs_super) + start (%ld)

source: directory data end (%ld) != file data start (%ld)
pl: koniec danych katalogu (%ld) != pocz±tek danych pliku (%ld)

source: invalid file data offset
pl: niepoprawny offset danych pliku

source: compiled without -x support
pl: skompilowano bez obs³ugi -x

source: Usage: %s [-larvsmf] /dev/name
pl: U¿ycie: %s [-larvsmf] /dev/name

source: %s is mounted.
pl: %s jest zamontowane.

source: Do you really want to continue
pl: Czy na pewno chcesz kontynuowaæ

source: check aborted.
pl: sprawdzanie przerwane.

source: Zone nr < FIRSTZONE in file `%s'.
pl: Strefa nr < FIRSTZONE w pliku `%s'.

source: Zone nr >= ZONES in file `%s'.
pl: Strefa nr >= ZONES w pliku `%s'.

source: Remove block
pl: Usun±æ blok

source: Read error: unable to seek to block in file '%s'
pl: B³±d odczytu: nie uda³o siê ustawiæ na blok w pliku '%s'

source: Read error: bad block in file '%s'
pl: B³±d odczytu: wadliwy blok w pliku '%s'

source: Internal error: trying to write bad block Write request ignored
pl: B³±d wewnêtrzny: próba zapisu wadliwego bloku ¯±danie zapisu zignorowane

source: seek failed in write_block
pl: przemieszczenie nie powiod³o siê we write_block

source: Write error: bad block in file '%s'
pl: B³±d zapisu: wadliwy blok w pliku '%s'

source: seek failed in write_super_block
pl: przemieszczenie nie powiod³o siê we write_super_block

source: unable to write super-block
pl: nie uda³o siê zapisaæ superbloku

source: Unable to write inode map
pl: Nie mo¿na zapisaæ mapy i-wêz³ów

source: Unable to write zone map
pl: Nie mo¿na zapisaæ mapy stref

source: Unable to write inodes
pl: Nie mo¿na zapisaæ i-wêz³ów

source: seek failed
pl: przemieszczenie nie powiod³o siê

source: unable to alloc buffer for superblock
pl: nie uda³o siê przydzieliæ bufora dla superbloku

source: unable to read super block
pl: nie mo¿na odczytaæ superbloku

source: bad magic number in super-block
pl: b³êdna liczba magiczna w superbloku

source: Only 1k blocks/zones supported
pl: Wspierane s± tylko bloki/strefy 1k

source: bad s_imap_blocks field in super-block
pl: b³êdne pole s_imap_blocks w superbloku

source: bad s_zmap_blocks field in super-block
pl: b³êdne pole s_zmap_blocks w superbloku

source: Unable to allocate buffer for inode map
pl: Nie mo¿na przydzieliæ bufora dla mapy i-wêz³ów

source: Unable to allocate buffer for zone map
pl: Nie mo¿na przydzieliæ bufora dla mapy stref

source: Unable to allocate buffer for inodes
pl: Nie mo¿na przydzieliæ bufora dla i-wêz³ów

source: Unable to allocate buffer for inode count
pl: Nie mo¿na przydzieliæ bufora dla licznika i-wêz³ów

source: Unable to allocate buffer for zone count
pl: Nie mo¿na przydzieliæ bufora dla licznika stref

source: Unable to read inode map
pl: Nie mo¿na odczytaæ mapy i-wêz³ów

source: Unable to read zone map
pl: Nie mo¿na odczytaæ mapy stref

source: Unable to read inodes
pl: Nie mo¿na odczytaæ i-wêz³ów

source: Warning: Firstzone != Norm_firstzone
pl: Uwaga: Firstzone != Norm_firstzone

source: %ld inodes
pl: %ld i-wêz³ów

source: %ld blocks
pl: %ld bloków

source: Filesystem state=%d
pl: Stan systemu plików=%d

source: Inode %d marked unused, but used for file '%s'
pl: I-wêze³ %d oznaczono jako nieu¿ywany ale jest on u¿ywany przez plik '%s'

source: Mark in use
pl: Znacznik w u¿yciu

source: The file `%s' has mode %05o
pl: Plik `%s' ma tryb %05o

source: Warning: inode count too big.
pl: Uwaga: liczba i-wêz³ów za du¿a.

source: root inode isn't a directory
pl: g³ówny i-wêze³ nie jest katalogiem

source: Block has been used before. Now in file `%s'.
pl: Blok by³ wcze¶niej u¿yty. Obecnie w pliku `%s'.

source: Clear
pl: Wyczy¶ciæ

source: Block %d in file `%s' is marked not in use.
pl: Blok %d w pliku `%s' jest oznaczony jako nieu¿ywany.

source: Correct
pl: Naprawiæ

source: The directory '%s' contains a bad inode number for file '%.*s'.
pl: Katalog '%s' zawiera b³êdny numer i-wêz³a dla pliku '%.*s'.

source: Remove
pl: Usun±æ

source: %s: bad directory: '.' isn't first
pl: %s: b³êdny katalog: '.' nie jest na pocz±tku

source: %s: bad directory: '..' isn't second
pl: %s: b³êdny katalog: '..' nie jest na drugiej pozycji

source: internal error
pl: b³±d wewnêtrzny

source: %s: bad directory: size < 32
pl: %s: b³êdny katalog: rozmiar < 32

source: seek failed in bad_zone
pl: przemieszczenie nie powiod³o siê w bad_zone

source: Inode %lu mode not cleared.
pl: Tryb i-wêz³a %lu nie wyczyszczony.

source: Inode %lu not used, marked used in the bitmap.
pl: I-wêze³ %lu jest nieu¿ywany, a zaznaczony jako u¿ywany w mapie bitowej.

source: Inode %lu used, marked unused in the bitmap.
pl: I-wêze³ %lu jest u¿ywany, a zaznaczony jako nieu¿ywany w mapie bitowej.

source: Set
pl: Ustawiæ

source: Inode %lu (mode = %07o), i_nlinks=%d, counted=%d.
pl: I-wêze³ %lu (tryb = %07o), i_nlinks=%d, obliczono=%d.

source: Set i_nlinks to count
pl: Ustawienie i_nlinks na liczbê obliczon±

source: Zone %lu: marked in use, no file uses it.
pl: Strefa %lu: zaznaczona jako u¿ywana, a ¿aden plik jej nie u¿ywa.

source: Unmark
pl: Odznaczyæ

source: Zone %lu: in use, counted=%d
pl: Strefa %lu: u¿ywana, naliczono=%d

source: Zone %lu: not in use, counted=%d
pl: Strefa %lu: nie u¿ywana, naliczono=%d

source: bad inode size
pl: b³êdny rozmiar i-wêz³a

source: bad v2 inode size
pl: b³êdny rozmiar i-wêz³a v2

source: need terminal for interactive repairs
pl: do interakcyjnej naprawy potrzebny jest terminal

source: unable to open '%s': %s
pl: nie mo¿na otworzyæ '%s': %s

source: %s is clean, no check.
pl: %s jest czysty, bez sprawdzania.

source: Forcing filesystem check on %s.
pl: Wymuszenie sprawdzanie systemu plików na %s.

source: Filesystem on %s is dirty, needs checking.
pl: System plików %s nie jest czysty, wymaga sprawdzenia.

source: %6ld inodes used (%ld%%)
pl: %6ld u¿ywanych i-wêz³ów (%ld%%)

source: %6ld zones used (%ld%%)
pl: %6ld u¿ywanych stref (%ld%%)

source: %6d regular files %6d directories %6d character device files %6d block device files %6d links %6d symbolic links ------ %6d files
pl: %6d zwyk³ych plików %6d katalogów %6d plików urz±dzeñ znakowych %6d plików urz±dzeñ blokowych %6d dowi±zañ %6d dowi±zañ symbolicznych ------ %6d plików

source: ---------------------------- FILE SYSTEM HAS BEEN CHANGED ----------------------------
pl: --------------------------- ZMODYFIKOWANO SYSTEM PLIKÓW ---------------------------

source: failed to open %s
pl: nie uda³o siê otworzyæ: %s

source: seek error on %s
pl: b³±d przemieszczania po %s

source: read error on %s
pl: b³±d odczytu %s

source: sector count: %d, sector size: %d
pl: liczba sektorów: %d, rozmiar sektora: %d

source: Usage: %s [options] iso9660_image_file
pl: Sk³adnia: %s [opcje] plik_obrazu_iso9660

source: Options: -d, --divisor=NUM devide bytes NUM -x, --sectors show sector count and size -V, --version output version information and exit -H, --help display this help and exit
pl: Opcje: -d, --divisor=LICZBA podzielenie liczby bajtów przez LICZBÊ -x, --sectors wypisanie liczby sektorów i ich rozmiaru -V, --version wypisanie informacji o wersji i zakoñczenie -H, --help wy¶wietlenie tego opisu i zakoñczenie

source: invalid divisor argument
pl: b³êdny podzielnik

source: Usage: %s [options] device [block-count]
pl: Sk³adnia: %s [opcje] urz±dzenie [liczba-bloków]

source: Options: -N, --inodes=NUM specify desired number of inodes -V, --vname=NAME specify volume name -F, --fname=NAME specify file system name -v, --verbose explain what is being done -c this option is silently ignored -l this option is silently ignored -V, --version output version information and exit -V as version must be only option -h, --help display this help and exit
pl: Opcje: -N, --inodes=ILE okre¶lenie po¿±danej liczby i-wêz³ów -V, --vname=NAZWA okre¶lenie nazwy wolumenu -F, --fname=NAZWA okre¶lenie nazwy systemu plików -v, --verbose wyja¶nianie wykonywanych czynno¶ci -c opcja po cichu ignorowana -l opcja po cichu ignorowana -V, --version wypisanie informacji o wersji i zakoñczenie -V jako wersja musi byæ jedyn± opcj± -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: invalid number of inodes
pl: b³êdna liczba i-wêz³ów

source: volume name too long
pl: nazwa woluminu za d³uga

source: fsname name too long
pl: nazwa systemu plików za d³uga

source: cannot stat device %s
pl: nie mo¿na wykonaæ stat na urz±dzeniu %s

source: %s is not a block special device
pl: %s nie jest specjalnym urz±dzeniem blokowym

source: invalid block-count
pl: b³êdna liczba bloków

source: cannot get size of %s
pl: nie mo¿na pobraæ rozmiaru %s

source: blocks argument too large, max is %llu
pl: argument liczba-bloków za du¿y, maksimum to %llu

source: too many inodes - max is 512
pl: za du¿o i-wêz³ów - maksimum to 512

source: not enough space, need at least %llu blocks
pl: za ma³o miejsca, potrzeba co najmniej %llu bloków

source: Device: %s
pl: Urz±dzenie: %s

source: Volume: <%-6s>
pl: Wolumin: <%-6s>

source: FSname: <%-6s>
pl: NazwaFS: <%-6s>

source: BlockSize: %d
pl: RozmiarBloku: %d

source: Inodes: %lu (in 1 block)
pl: I-wêz³ów: %lu (w 1 bloku)

source: Inodes: %lu (in %llu blocks)
pl: I-wêz³ów: %lu (w blokach: %llu)

source: Blocks: %lld
pl: Bloków: %lld

source: Inode end: %d, Data end: %d
pl: Koniec i-wêz³ów: %d, Koniec danych: %d

source: error writing superblock
pl: b³±d zapisu superbloku

source: error writing root inode
pl: b³±d zapisu g³ównego i-wêz³a

source: error writing inode
pl: b³±d zapisu i-wêz³a

source: seek error
pl: b³±d przemieszczania

source: error writing . entry
pl: b³±d zapisu wpisu '.'

source: error writing .. entry
pl: b³±d zapisu wpisu '..'

source: error closing %s
pl: b³±d zamykania %s

source: Usage: %s [options] [-t type fs-options] device [size]
pl: Sk³adnia: %s [opcje] [-t typ opcje-fs] urz±dzenie [rozmiar]

source: Options: -t, --type=TYPE file system type, when undefined ext2 is used fs-options parameters to real file system builder device path to a device size number of blocks on the device -V, --verbose explain what is done defining -V more than once will cause a dry-run -V, --version output version information and exit -V as version must be only option -h, --help display this help and exit
pl: Opcje: -t, --type=TYP typ systemu plików; domy¶lnie u¿ywany jest ext2 opcje-fs parametry faktycznego programu tworz±cego system plików urz±dzenie ¶cie¿ka do urz±dzenia rozmiar liczba bloków na urz±dzeniu -V, --verbose wyja¶nianie wykonywanych czynno¶ci wiêksza liczba -V spowoduje uruchomienie bez faktycznej akcji -V, --version wypisanie informacji o wersji i zakoñczenie -V jako wersja musi byæ jedyn± opcj± -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: For more information see mkfs(8).
pl: Wiêcej informacji w mkfs(8).

source: usage: %s [-h] [-v] [-b blksize] [-e edition] [-N endian] [-i file] [-n name] dirname outfile -h print this help -v be verbose -E make all warnings errors (non-zero exit status) -b blksize use this blocksize, must equal page size -e edition set edition number (part of fsid) -N endian set cramfs endianness (big|little|host), default host -i file insert a file image into the filesystem (requires >= 2.4.0) -n name set name of cramfs filesystem -p pad by %d bytes for boot code -s sort directory entries (old option, ignored) -z make explicit holes (requires >= 2.3.39) dirname root of the filesystem to be compressed outfile output file
pl: Sk³adnia: %s [-h] [-v] [-b rozmbloku] [-e edycja] [-N endian] [-i plik] [-n nazwa] katalog plikwy -h wy¶wietlenie tego opisu -v wiêksza liczba komunikatów -E uczynienie wszystkich ostrze¿eñ b³êdami (niezerowy kod wyj¶cia) -b rozmbloku u¿ycie tego rozmiaru bloku, musi byæ równy rozmiarowi strony -e edycja ustawienie numeru edycji (czê¶æ fsida) -N endian kolejno¶æ bajtów w s³owie (big|little|host), domy¶lnie host -i plik wstawienie obrazu pliku do systemu plików (wymaga >= 2.4.0) -n nazwa ustawienie nazwy systemu plików cramfs -p wyrównanie do %d bajtów dla kodu rozruchowego -s sortowanie wpisów w katalogu (stara opcja, ignorowana) -z tworzenie jawnych dziur (wymaga >= 2.3.39) katalog g³ówny katalog systemu plików do kompresji plikwy plik wyj¶ciowy

source: could not read directory %s
pl: nie uda³o siê odczytaæ katalogu %s

source: Very long (%zu bytes) filename `%s' found. Please increase MAX_INPUT_NAMELEN in mkcramfs.c and recompile. Exiting.
pl: Znaleziono bardzo d³ug± nazwê pliku (%zu bajtów) `%s'. Proszê zwiêkszyæ MAX_INPUT_NAMELEN w mkcramfs.c i przekompilowaæ. Zakoñczenie.

source: filesystem too big. Exiting.
pl: system plików za du¿y. Zakoñczenie.

source: AIEEE: block "compressed" to > 2*blocklength (%ld)
pl: A£AAA: blok "skompresowany" do 2*d³ugo¶æ bloku (%ld)

source: %6.2f%% (%+ld bytes) %s
pl: %6.2f%% (%+ld bajtów) %s

source: cannot close file %s
pl: nie mo¿na zamkn±æ pliku '%s'

source: failed to parse blocksize argument
pl: nie uda³o siê przeanalizowaæ argumentu rozmiaru bloku

source: edition number argument failed
pl: b³±d argumentu liczbowego edycji

source: invalid endianness given. Must be 'big', 'little', or 'host'
pl: podano b³êdn± kolejno¶æ bajtów w s³owie. Musi byæ jedn± z 'big', 'little' lub 'host'

source: cannot stat %s
pl: nie mo¿na wykonaæ stat na %s

source: warning: guestimate of required size (upper bound) is %lldMB, but maximum image size is %uMB. We might die prematurely.
pl: uwaga: szacowany wymagany rozmiar (górna granica) to %lldMB, ale maksymalny rozmiar obrazu to %uMB. Program mo¿e zgin±æ przedwcze¶nie.

source: ROM image map
pl: Mapa obrazu ROM

source: Including: %s
pl: Do³±czanie: %s

source: Directory data: %zd bytes
pl: Dane katalogu: %zd bajtów

source: Everything: %zd kilobytes
pl: £±cznie: %zd kilobajtów

source: Super block: %zd bytes
pl: Superblock: %zd bajtów

source: not enough space allocated for ROM image (%lld allocated, %zu used)
pl: przydzielono za ma³o miejsca na obraz ROM (przydzielono %lld, u¿yto %zu)

source: ROM image
pl: obraz ROM

source: ROM image write failed (%zd %zd)
pl: b³±d zapisu obrazu ROM (%zd %zd)

source: warning: filenames truncated to 255 bytes.
pl: uwaga: nazwy plików skrócone do 255 bajtów.

source: warning: files were skipped due to errors.
pl: uwaga: pominiêto pliki z powodu b³êdów.

source: warning: file sizes truncated to %luMB (minus 1 byte).
pl: uwaga: zmniejszono rozmiary plików do %luMB (minus 1 bajt).

source: warning: uids truncated to %u bits. (This may be a security concern.)
pl: uwaga: uidy skrócone do %u bitów (mo¿e to rzutowaæ na bezpieczeñstwo).

source: warning: gids truncated to %u bits. (This may be a security concern.)
pl: uwaga: gidy skrócone do %u bitów (mo¿e to rzutowaæ na bezpieczeñstwo).

source: WARNING: device numbers truncated to %u bits. This almost certainly means that some device files will be wrong.
pl: UWAGA: numery urz±dzeñ skrócone do %u bitów. Prawie na pewno oznacza to, ¿e które¶ pliku urz±dzeñ bêd± niew³a¶ciwe.

source: Usage: %s [-c | -l filename] [-nXX] [-iXX] /dev/name [blocks]
pl: Sk³adnia: %s [-c | -l plik] [-nXX] [-iXX] /dev/nazwa [bloki]

source: %s is mounted; will not make a filesystem here!
pl: %s jest zamontowany; odmowa utworzenia tam systemu plików!

source: %s: seek to boot block failed in write_tables
pl: %s: przemieszczenie na blok rozruchowy nie powiod³o siê we write_tables

source: %s: unable to clear boot sector
pl: %s: nie uda³o siê wyczy¶ciæ sektora rozruchowego

source: %s: seek failed in write_tables
pl: %s: przemieszczenie nie powiod³o siê we write_tables

source: %s: unable to write super-block
pl: %s: nie uda³o siê zapisaæ superbloku

source: %s: unable to write inode map
pl: %s: nie uda³o siê zapisaæ mapy i-wêz³ów

source: %s: unable to write zone map
pl: %s: nie uda³o siê zapisaæ mapy stref

source: %s: unable to write inodes
pl: %s: nie uda³o siê zapisaæ i-wêz³ów

source: %s: seek failed in write_block
pl: %s: przemieszczenie nie powiod³o siê we write_block

source: %s: write failed in write_block
pl: %s: zapis nie powiód³ siê we write_block

source: %s: too many bad blocks
pl: %s: zbyt du¿o wadliwych bloków

source: %s: not enough good blocks
pl: %s: zbyt ma³o dobrych bloków

source: %s: unable to alloc buffer for superblock
pl: %s: nie uda³o siê przydzieliæ bufora dla superbloku

source: %s: unable to allocate buffers for maps
pl: %s: nie uda³o siê przydzieliæ buforów dla map
