Repository: RMerl/asuswrt-merlin
Catalog: release/src/router/util-linux/po/*.po
Languages: pl

source: There is a valid AIX label on this disk. Unfortunately Linux cannot handle these disks at the moment. Nevertheless some advice: 1. fdisk will destroy its contents on write. 2. Be sure that this disk is NOT a still vital part of a volume group. (Otherwise you may erase the other disks as well, if unmirrored.) 3. Before deleting this physical volume be sure to remove the disk logically from your AIX machine. (Otherwise you become an AIXpert).
pl: Na tym dysku istnieje poprawna etykieta typu AIX. Niestety Linux nie obecnie nie potrafi obs³u¿yæ takich dysków. Tym niemniej kilka uwag: 1. fdisk zniszczy jej zawarto¶æ przy zapisie. 2. Nale¿y siê upewniæ, ¿e ten dysk NIE pozostaje aktywn± czê¶ci± ¿adnej grupy wolumenów (w przeciwnym wypadku mo¿na usun±æ tak¿e zawarto¶æ innych dysków, je¶li nie maj± kopii). 3. Przed usuwaniem tego wolumenu fizycznego nale¿y siê upewniæ, ¿e dysk logiczny zosta³ usuniêty pod AIX-em (w przeciwnym wypadku mo¿na zostaæ AIXpertem).

source: BSD label for device: %s
pl: Etykieta BSD dla urz±dzenia: %s

source: Command action
pl: Polecenie

source: d delete a BSD partition
pl: d usuniêcie partycji BSD

source: e edit drive data
pl: e edycja danych urz±dzenia

source: i install bootstrap
pl: i zainstalowanie kodu rozruchowego

source: l list known filesystem types
pl: l wypisanie znanych typów systemów plików

source: m print this menu
pl: m wy¶wietlenie tego menu

source: n add a new BSD partition
pl: n dodanie nowej partycji BSD

source: p print BSD partition table
pl: p wypisanie tablicy partycji BSD

source: q quit without saving changes
pl: q zakoñczenie bez zapisywania zmian

source: r return to main menu
pl: r powrót do g³ównego menu

source: s show complete disklabel
pl: s wypisanie ca³ej etykiety dysku

source: t change a partition's filesystem id
pl: t zmiana ID systemu plików partycji

source: u change units (cylinders/sectors)
pl: u zmiana jednostek (cylindry/sektory)

source: w write disklabel to disk
pl: w zapisanie etykiety na dysk

source: x link BSD partition to non-BSD partition
pl: x po³±czenie partycji BSD z partycj± nie-BSD

source: Partition %s has invalid starting sector 0.
pl: Partycja %s ma niepoprawny sektor pocz±tkowy 0.

source: Reading disklabel of %s at sector %d.
pl: Odczyt etykiety dysku %s w sektorze %d.

source: There is no *BSD partition on %s.
pl: Na %s nie ma partycji *BSD.

source: BSD disklabel command (m for help):
pl: Polecenie dla etykiety dysku BSD (m wy¶wietla pomoc):

source: First %s
pl: Pierwszy %s

source: Last %s or +size or +sizeM or +sizeK
pl: Ostatni %s albo +rozmiar, +rozmiarM lub +rozmiarK

source: type: %s
pl: typ: %s

source: type: %d
pl: typ: %d

source: disk: %.*s
pl: dysk: %.*s

source: label: %.*s
pl: etykieta: %.*s

source: flags:
pl: flagi

source: removable
pl: wyjmowalny

source: badsect
pl: wadliwe

source: bytes/sector: %ld
pl: bajtów/sektor: %ld

source: sectors/track: %ld
pl: sektorów/¶cie¿kê: %ld

source: tracks/cylinder: %ld
pl: ¶cie¿ek/cylinder: %ld

source: sectors/cylinder: %ld
pl: sektorów/cylinder: %ld

source: cylinders: %ld
pl: cylindrów: %ld

source: rpm: %d
pl: obr./min: %d

source: interleave: %d
pl: przeplot: %d

source: trackskew: %d
pl: przesuniêcie dla ¶cie¿ki: %d

source: cylinderskew: %d
pl: przesuniêcie dla cylindra: %d

source: headswitch: %ld # milliseconds
pl: zmiana g³owicy: %ld # milisekund

source: track-to-track seek: %ld # milliseconds
pl: zmiana ¶cie¿ki: %ld # milisekund

source: drivedata:
pl: dane urz±dzenia:

source: %d partitions:
pl: %d partycji:

source: # start end size fstype [fsize bsize cpg]
pl: # pocz±tek koniec rozmiar typ FS [r.fr. r.blk. c/g]

source: Writing disklabel to %s.
pl: Zapis etykiety dysku na %s.

source: %s contains no disklabel.
pl: %s nie zawiera etykiety dysku.

source: Do you want to create a disklabel? (y/n)
pl: Utworzyæ etykietê dysku? (y/n)

source: bytes/sector
pl: bajtów/sektor

source: sectors/track
pl: sektorów/¶cie¿kê

source: tracks/cylinder
pl: ¶cie¿ek/cylinder

source: cylinders
pl: cylindrów

source: sectors/cylinder
pl: sektorów/cylinder

source: Must be <= sectors/track * tracks/cylinder (default).
pl: Musi byæ <= sektorów/¶cie¿kê * ¶cie¿ek/cylinder (domy¶lnie).

source: rpm
pl: obr./min

source: interleave
pl: przeplot

source: trackskew
pl: przesuniêcie dla ¶cie¿ki

source: cylinderskew
pl: przesuniêcie dla cylindra

source: headswitch
pl: zmiana g³owicy

source: track-to-track seek
pl: zmiana ¶cie¿ki

source: Bootstrap: %sboot -> boot%s (%s):
pl: Kod rozruchowy: %sboot -> boot%s (%s):

source: Bootstrap overlaps with disk label!
pl: Kod rozruchowy zachodzi na etykietê dysku!

source: Bootstrap installed on %s.
pl: Zainstalowano kod rozruchowy na %s.

source: Partition (a-%c):
pl: Partycja (a-%c):

source: The maximum number of partitions has been created
pl: Utworzono ju¿ maksymaln± liczbê partycji

source: This partition already exists.
pl: Ta partycja ju¿ istnieje.

source: Warning: too many partitions (%d, maximum is %d).
pl: Uwaga: za du¿o partycji (%d, maksimum to %d).

source: Syncing disks.
pl: Synchronizacja dysków.

source: Usage: %1$s [options] <disk> change partition table %1$s [options] -l <disk> list partition table(s) %1$s -s <partition> give partition size(s) in blocks Options: -b <size> sector size (512, 1024, 2048 or 4096) -c[=<mode>] compatible mode: 'dos' or 'nondos' (default) -h print this help text -u[=<unit>] display units: 'cylinders' or 'sectors' (default) -v print program version -C <number> specify the number of cylinders -H <number> specify the number of heads -S <number> specify the number of sectors per track
pl: Sk³adnia: %1$s [opcje] <dysk> zmiana tablicy partycji %1$s [opcje] -l <dysk> wypisanie tablic(y) partycji %1$s -s <partycja> przekazanie rozmiaru partycji w blokach Opcje: -b <rozmiar> rozmiar bloku (512, 1024, 2048 lub 4096) -c[=<tryb>] tryb kompatybilno¶ci: 'dos' lub 'nondos' (domy¶lny) -h wy¶wietlenie opisu -u[=<jednostka>] jednostki wy¶w.: 'cylinders' lub 'sectors' (domy¶lne) -v wy¶wietlenie wersji -C <liczba> przekazanie liczby cylindrów -H <liczba> przekazanie liczby g³owic -S <liczba> przekazanie liczby sektorów na ¶cie¿ce

source: unable to open %s
pl: nie mo¿na otworzyæ %s

source: unable to read %s
pl: nie mo¿na odczytaæ %s

source: unable to seek on %s
pl: nie mo¿na zmieniæ pozycji na %s

source: unable to write %s
pl: nie mo¿na zapisaæ %s

source: BLKGETSIZE ioctl failed on %s
pl: ioctl BLKGETSIZE nie powiód³ siê na %s

source: fatal error
pl: b³±d krytyczny

source: a toggle a read only flag
pl: a zmiana flagi tylko do odczytu

source: b edit bsd disklabel
pl: b modyfikacja etykiety dysku BSD

source: c toggle the mountable flag
pl: c zmiana flagi montowalno¶ci

source: d delete a partition
pl: d usuniêcie partycji

source: l list known partition types
pl: l wypisanie znanych typów partycji

source: n add a new partition
pl: n dodanie nowej partycji

source: o create a new empty DOS partition table
pl: o utworzenie nowej, pustej DOS-owej tablicy partycji

source: p print the partition table
pl: p wypisanie tablicy partycji

source: s create a new empty Sun disklabel
pl: s utworzenie nowej, pustej etykiety dysku Suna

source: t change a partition's system id
pl: t zmiana ID systemu partycji

source: u change display/entry units
pl: u zmiana jednostek wy¶wietlania/wprowadzania

source: v verify the partition table
pl: v weryfikacja tablicy partycji

source: w write table to disk and exit
pl: w zapis tablicy partycji na dysk i zakoñczenie

source: x extra functionality (experts only)
pl: x dodatkowe funkcje (tylko dla ekspertów)

source: a select bootable partition
pl: a wybór partycji rozruchowej

source: b edit bootfile entry
pl: b edycja wpisu pliku rozruchowego

source: c select sgi swap partition
pl: c wybór partycji wymiany SGI

source: a toggle a bootable flag
pl: a zmiana flagi rozruchu

source: c toggle the dos compatibility flag
pl: c zmiana flagi kompatybilno¶ci z DOS-em

source: a change number of alternate cylinders
pl: a zmiana liczby zmiennych cylindrów

source: c change number of cylinders
pl: c zmiana liczby cylindrów

source: d print the raw data in the partition table
pl: d wypisanie surowych danych tablicy partycji

source: e change number of extra sectors per cylinder
pl: e zmiana liczby dodatkowych sektorów na cylinder

source: h change number of heads
pl: h zmiana liczby g³owic

source: i change interleave factor
pl: i zmiana wspó³czynnika przeplotu

source: o change rotation speed (rpm)
pl: o zmiana prêdko¶ci obrotowej (obr./min)

source: s change number of sectors/track
pl: s zmiana liczby sektorów na ¶cie¿kê

source: y change number of physical cylinders
pl: y zmiana liczby fizycznych cylindrów

source: b move beginning of data in a partition
pl: b przesuniêcie pocz±tku danych na partycji

source: e list extended partitions
pl: e wypisanie partycji rozszerzonych

source: g create an IRIX (SGI) partition table
pl: g utworzenie tablicy partycji typu IRIX (SGI)

source: f fix partition order
pl: f poprawienie kolejno¶ci partycji

source: i change the disk identifier
pl: i zmiana identyfikatora dysku

source: You must set
pl: Trzeba wprowadziæ liczbê

source: heads
pl: g³owic

source: sectors
pl: sektorów

source: %s%s. You can do this from the extra functions menu.
pl: %s%s. Mo¿na to zrobiæ z poziomu menu funkcji dodatkowych.

source: and
pl: oraz

source: WARNING: The size of this disk is %d.%d TB (%llu bytes). DOS partition table format can not be used on drives for volumes larger than (%llu bytes) for %d-byte sectors. Use parted(1) and GUID partition table format (GPT).
pl: UWAGA: rozmiar tego dysku to %d.%d TB (%llu bajtów). DOS-owy format tablicy partycji nie mo¿e byæ u¿ywany dla dysków na wolumenach wiêkszych ni¿ %llu bajtów dla %d-bajtowych sektorów. Nale¿y u¿yæ parted(1)a i formatu tablicy partycji GUID (GPT).

source: The device presents a logical sector size that is smaller than the physical sector size. Aligning to a physical sector (or optimal I/O) size boundary is recommended, or performance may be impacted.
pl: Urz±dzenie przedstawia logiczny rozmiar sektora mniejszy od rozmiaru fizycznego. Zaleca siê wyrównanie do granicy sektora fizycznego (lub optymalnego dla we/wy), w przeciwnym wypadku mo¿e to wp³yn±æ na wydajno¶æ.

source: WARNING: DOS-compatible mode is deprecated. It's strongly recommended to switch off the mode (with command 'c').
pl: UWAGA: tryb kompatybilno¶ci z DOS-em jest przestarza³y. Zdecydowanie zaleca siê wy³±czyæ ten tryb (polecenie 'c').

source: WARNING: cylinders as display units are deprecated. Use command 'u' to change units to sectors.
pl: UWAGA: cylindry jako jednostki wy¶wietlania s± przestarza³e. Lepiej u¿yæ polecenia 'u', aby zmieniæ jednostki na sektory.

source: Bad offset in primary extended partition
pl: B³êdny offset w g³ównej partycji rozszerzonej

source: Warning: omitting partitions after #%d. They will be deleted if you save this partition table.
pl: Uwaga: pominiêto partycje po #%d. Bêd± usuniête, je¶li tablica partycji zostanie zapisana.

source: Warning: extra link pointer in partition table %d
pl: Uwaga: nadmiarowy wska¼nik ³±cz±cy w tablicy partycji %d

source: Warning: ignoring extra data in partition table %d
pl: Uwaga: zignorowano nadmiarowe dane w tablicy partycji %d

source: omitting empty partition (%d)
pl: pominiêto pust± partycjê (%d)

source: Disk identifier: 0x%08x
pl: Identyfikator dysku: 0x%08x

source: New disk identifier (current 0x%08x):
pl: Nowy identyfikator dysku (bie¿±cy 0x%08x):

source: Building a new DOS disklabel with disk identifier 0x%08x. Changes will remain in memory only, until you decide to write them. After that, of course, the previous content won't be recoverable.
pl: Tworzenie nowej etykiety dysku typu DOS z identyfikatorem dysku 0x%08x. Zmiany pozostan± tylko w pamiêci do chwili ich zapisania. Potem, oczywi¶cie, poprzednia zawarto¶æ bêdzie nie do odzyskania.

source: Note: sector size is %d (not %d)
pl: Uwaga: rozmiar sektora to %d (nie %d)

source: You will not be able to write the partition table.
pl: Nie bêdzie mo¿na zapisaæ tablicy partycji.

source: This disk has both DOS and BSD magic. Give the 'b' command to go to BSD mode.
pl: Ten dysk ma znaczniki magiczne zarówno DOS-a, jak i BSD. Polecenie 'b' prze³±czy w tryb BSD.

source: Device contains neither a valid DOS partition table, nor Sun, SGI or OSF disklabel
pl: Urz±dzenie nie zawiera poprawnej DOS-owej tablicy partycji ani etykiety dysku Sun, SGI ani OSF

source: Internal error
pl: B³±d wewnêtrzny

source: Ignoring extra extended partition %d
pl: Zignorowano nadmiarow± partycjê rozszerzon± %d

source: Warning: invalid flag 0x%04x of partition table %d will be corrected by w(rite)
pl: Uwaga: niepoprawna flaga 0x%04x tablicy partycji %d bêdzie poprawiona przy zapisie (w)

source: Do you really want to quit?
pl: Czy na pewno zakoñczyæ program?

source: Hex code (type L to list codes):
pl: Kod szesnastkowy (L wy¶wietla listê):

source: %s (%u-%u, default %u):
pl: %s (%u-%u, domy¶lnie %u):

source: Unsupported suffix: '%s'.
pl: Nieobs³ugiwany przyrostek: '%s'.

source: Supported: 10^N: KB (KiloByte), MB (MegaByte), GB (GigaByte) 2^N: K (KibiByte), M (MebiByte), G (GibiByte)
pl: Obs³ugiwane: 10^N: KB (kilobajty), MB (megabajty), GB (gigabajty) 2^N: K (kibibajty), M (mebibajty), G (gibibajty)

source: Using default value %u
pl: Przyjêto warto¶æ domy¶ln± %u

source: Value out of range.
pl: Warto¶æ spoza zakresu.

source: Partition number
pl: Numer partycji

source: Warning: partition %d has empty type
pl: Uwaga: partycja %d ma pusty typ

source: Selected partition %d
pl: Wybrano partycjê %d

source: No partition is defined yet!
pl: Nie zdefiniowano jeszcze partycji!

source: All primary partitions have been defined already!
pl: Wszystkie g³ówne partycje zosta³y ju¿ zdefiniowane!

source: sector
pl: sektor

source: Changing display/entry units to cylinders (DEPRECATED!)
pl: Zmiana jednostek wy¶wietlania/wprowadzania na cylindry (PRZESTARZA£E!)

source: Changing display/entry units to sectors
pl: Zmiana jednostek wy¶wietlania/wprowadzania na sektory

source: WARNING: Partition %d is an extended partition
pl: UWAGA: partycja %d jest partycj± rozszerzon±

source: DOS Compatibility flag is set (DEPRECATED!)
pl: Flaga kompatybilno¶ci z DOS-em jest ustawiona (PRZESTARZA£E!)

source: DOS Compatibility flag is not set
pl: Flaga kompatybilno¶ci z DOS-em nie jest ustawiona

source: Partition %d does not exist yet!
pl: Partycja %d jeszcze nie istnieje!

source: Type 0 means free space to many systems (but not to Linux). Having partitions of type 0 is probably unwise. You can delete a partition using the `d' command.
pl: Typ 0 oznacza wolne miejsce dla wielu systemów (ale nie Linuksa). Posiadanie partycji typu 0 jest raczej niem±dre. Mo¿na usun±æ partycjê przy u¿yciu polecenia `d'.

source: You cannot change a partition into an extended one or vice versa Delete it first.
pl: Nie mo¿na zmieniæ istniej±cej partycji na rozszerzon± ani odwrotnie. Nale¿y j± najpierw usun±æ.

source: Consider leaving partition 3 as Whole disk (5), as SunOS/Solaris expects it and even Linux likes it.
pl: Najlepiej pozostawiæ partycjê 3 jako ca³y dysk (5), poniewa¿ tego oczekuje SunOS/Solaris i nawet Linux to lubi.

source: Consider leaving partition 9 as volume header (0), and partition 11 as entire volume (6), as IRIX expects it.
pl: Najlepiej pozostawiæ partycjê 9 jako nag³ówek wolumenu (0), a partycjê 11 jako ca³y wolumen (6), poniewa¿ tego oczekuje IRIX.

source: Changed system type of partition %d to %x (%s)
pl: Zmieniono typ systemu partycji %d na %x (%s)

source: System type of partition %d is unchanged: %x (%s)
pl: Typ systemu partycji %d nie zosta³ zmieniony: %x (%s)

source: Partition %d has different physical/logical beginnings (non-Linux?):
pl: Partycja %d ma ró¿ne pocz±tki fizyczny i logiczny (nie jest linuksowa?):

source: phys=(%d, %d, %d)
pl: fizyczny=(%d, %d, %d)

source: logical=(%d, %d, %d)
pl: logiczny=(%d, %d, %d)

source: Partition %d has different physical/logical endings:
pl: Partycja %d ma ró¿ne koñce fizyczny i logiczny:

source: Partition %i does not start on cylinder boundary:
pl: Partycja %i nie zaczyna siê na granicy cylindra:

source: should be (%d, %d, 1)
pl: powinno byæ (%d, %d, 1)

source: Partition %i does not end on cylinder boundary.
pl: Partycja %i nie koñczy siê na granicy cylindra.

source: should be (%d, %d, %d)
pl: powinno byæ (%d, %d, %d)

source: Partition %i does not start on physical sector boundary.
pl: Partycja %i nie zaczyna siê na granicy bloku fizycznego.

source: Disk %s: %ld MB, %lld bytes
pl: Dysk %s: %ld MB, bajtów: %lld

source: Disk %s: %ld.%ld GB, %llu bytes
pl: Dysk %s: %ld.%ld GB, bajtów: %llu

source: %d heads, %llu sectors/track, %d cylinders
pl: g³owic: %d, sektorów/¶cie¿kê: %llu, cylindrów: %d

source: , total %llu sectors
pl: , w sumie sektorów: %llu

source: Units = %s of %d * %d = %d bytes
pl: Jednostka = %s, czyli %d * %d = %d bajtów

source: Sector size (logical/physical): %u bytes / %lu bytes
pl: Rozmiar sektora (logiczny/fizyczny) w bajtach: %u / %lu

source: I/O size (minimum/optimal): %lu bytes / %lu bytes
pl: Rozmiar we/wy (minimalny/optymalny) w bajtach: %lu / %lu

source: Alignment offset: %lu bytes
pl: Wyrównanie w bajtach: %lu

source: Nothing to do. Ordering is correct already.
pl: Nie ma nic do zrobienia, kolejno¶æ ju¿ jest prawid³owa.

source: Done.
pl: Zakoñczone.

source: This doesn't look like a partition table Probably you selected the wrong device.
pl: Nie wygl±da to na tablicê partycji Prawdopodobnie wybrano niew³a¶ciwe urz±dzenie.

source: %*s Boot Start End Blocks Id System
pl: %*s Rozruch Pocz±tek Koniec Bloków ID System

source: Device
pl: Urz±dzenie

source: Partition table entries are not in disk order
pl: Wpisy w tablicy partycji nie s± w tej kolejno¶ci, co na dysku

source: Disk %s: %d heads, %llu sectors, %d cylinders
pl: Dysk %s: g³owic: %d, sektorów: %llu, cylindrów: %d

source: Nr AF Hd Sec Cyl Hd Sec Cyl Start Size ID
pl: Nr Fl G³ Sekt Cyl G³ Sekt Cyl Pocz±tek Rozm ID

source: Warning: partition %d contains sector 0
pl: Uwaga: partycja %d zawiera sektor 0

source: Partition %d: head %d greater than maximum %d
pl: Partycja %d: g³owica %d wiêksza ni¿ maksymalna %d

source: Partition %d: sector %d greater than maximum %llu
pl: Partycja %d: sektor %d wiêkszy ni¿ maksymalny %llu

source: Partitions %d: cylinder %d greater than maximum %d
pl: Partycja %d: cylinder %d wiêkszy ni¿ maksymalny %d

source: Partition %d: previous sectors %d disagrees with total %d
pl: Partycja %d: poprzednia liczba sektorów %d nie zgadza siê z ca³kowit± %d

source: Warning: bad start-of-data in partition %d
pl: Uwaga: b³êdny pocz±tek danych dla partycji %d

source: Warning: partition %d overlaps partition %d.
pl: Uwaga: partycja %d zachodzi na partycjê %d.

source: Warning: partition %d is empty
pl: Uwaga: partycja %d jest pusta

source: Logical partition %d not entirely in partition %d
pl: Partycja logiczna %d nie zawiera siê w pe³ni w partycji %d

source: Total allocated sectors %llu greater than the maximum %llu
pl: Ca³kowita liczba przydzielonych sektorów %llu jest wiêksza ni¿ maksymalna %llu

source: Remaining %lld unallocated %d-byte sectors
pl: Pozosta³o %lld nieprzydzielonych sektorów %d-bajtowych

source: Partition %d is already defined. Delete it before re-adding it.
pl: Partycja %d jest ju¿ zdefiniowana. Nale¿y j± usun±æ przed ponownym dodaniem.

source: Sector %llu is already allocated
pl: Sektor %llu jest ju¿ przydzielony

source: No free sectors available
pl: Nie ma ju¿ wolnych sektorów

source: Last %1$s, +%2$s or +size{K,M,G}
pl: Ostatni %1$s, +%2$s lub +rozmiar{K,M,G}

source: Adding logical partition %d
pl: Dodawanie partycji logicznej %d

source: Sorry - this fdisk cannot handle AIX disk labels. If you want to add DOS-type partitions, create a new empty DOS partition table first. (Use o.) WARNING: This will destroy the present disk contents.
pl: Niestety ta wersja fdiska nie obs³uguje etykiet dysku typu AIX. Aby dodaæ DOS-owe partycje, nale¿y najpierw utworzyæ pust± DOS-ow± tablicê partycji (poleceniem o). UWAGA: zniszczy to obecn± zawarto¶æ dysku.

source: Sorry - this fdisk cannot handle Mac disk labels. If you want to add DOS-type partitions, create a new empty DOS partition table first. (Use o.) WARNING: This will destroy the present disk contents.
pl: Niestety ta wersja fdiska nie obs³uguje etykiet dysku typu Mac. Aby dodaæ DOS-owe partycje, nale¿y najpierw utworzyæ pust± DOS-ow± tablicê partycji (poleceniem o). UWAGA: zniszczy to obecn± zawarto¶æ dysku.

source: All primary partitions are in use
pl: Wszystkie partycje g³ówne s± wykorzystane

source: If you want to create more than four partitions, you must replace a primary partition with an extended partition first.
pl: Aby utworzyæ wiêcej ni¿ cztery partycje, nale¿y najpierw zast±piæ jedn± partycjê g³ówn± partycj± rozszerzon±.

source: All logical partitions are in use
pl: Wszystkie partycje logiczne s± wykorzystane

source: Adding a primary partition
pl: Dodanie partycji g³ównej

source: Partition type: p primary (%d primary, %d extended, %d free) %s Select (default %c):
pl: Typ partycji: p g³ówna (g³ównych: %d, rozszerzonych: %d, wolnych: %d) %s Wybór (domy¶lne %c):

source: l logical (numbered from 5)
pl: l logiczna (numerowana od 5 wzwy¿)

source: e extended
pl: e rozszerzona

source: Using default response %c
pl: Przyjêto warto¶æ domy¶ln± %c

source: Invalid partition type `%c'
pl: Niepoprawny typ partycji `%c'

source: The partition table has been altered!
pl: Tablica partycji zosta³a zmodyfikowana!

source: Calling ioctl() to re-read partition table.
pl: Wywo³ywanie ioctl() w celu ponownego odczytu tablicy partycji.

source: WARNING: Re-reading the partition table failed with error %d: %s. The kernel still uses the old table. The new table will be used at the next reboot or after you run partprobe(8) or kpartx(8)
pl: UWAGA: ponowny odczyt tablicy partycji zakoñczy³ siê b³êdem %d: %s. J±dro nadal u¿ywa starej tablicy. Nowa tablica bêdzie u¿ywana po nastêpnym restarcie systemu albo po uruchomieniu partprobe(8) lub kpartx(8)

source: WARNING: If you have created or modified any DOS 6.x partitions, please see the fdisk manual page for additional information.
pl: UWAGA: Je¶li zosta³y utworzone lub zmodyfikowane partycje DOS-a 6.x, proszê zobaczyæ dodatkowe informacje w podrêczniku do fdiska.

source: Error closing file
pl: B³±d podczas zamykania pliku

source: Syncing disks.
pl: Synchronizacja dysków.

source: Partition %d has no data area
pl: Partycja %d nie ma obszaru danych

source: New beginning of data
pl: Nowy pocz±tek danych

source: Expert command (m for help):
pl: Polecenie eksperta (m wy¶wietla pomoc):

source: Number of cylinders
pl: Liczba cylindrów

source: Number of heads
pl: Liczba g³owic

source: Number of sectors
pl: Liczba sektorów

source: Warning: setting sector offset for DOS compatiblity
pl: Uwaga: ustawianie offsetu sektora dla kompatybilno¶ci z DOS-em

source: WARNING: GPT (GUID Partition Table) detected on '%s'! The util fdisk doesn't support GPT. Use GNU Parted.
pl: UWAGA: Na '%s' wykryto tablicê partycji GPT (GUID Partition Table)! fdisk nie obs³uguje GPT. Nale¿y u¿yæ GNU Parteda.

source: Disk %s doesn't contain a valid partition table
pl: Dysk %s nie zawiera poprawnej tablicy partycji

source: Cannot open %s
pl: Nie mo¿na otworzyæ %s

source: cannot open %s
pl: nie mo¿na otworzyæ %s

source: %c: unknown command
pl: %c: nieznane polecenie

source: This kernel finds the sector size itself - -b option ignored
pl: J±dro samo rozpoznaje rozmiar sektora - opcja -b zignorowana

source: Warning: the -b (set sector size) option should be used with one specified device
pl: Uwaga: opcja -b (rozmiar sektora) powinna byæ u¿ywana z okre¶lonym urz±dzeniem
