Repository: RMerl/asuswrt-merlin
Catalog: release/src/router/util-linux/po/*.po
Languages: pl

source: Usage: umount -h | -V umount -a [-d] [-f] [-r] [-n] [-v] [-t vfstypes] [-O opts] umount [-d] [-f] [-r] [-n] [-v] special | node...
pl: Sk³adnia: umount -h | -V umount -a [-d] [-f] [-r] [-n] [-v] [-t typyvfs] [-O opcje] umount [-d] [-f] [-r] [-n] [-v] spec | urz±dzenie...

source: failed to parse 'offset=%s' options
pl: nie uda³o siê przeanalizowaæ opcji 'offset=%s'

source: device %s is associated with %s
pl: urz±dzenie %s jest powi±zane z %s

source: device %s is not associated with %s
pl: urz±dzenie %s nie jest powi±zane z %s

source: Cannot unmount ""
pl: Nie mo¿na odmontowaæ ""

source: Trying to unmount %s
pl: Próba odmontowania %s

source: umount: confused when analyzing mtab
pl: umount: zaskoczony przy analizie mtaba

source: umount: cannot unmount %s -- %s is mounted over it on the same point
pl: umount: nie mo¿na odmontowaæ %s - %s jest zamontowany na wierzchu w tym samym miejscu

source: Could not find %s in mtab
pl: Nie uda³o siê odnale¼æ %s w mtabie

source: %s is associated with %s
pl: %s jest powi±zany z %s

source: %s is associated with more than one loop device: not unmounting
pl: %s jest powi±zany z wiêcej ni¿ jednym urz±dzeniem loop: nie odmontowano

source: umount: %s is not mounted (according to mtab)
pl: umount: %s nie jest zamontowany (wg mtaba)

source: umount: it seems %s is mounted multiple times
pl: umount: zdaje siê, ¿e %s jest zamontowany wiele razy

source: umount: %s is not in the fstab (and you are not root)
pl: umount: %s nie jest w fstabie (do odmontowania trzeba byæ rootem)

source: umount: %s mount disagrees with the fstab
pl: umount: montowanie %s nie zgadza siê z fstabem

source: umount: only %s can unmount %s from %s
pl: umount: tylko %s mo¿e odmontowaæ %s z %s

source: umount: only root can do that
pl: umount: tylko root mo¿e to zrobiæ

source: partition number
pl: numer partycji

source: start of the partition in sectors
pl: pocz±tek partycji w sektorach

source: end of the partition in sectors
pl: koniec partycji w sektorach

source: number of sectors
pl: liczba sektorów

source: human readable size
pl: rozmiar w postaci czytelnej dla cz³owieka

source: partition name
pl: nazwa partycji

source: partition UUID
pl: UUID partycji

source: partition table type (dos, gpt, ...)
pl: typ tablicy partycji (dos, gpt...)

source: partition flags
pl: flagi partycji

source: partition type hex or uuid
pl: typ (szesnastkowo) lub UUID partycji

source: %s: failed to get partition number
pl: %s: nie uda³o siê zapisaæ numeru partycji

source: %s: error deleting partition %d
pl: %s: b³±d usuwania partycji %d

source: %s: error deleting partitions %d-%d
pl: %s: b³±d usuwania partycji %d-%d

source: specified range <%d:%d> does not make sense
pl: podany przedzia³ <%d:%d> nie ma sensu

source: %s: partition #%d removed
pl: %s: usuniêto partycjê #%d

source: %s: deleting partition #%d failed
pl: %s: usuniêcie partycji #%d nie powiod³o siê

source: %s: error adding partition %d
pl: %s: b³±d podczas dodawania partycji %d

source: %s: error adding partitions %d-%d
pl: %s: b³±d podczas dodawania partycji %d-%d

source: %s: partition #%d added
pl: %s: dodano partycjê #%d

source: %s: adding partition #%d failed
pl: %s: dodanie partycji #%d nie powiod³o siê

source: #%2d: %9ju-%9ju (%9ju sectors, %6ju MB)
pl: #%2d: %9ju-%9ju (sektorów: %9ju, %6ju MB)

source: failed to initialize blkid filter for '%s'
pl: nie uda³o siê zainicjowaæ filtra blkid dla '%s'

source: %s: failed to read partition table
pl: %s: nie uda³o siê odczytaæ tablicy partycji

source: %s: partition table type '%s' detected
pl: %s: wykryto tablicê partycji typu '%s'

source: %s: %s partition table does not contains usable partitions
pl: %s: tablica partycji %s nie zawiera u¿ytecznych informacji

source: %s [-a|-d|-s] [--nr <n:m> | <partition>] <disk>
pl: %s [-a|-d|-s] [--nr <n:m> | <partycja>] <dysk>

source: -a, --add add specified partitions or all of them -d, --delete delete specified partitions or all of them -l, --list list partitions (DEPRECATED) -s, --show list partitions -b, --bytes print SIZE in bytes rather than in human readable format -g, --noheadings don't print headings for --show -P, --pairs use key="value" output format -r, --raw use raw output format -t, --type <type> specify the partition type (dos, bsd, solaris, etc.) -n, --nr <n:m> specify the range of partitions (e.g. --nr 2:4) -o, --output <type> define which output columns to use -h, --help print this help
pl: -a, --add dodanie podanych partycji lub wszystkich -d, --delete usuniêcie podanych partycji lub wszystkich -l, --list lista partycji (PRZESTARZA£E) -s, --show lista partycji -b, --bytes wypisywanie rozmiarów w bajtach zamiast formatu czytelnego dla cz³owieka -g, --noheadings bez wypisywania nag³ówków przy --show -P, --pairs wyj¶cie w formacie klucz="warto¶æ" -r, --raw wyj¶cie w formacie surowym -t, --type <typ> okre¶lenie typu partycji (dos, bsd, solaris itp.) -n, --nr <n:m> okre¶lenie przedzia³u partycji (np. --nr 2:4) -o, --output <typ> okre¶lenie kolumn do wypisania na wyj¶ciu -h, --help wy¶wietlenie tego opisu

source: Available columns (for --show, --raw or --pairs):
pl: Dostêpne kolumny (dla --show, --raw lub --pairs):

source: For more information see partx(8).
pl: Wiêcej informacji mo¿na znale¼æ w partx(8).

source: the options %s are mutually exclusive
pl: opcje %s wykluczaj± siê wzajemnie

source: failed to parse --nr <M-N> range
pl: nie uda³o siê przeanalizowaæ przedzia³u --nr <M-N>

source: --nr and <partition> are mutually exclusive
pl: --nr i <partycja> wykluczaj± siê wzajemnie

source: partition: %s, disk: %s, lower: %d, upper: %d
pl: partycja: %s, dysk: %s, pocz±tek: %d, koniec: %d

source: %s: failed to initialize blkid prober
pl: %s: nie uda³o siê zainicjowaæ próbnika blkid

source: chrt - manipulate real-time attributes of a process Set policy: chrt [options] <policy> <priority> {<pid> | <command> [<arg> ...]} Get policy: chrt [options] {<pid> | <command> [<arg> ...]}
pl: chrt - zmiana atrybutów czasu rzeczywistego (real-time) procesu Ustawianie polityki: chrt [opcje] <polityka> <priorytet> {<pid> | <polecenie> [<arg> ...]} Odczyt polityki: chrt [opcje] {<pid> | <polecenie> [<arg> ...]}

source: Scheduling policies: -b | --batch set policy to SCHED_BATCH -f | --fifo set policy to SCHED_FIFO -i | --idle set policy to SCHED_IDLE -o | --other set policy to SCHED_OTHER -r | --rr set policy to SCHED_RR (default)
pl: Polityki szeregowania: -b | --batch ustawienie polityki na SCHED_BATCH -f | --fifo ustawienie polityki na SCHED_FIFO -i | --idle ustawienie polityki na SCHED_IDLE -o | --other ustawienie polityki na SCHED_OTHER -r | --rr ustawienie polityki na SCHED_RR (domy¶lna)

source: Scheduling flags: -R | --reset-on-fork set SCHED_RESET_ON_FORK for FIFO or RR
pl: Flagi szeregowania: -R | --reset-on-fork ustawienie SCHED_RESET_ON_FORK dla FIFO lub RR

source: Options: -a | --all-tasks operate on all the tasks (threads) for a given pid -h | --help display this help -m | --max show min and max valid priorities -p | --pid operate on existing given pid -v | --verbose display status information -V | --version output version information
pl: Opcje: -a | --all-tasks operowanie na wszystkich zadaniach (w±tkach) danego pidu -h | --help wy¶wietlenie tego opisu -m | --max wypisanie minimalnego i maksymalnego priorytetu -p | --pid operowanie na istniej±cym, podanym pidzie -v | --verbose wy¶wietlanie informacji o stanie -V | --version wy¶wietlenie informacji o wersji

source: failed to get pid %d's policy
pl: nie uda³o siê odczytaæ polityki dla pidu %d

source: pid %d's new scheduling policy:
pl: nowa polityka szeregowania pidu %d:

source: pid %d's current scheduling policy:
pl: aktualna polityka szeregowania dla pidu %d:

source: unknown scheduling policy
pl: nieznana polityka szeregowania

source: failed to get pid %d's attributes
pl: nie uda³o siê odczytaæ atrybutów pidu %d

source: pid %d's new scheduling priority: %d
pl: nowy priorytet szeregowania dla pidu %d: %d

source: pid %d's current scheduling priority: %d
pl: aktualny priorytet szeregowania dla pidu %d: %d

source: SCHED_%s min/max priority : %d/%d
pl: Minimalny/maksymalny priorytet dla SCHED_%s: %d/%d

source: SCHED_%s not supported?
pl: Polityka SCHED_%s nie jest obs³ugiwana?

source: failed to parse pid
pl: niezrozumia³y pid

source: cannot obtain the list of tasks
pl: nie mo¿na uzyskaæ listy zadañ

source: failed to parse priority
pl: niezrozumia³y priorytet

source: SCHED_RESET_ON_FORK flag is suppoted for SCHED_FIFO and SCHED_RR policies only
pl: flaga SCHED_RESET_ON_FORK jest obs³ugiwana tylko dla polityk SCHED_FIFO i SCHED_RR

source: failed to set tid %d's policy
pl: nie uda³o siê ustawiæ polityki dla tidu %d

source: failed to set pid %d's policy
pl: nie uda³o siê ustawiæ polityki dla pidu %d

source: failed to execute %s
pl: nie uda³o siê uruchomiæ %s

source: ioprio_get failed
pl: ioprio_get nie powiod³o siê

source: ioprio_set failed
pl: ioprio_set nie powiod³o siê

source: %1$s - sets or gets process io scheduling class and priority. Usage: %1$s [OPTION] -p PID [PID...] %1$s [OPTION] COMMAND Options: -c, --class <class> scheduling class name or number 0: none, 1: realtime, 2: best-effort, 3: idle -n, --classdata <num> scheduling class data 0-7 for realtime and best-effort classes -p, --pid=PID view or modify already running process -t, --ignore ignore failures -V, --version output version information and exit -h, --help display this help and exit
pl: %1$s - ustawianie lub odczyt klasy i priorytetu szeregowania we/wy procesu Sk³adnia: %1$s [OPCJA] -p PID [PID...] %1$s [OPCJA] POLECENIE Opcje: -c, --class <klasa> nazwa lub numer klasy szeregowania 0: none, 1: realtime, 2: best-effort, 3: idle -n, --classdata <liczba> dane klasy szeregowania 0-7 dla klas realtime i best-effort -p, --pid=PID wypisanie lub zmiana dla ju¿ dzia³aj±cego procesu -t, --ignore zignorowanie b³êdów -V, --version wypisanie informacji o wersji i zakoñczenie -h, --help wy¶wietlenie tego opisu i zakoñczenie

source: failed to parse class data
pl: nie uda³o siê przeanalizowaæ danych klasy

source: failed to parse class
pl: nie uda³o siê przeanalizowaæ klasy

source: unknown scheduling class: '%s'
pl: nieznana klasa szeregowania: '%s'

source: ignoring given class data for none class
pl: zignorowano podane dane klasy dla klasy none

source: ignoring given class data for idle class
pl: zignorowano podane dane klasy dla klasy idle

source: unknown prio class %d
pl: nieznana klasa priorytetu %d

source: executing %s failed
pl: uruchomienie %s nie powiod³o siê

source: Usage: %s [options] [mask | cpu-list] [pid|cmd [args...]]
pl: Sk³adnia: %s [opcje] [maska | lista-cpu] [pid|polecenie [arg...]]

source: Options: -a, --all-tasks operate on all the tasks (threads) for a given pid -p, --pid operate on existing given pid -c, --cpu-list display and specify cpus in list format -h, --help display this help -V, --version output version information
pl: Opcje: -a | --all-tasks operowanie na wszystkich zadaniach (w±tkach) danego pidu -p, --pid operowanie na podanym, istniej±cym pidzie -c, --cpu-list wypisywanie i okre¶lanie CPU w postaci listy -h, --help wy¶wietlenie tego opisu -V, --version wy¶wietlenie informacji o wersji

source: The default behavior is to run a new command: %1$s 03 sshd -b 1024 You can retrieve the mask of an existing task: %1$s -p 700 Or set it: %1$s -p 03 700 List format uses a comma-separated list instead of a mask: %1$s -pc 0,3,7-11 700 Ranges in list format can take a stride argument: e.g. 0-31:2 is equivalent to mask 0x55555555
pl: Domy¶lne zachowanie to uruchomienie nowego polecenia: %1$s 03 sshd -b 1024 Mo¿na te¿ uzyskaæ maskê dla istniej±cego zadania: %1$s -p 700 Lub ustawiæ j±: %1$s -p 03 700 Mo¿na u¿yæ formatu listy oddzielonej przecinkami zamiast maski: %1$s -pc 0,3,7-11 700 Przedzia³y w formacie listy mog± mieæ argument kroku: np. 0-31:2 odpowiada masce 0x55555555

source: For more information see taskset(1).
pl: Wiêcej informacji w taskset(1).

source: pid %d's new affinity list: %s
pl: Nowa lista przypisañ dla pidu %d: %s

source: pid %d's current affinity list: %s
pl: aktualna lista przypisañ dla pidu %d: %s

source: pid %d's new affinity mask: %s
pl: Nowa maska przypisañ dla pidu %d: %s

source: pid %d's current affinity mask: %s
pl: aktualna maska przypisañ dla pidu %d: %s

source: conversion from cpuset to string failed
pl: nie uda³o siê przekszta³ciæ cpuset do ³añcucha znaków

source: failed to get pid %d's affinity
pl: nie uda³o siê uzyskaæ przypisañ dla pidu %d

source: failed to set pid %d's affinity
pl: nie uda³o siê ustawiæ przypisañ dla pidu %d

source: cannot determine NR_CPUS; aborting
pl: nie mo¿na okre¶liæ NR_CPUS; przerwano

source: cpuset_alloc failed
pl: cpuset_alloc nie powiod³o siê

source: failed to parse CPU list: %s
pl: nie uda³o siê przeanalizowaæ listy CPU: %s

source: failed to parse CPU mask: %s
pl: nie uda³o siê przeanalizowaæ maski CPU: %s

source: You must be root to set the Ctrl-Alt-Del behaviour
pl: Aby zmieniæ zachowanie Ctrl-Alt-Del, trzeba byæ rootem

source: Usage: %s hard|soft
pl: Sk³adnia: %s hard|soft

source: File %s, For threshold value %lu, Maximum characters in fifo were %d, and the maximum transfer rate in characters/second was %f
pl: Plik %s, warto¶æ progowa %lu, maksymalna liczba znaków w kolejce %d, maksymalny transfer w znakach/sekundê wyniós³ %f

source: File %s, For threshold value %lu and timrout value %lu, Maximum characters in fifo were %d, and the maximum transfer rate in characters/second was %f
pl: Plik %s, warto¶æ progowa %lu, limit czasu %lu, maksymalna liczba znaków w kolejce %d, maksymalny transfer w znakach/sekundê wyniós³ %f

source: Invalid interval value: %s
pl: B³êdna warto¶æ okresu: %s

source: Invalid set value: %s
pl: B³êdna ustawiana warto¶æ progowa: %s

source: Invalid default value: %s
pl: B³êdna warto¶æ domy¶lna: %s

source: Invalid set time value: %s
pl: B³êdna ustawiana warto¶æ czasu: %s

source: Invalid default time value: %s
pl: B³êdna domy¶lna warto¶æ czasu: %s

source: Usage: %s [-q [-i interval]] ([-s value]|[-S value]) ([-t value]|[-T value]) [-g|-G] file [file...]
pl: Sk³adnia: %s [-q [-i okres]] ([-s warto¶æ]|[-S warto¶æ]) ([-t warto¶æ]|[-T warto¶æ]) [-g|-G] plik [plik...]

source: Can't open %s: %s
pl: Nie mo¿na otworzyæ %s: %s

source: Can't set %s to threshold %d: %s
pl: Nie mo¿na ustawiæ %s na warto¶æ progow± %d: %s

source: Can't set %s to time threshold %d: %s
pl: Nie mo¿na ustawiæ %s na warto¶æ progow± czasu %d: %s

source: Can't get threshold for %s: %s
pl: Nie mo¿na odczytaæ warto¶ci progowej dla %s: %s

source: Can't get timeout for %s: %s
pl: Nie mo¿na odczytaæ limitu czasu dla %s: %s

source: %s: %ld current threshold and %ld current timeout
pl: %s: bie¿±ca warto¶æ progowa %ld, bie¿±cy limit czasu %ld

source: %s: %ld default threshold and %ld default timeout
pl: %s: domy¶lna warto¶æ progowa %ld, domy¶lny limit czasu %ld

source: Can't set signal handler
pl: Nie mo¿na ustawiæ procedury obs³ugi sygna³u

source: gettimeofday failed
pl: gettimeofday nie powiod³o siê

source: Can't issue CYGETMON on %s: %s
pl: Nie mo¿na wykonaæ CYGETMON na %s: %s

source: %s: %lu ints, %lu/%lu chars; fifo: %lu thresh, %lu tmout, %lu max, %lu now
pl: %s: %lu przerw., %lu/%lu znaków; fifo: próg %lu, limit %lu, maks. %lu, teraz %lu

source: %f int/sec; %f rec, %f send (char/sec)
pl: %f przerwañ/sekundê; odbiór %f, wysy³anie %f (znaków/sekundê)

source: %s: %lu ints, %lu chars; fifo: %lu thresh, %lu tmout, %lu max, %lu now
pl: %s: %lu przerw., %lu znaków; fifo: próg %lu, limit %lu, maks. %lu, teraz %lu

source: %f int/sec; %f rec (char/sec)
pl: %f przerwañ/sekundê; odbiór %f (znaków/sekundê)

source: system is unusable
pl: system jest bezu¿yteczny

source: action must be taken immediately
pl: akcjê trzeba podj±æ natychmiast

source: critical conditions
pl: warunki krytyczne

source: error conditions
pl: wyst±pi³ b³±d

source: warning conditions
pl: wyst±pi³o ostrze¿enie

source: normal but significant condition
pl: normalne, ale znacz±ce zdarzenie

source: informational
pl: informacja

source: debug-level messages
pl: komunikaty diagnostyczne

source: kernel messages
pl: komunikaty od j±dra

source: random user-level messages
pl: komunikaty poziomu u¿ytkownika

source: mail system
pl: system pocztowy

source: system daemons
pl: demony systemowe

source: security/authorization messages
pl: komunikaty dot. bezpieczeñstwa/autoryzacji

source: messages generated internally by syslogd
pl: komunikaty wygenerowane wewnêtrznie przez syslogd

source: line printer subsystem
pl: podsystem wydruku

source: network news subsystem
pl: podsystem sieciowy news

source: UUCP subsystem
pl: podsystem UUCP

source: clock daemon
pl: demon zegara

source: security/authorization messages (private)
pl: komunikaty dot. bezpieczeñstwa/autoryzacji (prywatne)

source: ftp daemon
pl: demon ftp

source: -C, --clear clear the kernel ring buffer -c, --read-clear read and clear all messages -D, --console-off disable printing messages to console -d, --show-delta show time delta between printed messages -E, --console-on enable printing messages to console -f, --facility <list> restrict output to defined facilities -h, --help display this help and exit -k, --kernel display kernel messages -l, --level <list> restrict output to defined levels -n, --console-level <level> set level of messages printed to console -r, --raw print the raw message buffer -s, --buffer-size <size> buffer size to query the kernel ring buffer -T, --ctime show human readable timestamp (could be inaccurate if you have used SUSPEND/RESUME) -t, --notime don't print messages timestamp -u, --userspace display userspace messages -V, --version output version information and exit -x, --decode decode facility and level to readable string
pl: -C, --clear wyczyszczenie bufora w j±drze -c, --read-clear odczyt i wyczyszczenie wszystkich komunikatów -D, --console-off wy³±czenie wypisywania komunikatów na konsolê -d, --show-delta podawanie ró¿nicy czasu miêdzy komunikatami -E, --console-on w³±czenie wypisywania komunikatów na konsolê -f, --facility <lista> ograniczenie wyj¶cia do okre¶lonych kategorii -h, --help wy¶wietlenie tego opisu i zakoñczenie -k, --kernel wy¶wietlenie komunikatów j±dra -l, --level <lista> ograniczenie wyj¶cia do okre¶lonych poziomów -n, --console-level <poziom> ust. poziomu komunikatów wypisywanych na konsolê -r, --raw wypisanie bufora komunikatów w postaci surowej -s, --buffer-size <rozmiar> rozmiar bufora przy odpytywaniu bufora j±dra -T, --ctime podawanie czasu w postaci czytelnej dla cz³owieka (mo¿e byæ niedok³adne po SUSPEND/RESUME) -t, --notime bez wypisywania znaczników czasu komunikatów -u, --userspace wy¶wietlanie komunikatów przestrzeni u¿ytkownika -V, --version wypisanie informacji o wersji i zakoñczenie -x, --decode dekodowanie kategorii i poziomu do formy czytelnej

source: Supported log facilities:
pl: Obs³ugiwane kategorie logowania:

source: Supported log levels (priorities):
pl: Obs³ugiwane poziomy (priorytety) logowania:

source: failed to parse level '%s'
pl: nie uda³o siê przeanalizowaæ poziomu '%s'

source: unknown level '%s'
pl: nieznany poziom '%s'

source: failed to parse facility '%s'
pl: nie uda³o siê przeanalizowaæ kategorii '%s'

source: unknown facility '%s'
pl: nieznana kategoria '%s'

source: sysinfo failed
pl: sysinfo nie powiod³o siê

source: write failed
pl: zapis nie powiód³ siê

source: clear, read-clear, console-level, console-on, and console-off options are mutually exclusive
pl: opcje clear, read-clear, console-level, console-on i console-off wykluczaj± siê wzajemnie

source: failed to parse buffer size
pl: nie uda³o siê przeanalizowaæ rozmiaru bufora

source: --raw can't be used together with level, facility, decode, delta, ctime or notime options
pl: opcja --raw nie mo¿e byæ u¿yta wraz z level, facility, decode, delta, ctime ani notime

source: --notime can't be used together with ctime
pl: opcja --notime nie mo¿e byæ u¿yta wraz z ctime

source: unsupported command
pl: polecenie nie obs³ugiwane

source: klogctl failed
pl: klogctl nie powiod³o siê

source: %s [options] <filename>
pl: %s [opcje] <nazwa_pliku>

source: -h, --help this help -n, --keep-size don't modify the length of the file -o, --offset <num> offset of the allocation, in bytes -l, --length <num> length of the allocation, in bytes
pl: -h, --help ten opis -n, --keep-size bez modyfikowania d³ugo¶ci pliku -o, --offset <ile> pozycja (offset) przydzia³u w bajtach -l, --length <ile> d³ugo¶æ przydzia³u w bajtach

source: For more information see fallocate(1).
pl: Wiêcej informacji mo¿na znale¼æ w fallocate(1).

source: no length argument specified
pl: nie podano argumentu d³ugo¶ci

source: invalid length value specified
pl: podano b³êdn± warto¶æ d³ugo¶ci

source: invalid offset value specified
pl: podano b³êdn± warto¶æ offsetu

source: no filename specified.
pl: nie podano nazwy pliku.

source: unexpected number of arguments
pl: nieoczekiwana liczba argumentów

source: keep size mode (-n option) unsupported
pl: tryb utrzymywania rozmiaru (opcja -n) nie jest obs³ugiwany

source: %s: fallocate failed
pl: %s: fallocate nie powiod³o siê

source: %1$s [-sxun][-w #] fd# %1$s [-sxon][-w #] file [-c] command... %1$s [-sxon][-w #] directory [-c] command...
pl: %1$s [-sxun][-w #] fd# %1$s [-sxon][-w #] plik [-c] polecenie... %1$s [-sxon][-w #] katalog [-c] polecenie...

source: -s --shared Get a shared lock -x --exclusive Get an exclusive lock -u --unlock Remove a lock -n --nonblock Fail rather than wait -w --timeout Wait for a limited amount of time -o --close Close file descriptor before running command -c --command Run a single command string through the shell -h --help Display this text -V --version Display version
pl: -s --shared Uzyskanie wspó³dzielonej blokady -x --exclusive Uzyskanie wy³±cznej blokady -u --unlock Usuniêcie blokady -n --nonblock Niepowodzenie zamiast oczekiwania -w --timeout Oczekiwanie przez ograniczony czas -o --close Zamkniêcie deskryptora pliku przed uruchomieniem polecenia -c --command Uruchomienie pojedynczego polecenia w pow³oce -h --help Wy¶wietlenie tego opisu -V --version Wy¶wietlenie informacji o wersji

source: %s: %s requires exactly one command argument
pl: %s: %s wymaga dok³adnie jednego argumentu bêd±cego poleceniem

source: %s: cannot open lock file %s: %s
pl: %s: nie mo¿na otworzyæ pliku blokady %s: %s

source: %s: bad number: %s
pl: %s: b³êdna liczba: %s

source: %s: requires file descriptor, file or directory
pl: %s: wymaga deskryptora pliku, pliku lub katalogu

source: %s: fork failed: %s
pl: %s: wywo³anie fork nie powiod³o siê: %s

source: %s [options] <mount point>
pl: %s [opcje] <punkt montowania>

source: -h, --help this help -f, --freeze freeze the filesystem -u, --unfreeze unfreeze the filesystem
pl: -h, --help ten opis -f, --freeze zamro¿enie systemu plików -u, --unfreeze odmro¿enie systemu plików

source: For more information see fsfreeze(8).
pl: Wiêcej informacji w fsfreeze(8).

source: no action specified
pl: nie okre¶lono akcji

source: no filename specified
pl: nie podano nazwy pliku

source: %s: fstat failed
pl: %s: fstat nie powiod³o siê

source: %s: is not a directory
pl: %s: nie jest katalogiem

source: %s: freeze failed
pl: %s: zamro¿enie nie powiod³o siê

source: %s: unfreeze failed
pl: %s: odmro¿enie nie powiod³o siê

source: -h, --help this help -o, --offset <num> offset in bytes to discard from -l, --length <num> length of bytes to discard from the offset -m, --minimum <num> minimum extent length to discard -v, --verbose print number of discarded bytes
pl: -h, --help ten opis -o, --offset <ile> offset w bajtach do usuniêcia -l, --length <ile> d³ugo¶æ w bajtach do usuniêcia od offsetu -m, --minimum <ile> minimalna d³ugo¶æ ekstentu do usuniêcia -v, --verbose wypisanie liczby usuniêtych bajtów
