var Arhangelsk =
[["Arhangelsk", "ȳǦǫǕǣǘǚǡǲǧǠ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Astrakhan =
[["Astrakhan", "ȳǧǨǦǕǫǕǣǲ", "ACT", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Astrakhan", "ȳǧǨǦǕǫǕǣǲ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Astrakhan", "ȳǧǨǦǕǫǕǣǲ", "Delta-Telecom", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Astrakhan", "ȳǧǨǦǕǫǕǣǲ", "Telecom-Service", "PPTP", "U", "U", "U", "U", "U", "U", "U", "U", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Balakovo =
[["Balakovo", "ȴǕǡǕǠǤǗǤ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Barnaul =
[["Barnaul", "ȴǕǦǣǕǩǡ", "Intelbi", "Static IP", "U", "U", "U", "U", "N", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Barnaul", "ȴǕǦǣǕǩǡ", "Intelica", "Static IP", "U", "U", "U", "U", "N", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Bataisk =
[["Bataisk", "ȴǕǨǕǟǧǠ", "Beeline", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Berdsk =
[["Berdsk", "ȴǚǦǙǧǠ", "HomeNET", "DHCP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Bryansk =
[["Bryansk", "ȴǦǵǣǧǠ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Vladisvostok =
[["Vladisvostok", "ȵǡǕǙǞǗǤǧǨǤǠ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Volgograd =
[["Volgograd", "ȵǤǡǘǤǘǦǕǙ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Volgograd", "ȵǤǡǘǤǘǦǕǙ", "DOM.RU", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Volzhsky =
[["Volzhsky", "ȵǤǡǜǧǠǞǟ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Volzhsky", "ȵǤǡǜǧǠǞǟ", "DOM.RU", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Volzhsky", "ȵǤǡǜǧǠǞǟ", "Tower-Telecom(STARNET)", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "vpn.starnet", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Voronezh =
[["Voronezh", "ȵǤǦǤǣǚǜ.", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Voronezh", "ȵǤǦǤǣǚǜ.", "Centralink", "PPTP", "U", "U", "U", "U", "N", "U", "U", "U", "1", "1", "1", "0", "N", "N", "N", "N"],
["Voronezh", "ȵǤǦǤǣǚǜ.", "Golden Telecom", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "fttb-vpn.voronezh.golden.ru", "1", "1", "1", "1", "N", "N", "N", "10.0.0.0>255.0.0.0>0.0.0.0>>WAN"],
["Voronezh", "ȵǤǦǤǣǚǜ.", "Intercon", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Vsevolozhsk =
[["Vsevolozhsk", "ȵǧǚǗǤǡǜǧǠ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Desnogorsk =
[["Desnogorsk", "ȷǚǧǣǤǘǤǦǧǠ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Dzerzhinsk =
[["Dzerzhinsk", "ȷǝǚǦǜǞǣǧǠ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Dimitrovgrad =
[["Dimitrovgrad", "ȷǞǢǞǨǦǤǗǘǦǕǙ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Domodedovo =
[["Domodedovo", "ȷǤǢǤǙǚǙǤǗǤ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Ekaterinburg =
[["Ekaterinburg", "ȸǠǕǨǚǦǞǣǖǩǦǘ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Ekaterinburg", "ȸǠǕǨǚǦǞǣǖǩǦǘ", "Kabinet", "PPTP", "U", "U", "U", "U", "U", "U", "U", "U", "1", "1", "1", "0", "N", "N", "N", "N"],
["Ekaterinburg", "ȸǠǕǨǚǦǞǣǖǩǦǘ", "Olympus", "PPTP", "U", "U", "U", "U", "U", "U", "U", "vpn.olympus.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Ekaterinburg", "ȸǠǕǨǚǦǞǣǖǩǦǘ", "Planeta", "DHCP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Ekaterinburg", "ȸǠǕǨǚǦǞǣǖǩǦǘ", "Ural Telephone Company", "PPTP", "U", "U", "U", "192.168.10.1", "U", "U", "U", "vpn.utk.ru", "1", "1", "1", "1", "N", "N", "N", "81.91.32.0>255.255.224.0>0.0.0.0>>WAN<62.168.224.0>255.255.224.0>0.0.0.0>>WAN<85.235.32.0>255.255.224.0>0.0.0.0>>WAN<217.114.16.0>255.255.252.0>0.0.0.0>>WAN"],
["Ekaterinburg", "ȸǠǕǨǚǦǞǣǖǩǦǘ", "UTK", "PPTP", "U", "U", "U", "U", "U", "U", "U", "vpn.utk.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Zheleznogorsk =
[["Zheleznogorsk", "ȺǚǡǚǝǣǤǘǤǦǧǠ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Zelenograd =
[["Zelenograd", "ȻǚǡǚǣǤǘǦǕǙ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Ivanovo =
[["Ivanovo", "ȼǗǕǣǤǗǤ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Izhevsk =
[["Izhevsk", "ȼǜǚǗǧǠ", "DOM.RU", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Irkutsk =
[["Irkutsk", "ȼǦǠǩǨǧǠ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Irkutsk_Region =
[["Irkutsk/Region", "ȼǦǠǩǨǧǠ/ǤǖǡǕǧǨǲ", "Delovaya Set", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Irkutsk/Region", "ȼǦǠǩǨǧǠ/ǤǖǡǕǧǨǲ", "IRKNET TELECOM", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Ioshkar_Ola =
[["Ioshkar-Ola", "ȽǤǮǠǕǦ-ǃǡǕ", "DOM.RU", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Kazan =
[["Kazan", "ȾǕǝǕǣǲ", "DOM.RU", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Kaliningrad =
[["Kaliningrad", "ȾǕǡǞǣǞǣǘǦǕǙ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Kaluga =
[["Kaluga", "ȾǕǡǩǘǕ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Kaluga", "ȾǕǡǩǘǕ", "Corbina", "L2TP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "tp.corbina.net", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Kashira =
[["Kashira", "ȾǕǮǞǦǕ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Kemerovo =
[["Kemerovo", "ȾǚǢǚǦǤǗǤ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Kirov =
[["Kirov", "ȾǞǦǤǗ", "DOM.RU", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Kolpino =
[["Kolpino", "ȾǚǢǚǦǤǗǤ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Korolev =
[["Korolev", "ȾǤǦǤǡǚǗ", "Infoline", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Korolev", "ȾǤǦǤǡǚǗ", "Vermont-IT", "Static IP", "U", "U", "U", "U", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Kokhma =
[["Kokhma", "ȾǤǫǢǕ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Krasnogorsk =
[["Krasnogorsk", "ȾǦǕǧǣǤǘǤǦǧǠ", "Elcom-Telecom", "PPTP(192.168.0.1)", "U", "U", "U", "192.168.0.1>192.168.1.1", "U", "U", "U", "192.168.0.1", "1", "1", "1", "0", "10.0.0.1", "N", "N", "N"],
["Krasnogorsk", "ȾǦǕǧǣǤǘǤǦǧǠ", "Elcom-Telecom", "PPTP(192.168.1.1)", "U", "U", "U", "192.168.0.1>192.168.1.1", "U", "U", "U", "192.168.1.1", "1", "1", "1", "0", "10.0.0.1", "N", "N", "N"],
["Krasnogorsk", "ȾǦǕǧǣǤǘǤǦǧǠ", "Elcom-Telecom", "PPTP(192.168.0.60)", "U", "U", "U", "192.168.0.1>192.168.1.1", "U", "U", "U", "192.168.0.60", "1", "1", "1", "0", "10.0.0.1", "N", "N", "N"],
["Krasnogorsk", "ȾǦǕǧǣǤǘǤǦǧǠ", "Elcom-Telecom", "PPTP(192.168.0.64)", "U", "U", "U", "192.168.0.1>192.168.1.1", "U", "U", "U", "192.168.0.64", "1", "1", "1", "0", "10.0.0.1", "N", "N", "N"]];
var Krasnodar =
[["Krasnodar", "ȾǦǕǧǣǤǙǕǦ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Krasnodar", "ȾǦǕǧǣǤǙǕǦ", "Stream", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.krasnodar.stream.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Krasnoobsk =
[["Krasnoobsk", "ȾǦǕǧǣǤǤǖǧǠ", "HomeNET", "DHCP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Krasnoyarsk =
[["Krasnoyarsk", "ȾǦǕǧǣǤǵǦǧǠ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Krasnoyarsk", "ȾǦǕǧǣǤǵǦǧǠ", "KrasLan", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Krasnoyarsk", "ȾǦǕǧǣǤǵǦǧǠ", "OrionTelecom", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Krasnoyarsk", "ȾǦǕǧǣǤǵǦǧǠ", "RightSide", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "U", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Krasnoyarsk_Region =
[["Krasnoyarsk/Region", "ȾǦǕǧǣǤǵǦǧǠ/ǤǖǡǕǧǨǲ", "SiberiaNet", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Kursk =
[["Kursk", "ȾǩǦǧǠ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Lipetsk =
[["Lipetsk", "ǀǞǥǚǬǠ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Lipetsk", "ǀǞǥǚǬǠ", "Corbina", "L2TP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "tp.corbina.net", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Lyubertsy =
[["Lyubertsy", "ǀǴǖǚǦǬǱ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Moscow =
[["Moscow", "ǁǤǧǠǗǕ", "2KOM", "PPTP", "U", "U", "U", "195.98.160.25", "U", "U", "U", "U", "1", "1", "1", "1", "N", "N", "N", "239.64.64.0>255.255.255.0>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Butovo.com", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "192.168.0.254", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Corbina", "L2TP+IPTV", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "tp.corbina.net", "1", "1", "1", "0", "N", "36", "4", "N"],
["Moscow", "ǁǤǧǠǗǕ", "CPMS", "DHCP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "CROSSNET", "Static IP", "U", "U", "U", "U", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Degunino.net", "PPTP", "U", "U", "U", "U", "U", "U", "U", "192.168.0.253", "1", "1", "1", "1", "N", "N", "N", "10.0.0.0>255.0.0.0>0.0.0.0>>WAN<81.211.38.4>255.255.255.252>0.0.0.0>>WAN<81.211.38.8>255.255.255.248>0.0.0.0>>WAN<81.211.38.16>255.255.255.240>0.0.0.0>>WAN<81.211.38.32>255.255.255.224>0.0.0.0>>WAN<81.211.38.64>255.255.255.192>0.0.0.0>>WAN<81.211.38.128>255.255.255.128>0.0.0.0>>WAN<81.211.39.0>255.255.255.0>0.0.0.0>>WAN<81.211.40.0>255.255.255.0>0.0.0.0>>WAN<217.78.176.0>255.255.255.128>0.0.0.0>>WAN<217.78.176.128>255.255.255.192>0.0.0.0>>WAN<217.78.176.192>255.255.255.224>0.0.0.0>>WAN<217.78.176.240>255.255.255.240>0.0.0.0>>WAN<217.78.176.224>255.255.255.248>0.0.0.0>>WAN<217.78.176.232>255.255.255.252>0.0.0.0>>WAN<217.78.177.0>255.255.255.0>0.0.0.0>>WAN<217.78.178.0>255.255.255.254 >0.0.0.0>>WAN<217.78.180.0>255.255.255.252>0.0.0.0>>WAN<217.78.184.0>255.255.255.248>0.0.0.0>>WAN<172.16.0.0>255.240.0.0>0.0.0.0>>WAN<192.168.0.0>255.255.0.0>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Dubki.Ru", "DHCP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "EAST Telecom", "PPTP", "U", "U", "U", "195.170.62.180>195.170.32.18", "U", "U", "U", "195.170.33.5", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Golden Telecom", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "fttb-vpn.mosreg.golden.ru", "1", "1", "1", "1", "N", "N", "N", "10.0.0.0>255.0.0.0>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Hovrino.ru", "DHCP(Tarificate)", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Hovrino.ru", "PPTP(Unlim PPTP)", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "ppp.ultranet.ru", "1", "1", "1", "1", "N", "N", "N", "10.0.0.0>255.0.0.0>0.0.0.0>>WAN<192.168.0.0>255.255.0.0>0.0.0.0>>WAN<172.16.0.0>255.240.0.0>0.0.0.0>>WAN<81.25.53.1>255.255.255.255>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Hovrino.ru", "PPTP(Unlim public IP - central)", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "central.ultranet.ru", "1", "1", "1", "1", "N", "N", "N", "10.0.0.0>255.0.0.0>0.0.0.0>>WAN<192.168.0.0>255.255.0.0>0.0.0.0>>WAN<172.16.0.0>255.240.0.0>0.0.0.0>>WAN<81.25.53.1>255.255.255.255>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Hovrino.ru", "PPTP(Unlim public IP - ppp)", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "ppp.ultranet.ru", "1", "1", "1", "1", "N", "N", "N", "10.0.0.0>255.0.0.0>0.0.0.0>>WAN<192.168.0.0>255.255.0.0>0.0.0.0>>WAN<172.16.0.0>255.240.0.0>0.0.0.0>>WAN<81.25.53.1>255.255.255.255>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "IMSYS", "DHCP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "InfiniteNet", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "10.200.4.11", "1", "1", "1", "1", "N", "N", "N", "10.0.0.0>255.0.0.0>0.0.0.0>>WAN<192.168.0.0>255.255.0.0>0.0.0.0>>WAN<213.33.170.0>255.255.255.0>0.0.0.0>>WAN<194.154.83.0>255.255.255.0>0.0.0.0>>WAN<81.211.62.0>255.255.255.0>0.0.0.0>>WAN<81.25.48.0>255.255.240.0>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Interlan(Nord-East)", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "vpn.interlan.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Interlan(SouthandSouth-West)", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "vpn3.interlan.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Izumrud-Service", "PPTP", "U", "U", "U", "192.168.0.1>192.168.0.2", "U", "U", "U", "vpn.internet", "0", "1", "1", "1", "N", "N", "N", "192.168.0.0>255.255.0.0>0.0.0.0>>WAN<10.0.0.0>255.0.0.0>0.0.0.0>>WAN<80.251.120.0>255.255.252.0>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Konkovo.net", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Korvet-Telecom", "Static IP", "U", "U", "U", "U", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Kurkino.net", "DHCP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "LIFELINK", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "LIFELINK", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "vpn.internet", "0", "1", "1", "1", "N", "N", "N", "192.168.0.0>255.255.0.0>0.0.0.0>>WAN<10.0.0.0>255.0.0.0>0.0.0.0>>WAN<80.251.120.0>255.255.252.0>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Localka", "DHCP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Localka", "PPTP", "U", "U", "U", "U", "U", "U", "U", "vpn.asteis.net", "1", "1", "1", "1", "N", "N", "N", "10.0.0.0>255.0.0.0>0.0.0.0>>WAN<195.239.126.0>255.255.255.0>0.0.0.0>>WAN<192.168.0.0>255.255.0.0>0.0.0.0>>WAN<172.0.0.0>255.0.0.0 >0.0.0.0>>WAN<195.218.170.0>255.255.255.0>0.0.0.0>>WAN<195.218.174.0>255.255.255.0>0.0.0.0>>WAN<194.178.204.0>255.255.252.0>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Masterlink", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Masterlink", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "vpn.masterlink.lan", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Metronet", "DHCP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "MOSINTER", "Static IP", "U", "U", "U", "172.20.0.1", "U", "N", "N", "N", "1", "1", "1", "0", "10.10.10.1", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Net-by-Net", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "ppp.lan", "1", "1", "1", "1", "N", "N", "N", "10.0.0.0>255.0.0.0>0.0.0.0>>WAN<212.1.224.0>255.255.255.0>0.0.0.0>>WAN<212.1.255.0>255.255.255.0>0.0.0.0>>WAN<89.20.128.0>255.255.255.0>0.0.0.0>>WAN<213.141.128.0>255.255.255.0>0.0.0.0>>WAN<192.168.0.0>255.255.0.0>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Net-by-Net", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "1", "N", "N", "N", "10.0.0.0>255.0.0.0>0.0.0.0>>WAN<212.1.224.0>255.255.255.0>0.0.0.0>>WAN<212.1.255.0>255.255.255.0>0.0.0.0>>WAN<89.20.128.0>255.255.255.0>0.0.0.0>>WAN<213.141.128.0>255.255.255.0>0.0.0.0>>WAN<192.168.0.0>255.255.0.0>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Onlime", "DHCP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "OSTnet.ru", "Static IP", "U", "U", "U", "10.11.12.1", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Procenter.ru", "Static IP", "U", "U", "U", "217.117.112.1>217.117.113.1", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Promira.net", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "vpn.promiranet.ru", "1", "1", "1", "1", "N", "N", "N", "172.16.0.0>255.255.0.0>0.0.0.0>>WAN<10.90.0.0>255.255.0.0>0.0.0.0>>WAN<10.91.0.0>255.255.0.0>0.0.0.0>>WAN<10.92.0.0>255.255.0.0>0.0.0.0>>WAN<10.93.0.0>255.255.0.0>0.0.0.0>>WAN<10.94.0.0>255.255.0.0>0.0.0.0>>WAN<10.95.0.0>255.255.0.0>0.0.0.0>>WAN<89.106.37.42>255.255.255.255>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Prov.ru", "Static IP", "U", "U", "U", "195.225.130.2>195.225.131.2", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "QWERTY", "Static IP", "U", "U", "U", "87.240.1.1>87.240.1.2", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "QWERTY", "DHCP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Rusteko", "Static IP", "U", "U", "U", "U", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Rusteko", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "rusteko.lan", "1", "1", "1", "1", "N", "N", "N", "192.168.0.0>255.255.0.0>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "SigmaCom", "PPTP (vpn2)", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "vpn2.sigmacom.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "SigmaCom", "PPTP (unlim3)", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "unlim3.sigmacom.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "SigmaCom", "PPTP (real)", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "real.sigmacom.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Starlink-Telecom", "DHCP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Starlink-Telecom", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "1", "N", "N", "N", "77.50.0.0>255.255.0.0>0.0.0.0>>WAN<10.0.0.0>255.0.0.0>0.0.0.0>>WAN<192.168.0.0>255.255.0.0>0.0.0.0>>WAN<217.197.112.0>255.255.254.0>0.0.0.0>>WAN<89.222.178.128>255.255.255.128>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Starlink-Telecom", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "vpn.starlink.ru", "1", "1", "1", "1", "N", "N", "N", "10.0.0.0>255.0.0.0>0.0.0.0>>WAN<77.50.0.0>255.255.0.0>0.0.0.0>>WAN<192.168.0.0>255.255.0.0>0.0.0.0>>WAN<217.197.112.0>255.255.254.0>0.0.0.0>>WAN<89.222.178.128>255.255.255.128>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Starnet", "PPPOE", "U", "U", "U", "U", "U", "U", "U", "N", "1", "1", "1", "1", "N", "N", "N", "10.10.0.0>255.255.0.0>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Sviblovo OnLine", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "vpn.sviblovo.ru", "0", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Tartila.net", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "vpn.tartila.net", "1", "1", "1", "1", "N", "N", "N", "172.16.0.0>255.255.0.0>0.0.0.0>>WAN<10.1.0.0>255.255.0.0>0.0.0.0>>WAN<10.2.0.0>255.255.0.0>0.0.0.0>>WAN<10.3.0.0>255.255.0.0>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Tushino.ru", "DHCP(Tarificate)", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Tushino.ru", "PPTP(Unlim PPTP)", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "ppp.tushino.ru", "1", "1", "1", "1", "N", "N", "N", "10.0.0.0>255.0.0.0>0.0.0.0>>WAN<192.168.0.0>255.255.0.0>0.0.0.0>>WAN<172.16.0.0>255.240.0.0>0.0.0.0>>WAN<81.25.53.1>255.255.255.255>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Tushino.ru", "PPTP(Unlim public IP - central)", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "central.tushino.ru", "1", "1", "1", "1", "N", "N", "N", "10.0.0.0>255.0.0.0>0.0.0.0>>WAN<192.168.0.0>255.255.0.0>0.0.0.0>>WAN<172.16.0.0>255.240.0.0>0.0.0.0>>WAN<81.25.53.1>255.255.255.255>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Tushino.ru", "PPTP(Unlim public IP - ppp)", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "ppp.tushino.ru", "1", "1", "1", "1", "N", "N", "N", "10.0.0.0>255.0.0.0>0.0.0.0>>WAN<192.168.0.0>255.255.0.0>0.0.0.0>>WAN<172.16.0.0>255.240.0.0>0.0.0.0>>WAN<81.25.53.1>255.255.255.255>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Tushino-Telecom", "PPPOE", "U", "U", "U", "89.250.0.2>89.250.1.2", "U", "U", "U", "N", "1", "1", "1", "1", "N", "N", "N", "10.0.0.0>255.0.0.0>0.0.0.0>>WAN<89.250.0.0>255.255.255.0>0.0.0.0>>WAN<89.250.1.0>255.255.255.0>0.0.0.0>>WAN<212.158.171.0>255.255.255.0>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Ultranet.ru", "DHCP(Tarificate)", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Ultranet.ru", "PPTP(Unlim PPTP)", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "ppp.ultranet.ru", "1", "1", "1", "1", "N", "N", "N", "10.0.0.0>255.0.0.0>0.0.0.0>>WAN<192.168.0.0>255.255.0.0>0.0.0.0>>WAN<172.16.0.0>255.240.0.0>0.0.0.0>>WAN<81.25.53.1>255.255.255.255>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Ultranet.ru", "PPTP(Unlim public IP - central)", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "central.ultranet.ru", "1", "1", "1", "1", "N", "N", "N", "10.0.0.0>255.0.0.0>0.0.0.0>>WAN<192.168.0.0>255.255.0.0>0.0.0.0>>WAN<172.16.0.0>255.240.0.0>0.0.0.0>>WAN<81.25.53.1>255.255.255.255>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Ultranet.ru", "PPTP(Unlim public IP - ppp)", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "ppp.ultranet.ru", "1", "1", "1", "1", "N", "N", "N", "10.0.0.0>255.0.0.0>0.0.0.0>>WAN<192.168.0.0>255.255.0.0>0.0.0.0>>WAN<172.16.0.0>255.240.0.0>0.0.0.0>>WAN<81.25.53.1>255.255.255.255>0.0.0.0>>WAN"],
["Moscow", "ǁǤǧǠǗǕ", "Utech(UniversalTechnology)", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Yasenevo Online", "Static IP", "U", "U", "U", "172.20.20.20>172.30.30.30", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Moscow", "ǁǤǧǠǗǕ", "Yauza Telecom", "Static IP", "U", "U", "U", "U", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var MoskowRegion =
[["MoskowRegion", "ǁǤǧǠǤǗǧǠǕǵǤǖǡǕǧǨǲ", "EAST Telecom", "PPTP", "U", "U", "U", "Auto", "U", "U", "U", "195.170.33.5", "1", "1", "1", "0", "N", "N", "N", "N"],
["MoskowRegion", "ǁǤǧǠǤǗǧǠǕǵǤǖǡǕǧǨǲ", "Flex", "PPTP (80.252.128.110)", "U", "U", "U", "U", "U", "U", "U", "80.252.128.110", "1", "1", "1", "1", "N", "N", "N", "10.202.192.0>255.255.240.0>0.0.0.0>>WAN<192.168.199.1>255.255.255.0>0.0.0.0>>WAN<80.252.130.250>255.255.255.255>0.0.0.0>>WAN<10.255.255.2>255.255.255.0>0.0.0.0>>WAN"],
["MoskowRegion", "ǁǤǧǠǤǗǧǠǕǵǤǖǡǕǧǨǲ", "Flex", "PPTP (10.255.255.32)", "U", "U", "U", "U", "U", "U", "U", "10.255.255.32", "1", "1", "1", "1", "N", "N", "N", "10.202.192.0>255.255.240.0>0.0.0.0>>WAN<192.168.199.1>255.255.255.0>0.0.0.0>>WAN<80.252.130.250>255.255.255.255>0.0.0.0>>WAN<10.255.255.2>255.255.255.0>0.0.0.0>>WAN"],
["MoskowRegion", "ǁǤǧǠǤǗǧǠǕǵǤǖǡǕǧǨǲ", "HimkiNET", "PPTP", "U", "U", "U", "10.10.250.250>10.10.140.250", "U", "U", "U", "vpn.bigtelecom.ru", "1", "1", "1", "1", "N", "N", "N", "10.10.0.0>255.255.0.0>0.0.0.0>>WAN<87.255.4.195>255.255.255.255>0.0.0.0>>WAN<87.255.0.134>255.255.255.255>0.0.0.0>>WAN"],
["MoskowRegion", "ǁǤǧǠǤǗǧǠǕǵǤǖǡǕǧǨǲ", "Infoline", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["MoskowRegion", "ǁǤǧǠǤǗǧǠǕǵǤǖǡǕǧǨǲ", "Infolink", "Static IP", "U", "U", "U", "82.179.208.180>82.179.209.2", "U", "N", "N", "N", "1", "1", "1", "1", "N", "N", "N", "82.179.208.0>255.255.254.0>0.0.0.0>>WAN<85.142.200.0>255.255.252.0>0.0.0.0>>WAN<85.142.192.0>255.255.248.0>0.0.0.0>>WAN<82.179.236.0>255.255.252.0>0.0.0.0>>WAN<82.179.234.0>255.255.254.0>0.0.0.0>>WAN"]];
var NaberezhnieChelni =
[["NaberezhnieChelni", "ǂǕǖǚǦǚǜǣǱǚǌǚǡǣǱ", "DOM.RU", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Neftekamsk =
[["Neftekamsk", "ǂǚǪǨǚǠǕǢǧǠ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Nizhnekamsk =
[["Nizhnekamsk", "ǂǞǜǣǚǠǕǢǧǠ", "DOM.RU", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var NizhniyNovgorod =
[["NizhniyNovgorod", "ǂǞǜǣǞǟǂǤǗǘǤǦǤǙ", "Agentstvo Delovoy Svazi", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.local", "1", "1", "1", "0", "N", "N", "N", "N"],
["NizhniyNovgorod", "ǂǞǜǣǞǟǂǤǗǘǤǦǤǙ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["NizhniyNovgorod", "ǂǞǜǣǞǟǂǤǗǘǤǦǤǙ", "DOM.RU", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Novomoskovsk =
[["Novomoskovsk", "ǂǤǗǤǢǤǧǠǤǗǧǠ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Novosibirsk_Region =
[["Novosibirsk/Region", "ǂǤǗǤǧǞǖǞǦǧǠ/ǤǖǡǕǧǨǲ", "Academ.org", "DHCP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Novosibirsk/Region", "ǂǤǗǤǧǞǖǞǦǧǠ/ǤǖǡǕǧǨǲ", "CITY", "Static IP", "U", "U", "U", "U", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Novosibirsk/Region", "ǂǤǗǤǧǞǖǞǦǧǠ/ǤǖǡǕǧǨǲ", "ComGate", "DHCP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Novosibirsk/Region", "ǂǤǗǤǧǞǖǞǦǧǠ/ǤǖǡǕǧǨǲ", "DOM.RU", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Novosibirsk/Region", "ǂǤǗǤǧǞǖǞǦǧǠ/ǤǖǡǕǧǨǲ", "HomeNet(Auto)", "DHCP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Novosibirsk/Region", "ǂǤǗǤǧǞǖǞǦǧǠ/ǤǖǡǕǧǨǲ", "HomeNet(Static)", "Static IP", "U", "U", "U", "U", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Novosibirsk/Region", "ǂǤǗǤǧǞǖǞǦǧǠ/ǤǖǡǕǧǨǲ", "NIR-Telecom", "DHCP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Novosibirsk/Region", "ǂǤǗǤǧǞǖǞǦǧǠ/ǤǖǡǕǧǨǲ", "NovoTelecom", "DHCP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Novosibirsk/Region", "ǂǤǗǤǧǞǖǞǦǧǠ/ǤǖǡǕǧǨǲ", "Siberian Nets", "DHCP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Novosibirsk/Region", "ǂǤǗǤǧǞǖǞǦǧǠ/ǤǖǡǕǧǨǲ", "Siberian Nets", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "10.105.0.1", "1", "1", "1", "0", "N", "N", "N", "N"],
["Novosibirsk/Region", "ǂǤǗǤǧǞǖǞǦǧǠ/ǤǖǡǕǧǨǲ", "TTK-3C", "DHCP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Noginsk =
[["Noginsk", "ǂǤǘǞǣǧǠ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Oktyabrsky =
[["Oktyabrsky", "ǃǠǨǵǖǦǲǧǠǞǟ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Omsk_Region =
[["Omsk/Region", "ǃǢǧǠ/ǤǖǡǕǧǨǲ", "DOM.RU", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Orel =
[["Orel", "ǃǦǶar ǡ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Orenburg =
[["Orenburg", "ǃǦǚǣǖǩǦǘ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Orenburg", "ǃǦǚǣǖǩǦǘ", "Corbina", "L2TP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "tp.corbina.net", "1", "1", "1", "0", "N", "N", "N", "N"],
["Orenburg", "ǃǦǚǣǖǩǦǘ", "DOM.RU", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var PavlovskyPosad =
[["PavlovskyPosad", "ǄǕǗǡǤǗǧǠǞǟǄǤǧǕǙ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Penza =
[["Penza", "ǄǚǣǝǕ", "DOM.RU", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Perm =
[["Perm", "ǄǚǦǢǲ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Perm", "ǄǚǦǢǲ", "DOM.RU", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Rostov_na_Donu =
[["Rostov-na-Donu", "ǅǤǧǨǤǗ-ǣǕ-ȷǤǣǩ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Rostov-na-Donu", "ǅǤǧǨǤǗ-ǣǕ-ȷǤǣǩ", "Corbina", "L2TP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "tp.corbina.net", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Ryazan =
[["Ryazan", "ǅǵǝǕǣǲ", "ElectroCom", "DHCP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Ryazan", "ǅǵǝǕǣǲ", "Interlink", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Ryazan", "ǅǵǝǕǣǲ", "InterTelecom", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Ryazan", "ǅǵǝǕǣǲ", "Multinex", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "172.31.1.245", "1", "1", "1", "0", "N", "N", "N", "N"],
["Ryazan", "ǅǵǝǕǣǲ", "N-Link", "PPTP", "U", "U", "U", "U", "N", "U", "U", "193.34.10.6", "1", "1", "1", "0", "N", "N", "N", "N"],
["Ryazan", "ǅǵǝǕǣǲ", "RyazanTelecom", "Static IP", "U", "U", "U", "U", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Ryazan", "ǅǵǝǕǣǲ", "UroksTelecom", "DHCP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Samara =
[["Samara", "ǆǕǢǕǦǕ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Samara", "ǆǕǢǕǦǕ", "DOM.RU", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Samara", "ǆǕǢǕǦǕ", "Golden Telecom", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "fttb-vpn.samara.golden.ru", "1", "1", "1", "1", "N", "N", "N", "10.0.0.0>255.0.0.0>0.0.0.0>>WAN"],
["Samara", "ǆǕǢǕǦǕ", "Kraft-S", "Static IP", "U", "U", "U", "U", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Samara", "ǆǕǢǕǦǕ", "MetroMax", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Samara", "ǆǕǢǕǦǕ", "Samsra-Internet", "Static IP", "U", "U", "U", "U", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Samara", "ǆǕǢǕǦǕ", "Tahion", "Static IP", "U", "U", "U", "U", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Samara", "ǆǕǢǕǦǕ", "TTK", "PPPOE", "U", "U", "U", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Samara", "ǆǕǢǕǦǕ", "VolgaOnLine", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Sankt_Peterburg =
[["Sankt-Peterburg", "ǆǕǣǠǨ-ǄǚǨǚǦǖǩǦǘ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Sankt-Peterburg", "ǆǕǣǠǨ-ǄǚǨǚǦǖǩǦǘ", "Corbina", "L2TP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "tp.corbina.net", "1", "1", "1", "0", "N", "N", "N", "N"],
["Sankt-Peterburg", "ǆǕǣǠǨ-ǄǚǨǚǦǖǩǦǘ", "Cubio", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Sankt-Peterburg", "ǆǕǣǠǨ-ǄǚǨǚǦǖǩǦǘ", "Demos Datcom", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Sankt-Peterburg", "ǆǕǣǠǨ-ǄǚǨǚǦǖǩǦǘ", "Eltel", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Sankt-Peterburg", "ǆǕǣǠǨ-ǄǚǨǚǦǖǩǦǘ", "Interzet", "Static IP", "U", "U", "U", "U", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Sankt-Peterburg", "ǆǕǣǠǨ-ǄǚǨǚǦǖǩǦǘ", "Matrix", "PPTP (vpn-gw1)", "U", "U", "U", "80.70.224.2>80.70.224.4", "U", "U", "U", "vpn-gw1.mns.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Sankt-Peterburg", "ǆǕǣǠǨ-ǄǚǨǚǦǖǩǦǘ", "Matrix", "PPTP (vpn-gw2)", "U", "U", "U", "80.70.224.2>80.70.224.4", "U", "U", "U", "vpn-gw2.mns.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Sankt-Peterburg", "ǆǕǣǠǨ-ǄǚǨǚǦǖǩǦǘ", "Matrix", "PPTP (vpn-gw3)", "U", "U", "U", "80.70.224.2>80.70.224.4", "U", "U", "U", "vpn-gw3.mns.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Sankt-Peterburg", "ǆǕǣǠǨ-ǄǚǨǚǦǖǩǦǘ", "Matrix", "Static IP", "U", "U", "U", "80.70.224.2>80.70.224.4", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Sankt-Peterburg", "ǆǕǣǠǨ-ǄǚǨǚǦǖǩǦǘ", "Nienshants", "Static IP", "U", "U", "U", "U", "U", "N", "N", "N", "1", "1", "1", "1", "N", "N", "N", "10.0.0.0>255.0.0.0>0.0.0.0>>WAN"],
["Sankt-Peterburg", "ǆǕǣǠǨ-ǄǚǨǚǦǖǩǦǘ", "Ozerki.Net", "PPTP", "U", "U", "U", "U", "U", "U", "U", "vpn.ozerki.net", "1", "1", "1", "1", "N", "N", "N", "192.168.27.0>255.255.255.0>0.0.0.0>>WAN<192.168.32.0>255.255.224.0>0.0.0.0>>WAN<192.168.56.0>255.255.248.0>0.0.0.0>>WAN<192.168.64.0>255.255.255.192>0.0.0.0>>WAN<217.170.93.0>255.255.255.0>0.0.0.0>>WAN<10.4.0.0>255.255.0.0>0.0.0.0>>WAN<10.11.0.0>255.255.0.0>0.0.0.0>>WAN<10.12.0.0>255.252.0.0>0.0.0.0>>WAN<10.16.0.0>255.240.0.0>0.0.0.0>>WAN<10.32.0.0>255.224.0.0>0.0.0.0>>WAN"],
["Sankt-Peterburg", "ǆǕǣǠǨ-ǄǚǨǚǦǖǩǦǘ", "SatNet", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Sankt-Peterburg", "ǆǕǣǠǨ-ǄǚǨǚǦǖǩǦǘ", "Sky Net", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Saratov =
[["Saratov", "ǆǕǦǕǨǤǗ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Saratov", "ǆǕǦǕǨǤǗ", "Corbina", "L2TP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "tp.corbina.net", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Severodvinsk =
[["Severodvinsk", "ǆǚǗǚǦǤǙǗǞǣǧǠ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Smolensk =
[["Smolensk", "ǆǢǤǡǚǣǧǠ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Sochi =
[["Sochi", "ǆǤǭǞ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Tver =
[["Tver", "ǇǗǚǦǲ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Togliatti =
[["Togliatti", "ǇǤǡǲǵǨǨǞ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Togliatti", "ǇǤǡǲǵǨǨǞ", "Golden Telecom", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "fttb-vpn.samara.golden.ru", "1", "1", "1", "1", "N", "N", "N", "10.0.0.0>255.0.0.0>0.0.0.0>>WAN"],
["Togliatti", "ǇǤǡǲǵǨǨǞ", "Togliatti-Telecom", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "10.0.2.2", "1", "1", "1", "0", "N", "N", "N", "N"],
["Tula", "ǇǩǡǕ", "Altair", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Tula", "ǇǩǡǕ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Tula", "ǇǩǡǕ", "Corbina", "L2TP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "tp.corbina.net", "1", "1", "1", "0", "N", "N", "N", "N"],
["Tula", "ǇǩǡǕ", "Enforta", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "N", "0", "0", "1", "0", "N", "N", "N", "N"],
["Tula", "ǇǩǡǕ", "Garant", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "N", "0", "0", "1", "0", "N", "N", "N", "N"],
["Tula", "ǇǩǡǕ", "ITService", "Static IP", "U", "U", "U", "U", "U", "N", "N", "N", "0", "1", "1", "0", "N", "N", "N", "N"],
["Tula", "ǇǩǡǕ", "Sun-Link", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "N", "0", "0", "1", "0", "N", "N", "N", "N"]];
var Tutaev =
[["Tutaev", "ǇǩǨǕǚǗ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Tumen =
[["Tumen", "ǇǴǢǚǣǲ", "DOM.RU", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Uzlovaya =
[["Uzlovaya", "ȾǦǕǧǣǤǙǕǦ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Ulyanovsk =
[["Ulyanovsk", "ǈǡǲǵǣǤǗǧǠ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Ulyanovsk", "ǈǡǲǵǣǤǗǧǠ", "Corbina", "L2TP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "tp.corbina.net", "1", "1", "1", "0", "N", "N", "N", "N"],
["Ulyanovsk", "ǈǡǲǵǣǤǗǧǠ", "Dars IP", "Static IP", "U", "U", "U", "U", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Ulyanovsk", "ǈǡǲǵǣǤǗǧǠ", "Strim", "Static IP", "U", "U", "U", "U", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Ulyanovsk", "ǈǡǲǵǣǤǗǧǠ", "Ultramarine", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "U", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Ufa =
[["Ufa", "ǈǪǕ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Ufa", "ǈǪǕ", "NetTrans", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "10.10.0.1", "1", "1", "1", "0", "N", "N", "N", "N"],
["Ufa", "ǈǪǕ", "Ufanet(Auto)", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "vpn.ufanet.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Ufa", "ǈǪǕ", "Ufanet(Static)", "PPTP", "U", "U", "U", "U", "U", "U", "U", "vpn.ufanet.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Khabarovsk =
[["Khabarovsk", "ǊǕǖǕǦǤǗǧǠ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Cheboksari =
[["Cheboksari", "ǌǚǖǤǠǧǕǦǱ", "Internet-Center(Chebnet)", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "vpn.chebnet.com", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Chelabinsk =
[["Chelabinsk", "ǌǚǡǵǖǞǣǧǠ", "DOM.RU", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Chelabinsk", "ǌǚǡǵǖǞǣǧǠ", "Insit", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.insit.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Chelabinsk", "ǌǚǡǵǖǞǣǧǠ", "Intersviaz", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Chelabinsk", "ǌǚǡǵǖǞǣǧǠ", "Intersviaz", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.chelcom.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Chelabinsk", "ǌǚǡǵǖǞǣǧǠ", "Trigor", "PPTP (vpn)", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "vpn.trigor.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Chelabinsk", "ǌǚǡǵǖǞǣǧǠ", "Trigor", "PPTP (unlim)", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "unlim.trigor.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Chelabinsk", "ǌǚǡǵǖǞǣǧǠ", "U-net(auto)", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "U", "1", "1", "1", "0", "N", "N", "N", "N"],
["Chelabinsk", "ǌǚǡǵǖǞǣǧǠ", "U-net(static)", "PPTP", "U", "U", "U", "U", "N", "U", "U", "U", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Cherepovez =
[["Cherepovez", "ǌǚǦǚǥǤǗǚǬ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Shatura =
[["Shatura", "ǍǕǨǩǦǕ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Schekino =
[["Schekino", "ǎǶar ǠǞǣǤ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Elektrostal =
[["Elektrostal", "ǒǡǚǠǨǦǤǧǨǕǡǲ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Engels =
[["Engels", "ǒǣǘǚǡǲǧ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"]];
var Yaroslavl =
[["Yaroslavl", "ǔǦǤǧǡǕǗǡǲ", "Beeline", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "vpn.internet.beeline.ru", "1", "1", "1", "0", "N", "N", "N", "N"],
["Yaroslavl", "ǔǦǤǧǡǕǗǡǲ", "Corbina", "L2TP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "tp.corbina.net", "1", "1", "1", "0", "N", "N", "N", "N"],
["Yaroslavl", "ǔǦǤǧǡǕǗǡǲ", "LANK Telecom", "PPTP", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "U", "U", "U", "213.150.65.248", "1", "1", "1", "0", "N", "N", "N", "N"],
["Yaroslavl", "ǔǦǤǧǡǕǗǡǲ", "LANK Telecom", "PPPOE", "0.0.0.0", "0.0.0.0", "0.0.0.0", "Auto", "N", "U", "U", "N", "1", "1", "1", "0", "N", "N", "N", "N"],
["Yaroslavl", "ǔǦǤǧǡǕǗǡǲ", "RTS Ribinsk", "Static IP", "U", "U", "U", "U", "U", "N", "N", "N", "1", "1", "1", "0", "N", "N", "N", "N"]];
