/* lzo_supp.h -- architecture, OS and compiler specific defines

   This file is part of the LZO real-time data compression library.

   Copyright (C) 1996-2014 Markus Franz Xaver Johannes Oberhumer
   All Rights Reserved.

   The LZO library is free software; you can redistribute it and/or
   modify it under the terms of the GNU General Public License as
   published by the Free Software Foundation; either version 2 of
   the License, or (at your option) any later version.

   The LZO library is distributed in the hope that it will be useful,
   but WITHOUT ANY WARRANTY; without even the implied warranty of
   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
   GNU General Public License for more details.

   You should have received a copy of the GNU General Public License
   along with the LZO library; see the file COPYING.
   If not, write to the Free Software Foundation, Inc.,
   51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA.

   Markus F.X.J. Oberhumer
   <markus@oberhumer.com>
   http://www.oberhumer.com/opensource/lzo/
 */


#ifndef __LZO_SUPP_H_INCLUDED
#define __LZO_SUPP_H_INCLUDED 1
#if (LZO_CFG_NO_CONFIG_HEADER)
#elif defined(LZO_CFG_CONFIG_HEADER)
#else
#if !(LZO_CFG_AUTO_NO_HEADERS)
#if (LZO_LIBC_NAKED)
#elif (LZO_LIBC_FREESTANDING)
#  define HAVE_LIMITS_H 1
#  define HAVE_STDARG_H 1
#  define HAVE_STDDEF_H 1
#elif (LZO_LIBC_MOSTLY_FREESTANDING)
#  define HAVE_LIMITS_H 1
#  define HAVE_SETJMP_H 1
#  define HAVE_STDARG_H 1

LZOLIB_EXTERN(void, lzo_ua_set_be32) (lzo_hvoid_p, lzo_uint32l_t);
LZOLIB_EXTERN(unsigned, lzo_ua_get_le16) (const lzo_hvoid_p);
LZOLIB_EXTERN(lzo_uint32l_t, lzo_ua_get_le24) (const lzo_hvoid_p);
LZOLIB_EXTERN(lzo_uint32l_t, lzo_ua_get_le32) (const lzo_hvoid_p);
LZOLIB_EXTERN(void, lzo_ua_set_le16) (lzo_hvoid_p, unsigned);
LZOLIB_EXTERN(void, lzo_ua_set_le24) (lzo_hvoid_p, lzo_uint32l_t);
LZOLIB_EXTERN(void, lzo_ua_set_le32) (lzo_hvoid_p, lzo_uint32l_t);
#if defined(lzo_int64l_t)
LZOLIB_EXTERN(lzo_uint64l_t, lzo_ua_get_be64) (const lzo_hvoid_p);
LZOLIB_EXTERN(void, lzo_ua_set_be64) (lzo_hvoid_p, lzo_uint64l_t);
LZOLIB_EXTERN(lzo_uint64l_t, lzo_ua_get_le64) (const lzo_hvoid_p);
LZOLIB_EXTERN(void, lzo_ua_set_le64) (lzo_hvoid_p, lzo_uint64l_t);
#endif
LZOLIB_EXTERN_NOINLINE(short, lzo_vget_short) (short, int);
LZOLIB_EXTERN_NOINLINE(int, lzo_vget_int) (int, int);
LZOLIB_EXTERN_NOINLINE(long, lzo_vget_long) (long, int);
#if defined(lzo_int64l_t)
LZOLIB_EXTERN_NOINLINE(lzo_int64l_t, lzo_vget_lzo_int64l_t) (lzo_int64l_t, int);
#endif
LZOLIB_EXTERN_NOINLINE(lzo_hsize_t, lzo_vget_lzo_hsize_t) (lzo_hsize_t, int);
#if !(LZO_CFG_NO_FLOAT)
LZOLIB_EXTERN_NOINLINE(float, lzo_vget_float) (float, int);
#endif
#if !(LZO_CFG_NO_DOUBLE)
LZOLIB_EXTERN_NOINLINE(double, lzo_vget_double) (double, int);
#endif
LZOLIB_EXTERN_NOINLINE(lzo_hvoid_p, lzo_vget_lzo_hvoid_p) (lzo_hvoid_p, int);
LZOLIB_EXTERN_NOINLINE(const lzo_hvoid_p, lzo_vget_lzo_hvoid_cp) (const lzo_hvoid_p, int);
#if !defined(LZO_FN_PATH_MAX)
#if (LZO_OS_DOS16 || LZO_OS_WIN16)
#  define LZO_FN_PATH_MAX   143
#elif (LZO_OS_DOS32 || LZO_OS_OS2 || LZO_OS_OS216 || LZO_OS_WIN32 || LZO_OS_WIN64)
#  define LZO_FN_PATH_MAX   259
#elif (LZO_OS_TOS)
#  define LZO_FN_PATH_MAX   259
#endif
#endif
#if !defined(LZO_FN_PATH_MAX)
#  define LZO_FN_PATH_MAX   1023
#endif
#if !defined(LZO_FN_NAME_MAX)
#if (LZO_OS_DOS16 || LZO_OS_WIN16)
#  define LZO_FN_NAME_MAX   12
#elif (LZO_ARCH_M68K && LZO_OS_TOS && (LZO_CC_PUREC || LZO_CC_TURBOC))
#  define LZO_FN_NAME_MAX   12
#elif (LZO_OS_DOS32 && LZO_CC_GNUC) && defined(__DJGPP__)
#elif (LZO_OS_DOS32)
#  define LZO_FN_NAME_MAX   12
#endif
#endif
#if !defined(LZO_FN_NAME_MAX)
#  define LZO_FN_NAME_MAX   LZO_FN_PATH_MAX
#endif
#define LZO_FNMATCH_NOESCAPE        1
#define LZO_FNMATCH_PATHNAME        2
#define LZO_FNMATCH_PATHSTAR        4
#define LZO_FNMATCH_PERIOD          8
#define LZO_FNMATCH_ASCII_CASEFOLD  16
LZOLIB_EXTERN(int, lzo_fnmatch) (const lzo_hchar_p, const lzo_hchar_p, int);
#undef __LZOLIB_USE_OPENDIR
#if (HAVE_DIRENT_H || LZO_CC_WATCOMC)
#  define __LZOLIB_USE_OPENDIR 1
#  if (LZO_OS_DOS32 && defined(__BORLANDC__))
#  elif (LZO_OS_DOS32 && LZO_CC_GNUC) && defined(__DJGPP__)
#  elif (LZO_OS_OS2 || LZO_OS_OS216)
#  elif (LZO_ARCH_M68K && LZO_OS_TOS && LZO_CC_GNUC)
#  elif (LZO_OS_WIN32 && !(LZO_HAVE_WINDOWS_H))
#  elif (LZO_OS_DOS16 || LZO_OS_DOS32 || LZO_OS_OS2 || LZO_OS_OS216 || LZO_OS_TOS || LZO_OS_WIN16 || LZO_OS_WIN32 || LZO_OS_WIN64)
#    undef __LZOLIB_USE_OPENDIR
#  endif
#endif
typedef struct
{
#if defined(__LZOLIB_USE_OPENDIR)
    void* u_dirp;
# if (LZO_CC_WATCOMC)
    unsigned short f_time;
    unsigned short f_date;
    unsigned long f_size;
# endif
    char f_name[LZO_FN_NAME_MAX+1];
#elif (LZO_OS_WIN32 || LZO_OS_WIN64)
    lzolib_handle_t u_handle;
    unsigned f_attr;
    unsigned f_size_low;
    unsigned f_size_high;
    char f_name[LZO_FN_NAME_MAX+1];
#elif (LZO_OS_DOS16 || LZO_OS_DOS32 || LZO_OS_TOS || LZO_OS_WIN16)
    char u_dta[21];
    unsigned char f_attr;
    unsigned short f_time;
    unsigned short f_date;
    unsigned short f_size_low;
    unsigned short f_size_high;
    char f_name[LZO_FN_NAME_MAX+1];
    char u_dirp;
#else
    void* u_dirp;
    char f_name[LZO_FN_NAME_MAX+1];
#endif
} lzo_dir_t;
#ifndef lzo_dir_p
#define lzo_dir_p lzo_dir_t *
#endif
LZOLIB_EXTERN(int, lzo_opendir)  (lzo_dir_p, const char*);
LZOLIB_EXTERN(int, lzo_readdir)  (lzo_dir_p);
LZOLIB_EXTERN(int, lzo_closedir) (lzo_dir_p);
#if (LZO_CC_GNUC) && (defined(__CYGWIN__) || defined(__MINGW32__))
#  define lzo_alloca(x)     __builtin_alloca((x))
#elif (LZO_CC_GNUC) && (LZO_OS_CONSOLE_PS2)
#  define lzo_alloca(x)     __builtin_alloca((x))
#elif (LZO_CC_BORLANDC || LZO_CC_LCC) && defined(__linux__)
#elif (HAVE_ALLOCA)
#  define lzo_alloca(x)     LZO_STATIC_CAST(void *, alloca((x)))
#endif
#if (LZO_OS_DOS32 && LZO_CC_GNUC) && defined(__DJGPP__)
#  define lzo_stackavail()  stackavail()
#elif (LZO_ARCH_I086 && LZO_CC_BORLANDC && (__BORLANDC__ >= 0x0410))
#  define lzo_stackavail()  stackavail()
#elif (LZO_ARCH_I086 && LZO_CC_BORLANDC && (__BORLANDC__ >= 0x0400))
#  if (LZO_OS_WIN16) && (LZO_MM_TINY || LZO_MM_SMALL || LZO_MM_MEDIUM)
#  else
#    define lzo_stackavail()  stackavail()
#  endif
#elif ((LZO_ARCH_I086 || LZO_ARCH_I386) && (LZO_CC_DMC || LZO_CC_SYMANTECC))
#  define lzo_stackavail()  stackavail()
#elif ((LZO_ARCH_I086) && LZO_CC_MSC && (_MSC_VER >= 700))
#  define lzo_stackavail()  _stackavail()
#elif ((LZO_ARCH_I086) && LZO_CC_MSC)
#  define lzo_stackavail()  stackavail()
#elif ((LZO_ARCH_I086 || LZO_ARCH_I386) && LZO_CC_TURBOC && (__TURBOC__ >= 0x0450))
#  define lzo_stackavail()  stackavail()
#elif (LZO_ARCH_I086 && LZO_CC_TURBOC && (__TURBOC__ >= 0x0400))
   LZO_EXTERN_C size_t __cdecl stackavail(void);
#  define lzo_stackavail()  stackavail()
#elif ((LZO_ARCH_I086 || LZO_ARCH_I386) && (LZO_CC_WATCOMC))
#  define lzo_stackavail()  stackavail()
#elif (LZO_ARCH_I086 && LZO_CC_ZORTECHC)
#  define lzo_stackavail()  _chkstack()
#endif
LZOLIB_EXTERN(lzo_intptr_t, lzo_get_osfhandle) (int);
LZOLIB_EXTERN(const char *, lzo_getenv) (const char *);
LZOLIB_EXTERN(int, lzo_isatty) (int);
LZOLIB_EXTERN(int, lzo_mkdir) (const char*, unsigned);
LZOLIB_EXTERN(int, lzo_rmdir) (const char*);
LZOLIB_EXTERN(int, lzo_response) (int*, char***);
LZOLIB_EXTERN(int, lzo_set_binmode) (int, int);
#if defined(lzo_int32e_t)
LZOLIB_EXTERN(lzo_int32e_t, lzo_muldiv32s) (lzo_int32e_t, lzo_int32e_t, lzo_int32e_t);
LZOLIB_EXTERN(lzo_uint32e_t, lzo_muldiv32u) (lzo_uint32e_t, lzo_uint32e_t, lzo_uint32e_t);
#endif
LZOLIB_EXTERN(void, lzo_wildargv) (int*, char***);
LZOLIB_EXTERN_NOINLINE(void, lzo_debug_break) (void);
LZOLIB_EXTERN_NOINLINE(void, lzo_debug_nop) (void);
LZOLIB_EXTERN_NOINLINE(int, lzo_debug_align_check_query) (void);
LZOLIB_EXTERN_NOINLINE(int, lzo_debug_align_check_enable) (int);
LZOLIB_EXTERN_NOINLINE(unsigned, lzo_debug_running_on_qemu) (void);
LZOLIB_EXTERN_NOINLINE(unsigned, lzo_debug_running_on_valgrind) (void);
#if defined(lzo_int32e_t)
LZOLIB_EXTERN(int, lzo_tsc_read) (lzo_uint32e_t*);
#endif
struct lzo_pclock_handle_t;
struct lzo_pclock_t;
typedef struct lzo_pclock_handle_t lzo_pclock_handle_t;
typedef struct lzo_pclock_t lzo_pclock_t;
#ifndef lzo_pclock_handle_p
#define lzo_pclock_handle_p lzo_pclock_handle_t *
#endif
#ifndef lzo_pclock_p
#define lzo_pclock_p lzo_pclock_t *
#endif
#define LZO_PCLOCK_REALTIME             0
#define LZO_PCLOCK_MONOTONIC            1
#define LZO_PCLOCK_PROCESS_CPUTIME_ID   2
#define LZO_PCLOCK_THREAD_CPUTIME_ID    3
typedef int (*lzo_pclock_gettime_t) (lzo_pclock_handle_p, lzo_pclock_p);
struct lzo_pclock_handle_t {
    lzolib_handle_t h;
    int mode;
    int read_error;
    const char* name;
    lzo_pclock_gettime_t gettime;
#if defined(lzo_int64l_t)
    lzo_uint64l_t ticks_base;
#endif
};
struct lzo_pclock_t {
#if defined(lzo_int64l_t)
    lzo_int64l_t tv_sec;
#else
    lzo_int32l_t tv_sec_high;
    lzo_uint32l_t tv_sec_low;
#endif
    lzo_uint32l_t tv_nsec;
};
LZOLIB_EXTERN(int, lzo_pclock_open)  (lzo_pclock_handle_p, int);
LZOLIB_EXTERN(int, lzo_pclock_open_default) (lzo_pclock_handle_p);
LZOLIB_EXTERN(int, lzo_pclock_close) (lzo_pclock_handle_p);
LZOLIB_EXTERN(void, lzo_pclock_read) (lzo_pclock_handle_p, lzo_pclock_p);
#if !(LZO_CFG_NO_DOUBLE)
LZOLIB_EXTERN(double, lzo_pclock_get_elapsed) (lzo_pclock_handle_p, const lzo_pclock_p, const lzo_pclock_p);
#endif
LZOLIB_EXTERN(int, lzo_pclock_flush_cpu_cache) (lzo_pclock_handle_p, unsigned);
struct lzo_getopt_t;
typedef struct lzo_getopt_t lzo_getopt_t;
#ifndef lzo_getopt_p
#define lzo_getopt_p lzo_getopt_t *
#endif
struct lzo_getopt_longopt_t;
typedef struct lzo_getopt_longopt_t lzo_getopt_longopt_t;
#ifndef lzo_getopt_longopt_p
#define lzo_getopt_longopt_p lzo_getopt_longopt_t *
#endif
struct lzo_getopt_longopt_t {
    const char* name;
    int has_arg;
    int* flag;
    int val;
};
typedef void (*lzo_getopt_opterr_t)(lzo_getopt_p, const char*, void *);
struct lzo_getopt_t {
    void *user;
    const char *progname;
    int bad_option;
    char *optarg;
    lzo_getopt_opterr_t opterr;
    int optind;
    int optopt;
    int errcount;
    int argc; char** argv;
    int eof; int shortpos;
    int pending_rotate_first, pending_rotate_middle;
};
enum { LZO_GETOPT_NO_ARG, LZO_GETOPT_REQUIRED_ARG, LZO_GETOPT_OPTIONAL_ARG, LZO_GETOPT_EXACT_ARG = 0x10 };
enum { LZO_GETOPT_PERMUTE, LZO_GETOPT_RETURN_IN_ORDER, LZO_GETOPT_REQUIRE_ORDER };
LZOLIB_EXTERN(void, lzo_getopt_init) (lzo_getopt_p g,
                                      int start_argc, int argc, char** argv);
LZOLIB_EXTERN(int, lzo_getopt) (lzo_getopt_p g,
                                const char* shortopts,
                                const lzo_getopt_longopt_p longopts,
                                int* longind);
typedef struct {
    lzo_uint32l_t seed;
} lzo_rand31_t;
#ifndef lzo_rand31_p
#define lzo_rand31_p lzo_rand31_t *
#endif
LZOLIB_EXTERN(void, lzo_srand31) (lzo_rand31_p, lzo_uint32l_t);
LZOLIB_EXTERN(lzo_uint32l_t, lzo_rand31) (lzo_rand31_p);
#if defined(lzo_int64l_t)
typedef struct {
    lzo_uint64l_t seed;
} lzo_rand48_t;
#ifndef lzo_rand48_p
#define lzo_rand48_p lzo_rand48_t *
#endif
LZOLIB_EXTERN(void, lzo_srand48) (lzo_rand48_p, lzo_uint32l_t);
LZOLIB_EXTERN(lzo_uint32l_t, lzo_rand48) (lzo_rand48_p);
LZOLIB_EXTERN(lzo_uint32l_t, lzo_rand48_r32) (lzo_rand48_p);
#endif
#if defined(lzo_int64l_t)
typedef struct {
    lzo_uint64l_t seed;
} lzo_rand64_t;
#ifndef lzo_rand64_p
#define lzo_rand64_p lzo_rand64_t *
#endif
LZOLIB_EXTERN(void, lzo_srand64) (lzo_rand64_p, lzo_uint64l_t);
LZOLIB_EXTERN(lzo_uint32l_t, lzo_rand64) (lzo_rand64_p);
LZOLIB_EXTERN(lzo_uint32l_t, lzo_rand64_r32) (lzo_rand64_p);
#endif
typedef struct {
    unsigned n;
    lzo_uint32l_t s[624];
} lzo_randmt_t;
#ifndef lzo_randmt_p
#define lzo_randmt_p lzo_randmt_t *
#endif
LZOLIB_EXTERN(void, lzo_srandmt) (lzo_randmt_p, lzo_uint32l_t);
LZOLIB_EXTERN(lzo_uint32l_t, lzo_randmt) (lzo_randmt_p);
LZOLIB_EXTERN(lzo_uint32l_t, lzo_randmt_r32) (lzo_randmt_p);
#if defined(lzo_int64l_t)
typedef struct {
    unsigned n;
    lzo_uint64l_t s[312];
} lzo_randmt64_t;
#ifndef lzo_randmt64_p
#define lzo_randmt64_p lzo_randmt64_t *
#endif
LZOLIB_EXTERN(void, lzo_srandmt64) (lzo_randmt64_p, lzo_uint64l_t);
LZOLIB_EXTERN(lzo_uint64l_t, lzo_randmt64_r64) (lzo_randmt64_p);
#endif
#define LZO_SPAWN_P_WAIT    0
#define LZO_SPAWN_P_NOWAIT  1
LZOLIB_EXTERN(int, lzo_spawnv)  (int mode, const char* fn, const char* const * argv);
LZOLIB_EXTERN(int, lzo_spawnvp) (int mode, const char* fn, const char* const * argv);
LZOLIB_EXTERN(int, lzo_spawnve) (int mode, const char* fn, const char* const * argv, const char * const envp);
#endif
#endif
#if defined(LZO_WANT_ACC_CXX_H)
#  undef LZO_WANT_ACC_CXX_H
#ifndef __LZO_CXX_H_INCLUDED
#define __LZO_CXX_H_INCLUDED 1
#if defined(__cplusplus)
#if defined(LZO_CXX_NOTHROW)
#elif (LZO_CC_GNUC && (LZO_CC_GNUC < 0x020800ul))
#elif (LZO_CC_BORLANDC && (__BORLANDC__ < 0x0450))
#elif (LZO_CC_GHS && !defined(__EXCEPTIONS))
#elif (LZO_CC_HIGHC)
#elif (LZO_CC_MSC && (_MSC_VER < 1100))
#elif (LZO_CC_NDPC)
#elif (LZO_CC_TURBOC)
#elif (LZO_CC_WATCOMC && !defined(_CPPUNWIND))
#elif (LZO_CC_ZORTECHC)
#else
#  define LZO_CXX_NOTHROW           throw()
#endif
#if !defined(LZO_CXX_NOTHROW)
#  define LZO_CXX_NOTHROW           /*empty*/
#endif
#if defined(__LZO_CXX_DO_NEW)
#elif (LZO_CC_GHS || LZO_CC_NDPC || LZO_CC_PGI)
#  define __LZO_CXX_DO_NEW          { return 0; }
#elif ((LZO_CC_BORLANDC || LZO_CC_TURBOC) && LZO_ARCH_I086)
#  define __LZO_CXX_DO_NEW          { return 0; }
#else
#  define __LZO_CXX_DO_NEW          ;
#endif
#if defined(__LZO_CXX_DO_DELETE)
#elif (LZO_CC_BORLANDC || LZO_CC_TURBOC)
#  define __LZO_CXX_DO_DELETE       { }
#else
#  define __LZO_CXX_DO_DELETE       LZO_CXX_NOTHROW { }
#endif
#if (LZO_CC_BORLANDC && (__BORLANDC__ < 0x0450))
#elif (LZO_CC_MSC && LZO_MM_HUGE)
#  define LZO_CXX_DISABLE_NEW_DELETE private:
#elif (LZO_CC_MSC && (_MSC_VER < 1100))
#elif (LZO_CC_NDPC)
#elif (LZO_CC_SYMANTECC || LZO_CC_ZORTECHC)
#elif (LZO_CC_TURBOC)
#elif (LZO_CC_WATCOMC && (__WATCOMC__ < 1100))
#else
#  define __LZO_CXX_HAVE_ARRAY_NEW 1
#endif
#if (__LZO_CXX_HAVE_ARRAY_NEW)
#  define __LZO_CXX_HAVE_PLACEMENT_NEW 1
#endif
#if (__LZO_CXX_HAVE_PLACEMENT_NEW)
#  if (LZO_CC_GNUC >= 0x030000ul)
#    define __LZO_CXX_HAVE_PLACEMENT_DELETE 1
#  elif (LZO_CC_INTELC)
#    define __LZO_CXX_HAVE_PLACEMENT_DELETE 1
#  elif (LZO_CC_MSC && (_MSC_VER >= 1200))
#    define __LZO_CXX_HAVE_PLACEMENT_DELETE 1
#  elif (LZO_CC_CLANG || LZO_CC_LLVM || LZO_CC_PATHSCALE)
#    define __LZO_CXX_HAVE_PLACEMENT_DELETE 1
#  elif (LZO_CC_PGI)
#    define __LZO_CXX_HAVE_PLACEMENT_DELETE 1
#  endif
#endif
#if defined(LZO_CXX_DISABLE_NEW_DELETE)
#elif defined(new) || defined(delete)
#  define LZO_CXX_DISABLE_NEW_DELETE private:
#elif (LZO_CC_GNUC && (LZO_CC_GNUC < 0x025b00ul))
#  define LZO_CXX_DISABLE_NEW_DELETE private:
#elif  (LZO_CC_HIGHC)
#  define LZO_CXX_DISABLE_NEW_DELETE private:
#elif !(__LZO_CXX_HAVE_ARRAY_NEW)
#  define LZO_CXX_DISABLE_NEW_DELETE \
        protected: static void operator delete(void*) __LZO_CXX_DO_DELETE \
        protected: static void* operator new(size_t) __LZO_CXX_DO_NEW \
        private:
#else
#  define LZO_CXX_DISABLE_NEW_DELETE \
        protected: static void operator delete(void*) __LZO_CXX_DO_DELETE \
                   static void operator delete[](void*) __LZO_CXX_DO_DELETE \
        private:   static void* operator new(size_t)  __LZO_CXX_DO_NEW \
                   static void* operator new[](size_t) __LZO_CXX_DO_NEW
#endif
#if defined(LZO_CXX_TRIGGER_FUNCTION)
#else
#  define LZO_CXX_TRIGGER_FUNCTION \
        protected: virtual const void* lzo_cxx_trigger_function() const; \
        private:
#endif
#if defined(LZO_CXX_TRIGGER_FUNCTION_IMPL)
#else
#  define LZO_CXX_TRIGGER_FUNCTION_IMPL(klass) \
        const void* klass::lzo_cxx_trigger_function() const { return LZO_STATIC_CAST(const void *, 0); }
#endif
#endif
#endif
#endif
#if defined(LZO_WANT_ACC_CHK_CH)
#  undef LZO_WANT_ACC_CHK_CH
#if !defined(LZOCHK_ASSERT)
#  define LZOCHK_ASSERT(expr)   LZO_COMPILE_TIME_ASSERT_HEADER(expr)
#endif
#if !defined(LZOCHK_ASSERT_SIGN_T)
#  define LZOCHK_ASSERT_SIGN_T(type,relop) \
        LZOCHK_ASSERT( LZO_STATIC_CAST(type, -1)  relop  LZO_STATIC_CAST(type, 0)) \
        LZOCHK_ASSERT( LZO_STATIC_CAST(type, ~LZO_STATIC_CAST(type, 0)) relop  LZO_STATIC_CAST(type, 0)) \
        LZOCHK_ASSERT( LZO_STATIC_CAST(type, ~LZO_STATIC_CAST(type, 0)) ==     LZO_STATIC_CAST(type, -1))
#endif
#if !defined(LZOCHK_ASSERT_IS_SIGNED_T)
#  define LZOCHK_ASSERT_IS_SIGNED_T(type)       LZOCHK_ASSERT_SIGN_T(type,<)
#endif
#if !defined(LZOCHK_ASSERT_IS_UNSIGNED_T)
#  if (LZO_BROKEN_INTEGRAL_PROMOTION)
#    define LZOCHK_ASSERT_IS_UNSIGNED_T(type) \
        LZOCHK_ASSERT( LZO_STATIC_CAST(type, -1) > LZO_STATIC_CAST(type, 0) )
#  else
#    define LZOCHK_ASSERT_IS_UNSIGNED_T(type)   LZOCHK_ASSERT_SIGN_T(type,>)
#  endif
#endif
#if defined(LZOCHK_CFG_PEDANTIC)
#if (LZO_CC_BORLANDC && (__BORLANDC__ >= 0x0550) && (__BORLANDC__ < 0x0560))
#  pragma option push -w-8055
#elif (LZO_CC_BORLANDC && (__BORLANDC__ >= 0x0530) && (__BORLANDC__ < 0x0550))
#  pragma option push -w-osh
#endif
#endif
#if (LZO_0xffffffffL - LZO_UINT32_C(4294967294) != 1)
#  error "preprocessor error"
#endif
#if (LZO_0xffffffffL - LZO_UINT32_C(0xfffffffd) != 2)
#  error "preprocessor error"
#endif
#if +0
#  error "preprocessor error"
#endif
#if -0
#  error "preprocessor error"
#endif
#if +0 != 0
#  error "preprocessor error"
#endif
#if -0 != 0
#  error "preprocessor error"
#endif
#define LZOCHK_VAL  1
#define LZOCHK_TMP1 LZOCHK_VAL
#undef LZOCHK_VAL
#define LZOCHK_VAL  2
#define LZOCHK_TMP2 LZOCHK_VAL
#if (LZOCHK_TMP1 != 2)
#  error "preprocessor error 3a"
#endif
#if (LZOCHK_TMP2 != 2)
#  error "preprocessor error 3b"
#endif
#undef LZOCHK_VAL
#if (LZOCHK_TMP2)
#  error "preprocessor error 3c"
#endif
#if (LZOCHK_TMP2 + 0 != 0)
#  error "preprocessor error 3d"
#endif
#undef LZOCHK_TMP1
#undef LZOCHK_TMP2
#if 0 || defined(LZOCHK_CFG_PEDANTIC)
#  if (LZO_ARCH_MIPS) && defined(_MIPS_SZINT)
    LZOCHK_ASSERT((_MIPS_SZINT) == 8 * sizeof(int))
#  endif
#  if (LZO_ARCH_MIPS) && defined(_MIPS_SZLONG)
    LZOCHK_ASSERT((_MIPS_SZLONG) == 8 * sizeof(long))
#  endif
#  if (LZO_ARCH_MIPS) && defined(_MIPS_SZPTR)
    LZOCHK_ASSERT((_MIPS_SZPTR) == 8 * sizeof(void *))
#  endif
#endif
    LZOCHK_ASSERT(1 == 1)
    LZOCHK_ASSERT(__LZO_MASK_GEN(1u,1) == 1)
    LZOCHK_ASSERT(__LZO_MASK_GEN(1u,2) == 3)
    LZOCHK_ASSERT(__LZO_MASK_GEN(1u,3) == 7)
    LZOCHK_ASSERT(__LZO_MASK_GEN(1u,8) == 255)
#if (SIZEOF_INT >= 2)
    LZOCHK_ASSERT(__LZO_MASK_GEN(1,15) == 32767)
    LZOCHK_ASSERT(__LZO_MASK_GEN(1u,16) == 0xffffU)
    LZOCHK_ASSERT(__LZO_MASK_GEN(0u,16) == 0u)
#else
    LZOCHK_ASSERT(__LZO_MASK_GEN(1ul,16) == 0xffffUL)
    LZOCHK_ASSERT(__LZO_MASK_GEN(0ul,16) == 0ul)
#endif
#if (SIZEOF_INT >= 4)
    LZOCHK_ASSERT(__LZO_MASK_GEN(1,31) == 2147483647)
    LZOCHK_ASSERT(__LZO_MASK_GEN(1u,32) == 0xffffffffU)
    LZOCHK_ASSERT(__LZO_MASK_GEN(0u,32) == 0u)
#endif
#if (SIZEOF_LONG >= 4)
    LZOCHK_ASSERT(__LZO_MASK_GEN(1ul,32) == 0xffffffffUL)
    LZOCHK_ASSERT(__LZO_MASK_GEN(0ul,32) == 0ul)
#endif
#if (SIZEOF_LONG >= 8)
    LZOCHK_ASSERT(__LZO_MASK_GEN(1ul,64) == 0xffffffffffffffffUL)
    LZOCHK_ASSERT(__LZO_MASK_GEN(0ul,64) == 0ul)
#endif
#if !(LZO_BROKEN_INTEGRAL_PROMOTION)
    LZOCHK_ASSERT(__LZO_MASK_GEN(1u,SIZEOF_INT*8) == ~0u)
    LZOCHK_ASSERT(__LZO_MASK_GEN(1ul,SIZEOF_LONG*8) == ~0ul)
#endif
#if 1
    LZOCHK_ASSERT(__LZO_MASK_GEN(0,0) == 0)
    LZOCHK_ASSERT(__LZO_MASK_GEN(1,0) == 0)
    LZOCHK_ASSERT(__LZO_MASK_GEN(2,0) == 0)
    LZOCHK_ASSERT(__LZO_MASK_GEN(4,0) == 0)
#endif
#if 1
    LZOCHK_ASSERT(__LZO_MASK_GEN(2,1) == 2)
    LZOCHK_ASSERT(__LZO_MASK_GEN(4,1) == 4)
    LZOCHK_ASSERT(__LZO_MASK_GEN(8,1) == 8)
    LZOCHK_ASSERT(__LZO_MASK_GEN(2,2) == 2+4)
    LZOCHK_ASSERT(__LZO_MASK_GEN(4,2) == 4+8)
    LZOCHK_ASSERT(__LZO_MASK_GEN(8,2) == 8+16)
    LZOCHK_ASSERT(__LZO_MASK_GEN(2,3) == 2+4+8)
    LZOCHK_ASSERT(__LZO_MASK_GEN(4,3) == 4+8+16)
    LZOCHK_ASSERT(__LZO_MASK_GEN(8,3) == 8+16+32)
    LZOCHK_ASSERT(__LZO_MASK_GEN(7,1) == 7)
    LZOCHK_ASSERT(__LZO_MASK_GEN(7,2) == 7+14)
    LZOCHK_ASSERT(__LZO_MASK_GEN(7,3) == 7+14+28)
#endif
#if !(LZO_BROKEN_SIGNED_RIGHT_SHIFT)
    LZOCHK_ASSERT(((-1) >> 7) == -1)
#endif
    LZOCHK_ASSERT(((1)  >> 7) == 0)
#if (LZO_CC_INTELC && (__INTEL_COMPILER >= 900))
#  pragma warning(push)
#  pragma warning(disable: 1025)
#endif
    LZOCHK_ASSERT((~0l  & ~0)  == ~0l)
    LZOCHK_ASSERT((~0l  & ~0u) == ~0u)
    LZOCHK_ASSERT((~0ul & ~0)  == ~0ul)
    LZOCHK_ASSERT((~0ul & ~0u) == ~0u)
#if defined(__MSDOS__) && defined(__TURBOC__) && (__TURBOC__ < 0x0150)
#elif (SIZEOF_INT == 2)
    LZOCHK_ASSERT((~0l  & ~0u) == 0xffffU)
    LZOCHK_ASSERT((~0ul & ~0u) == 0xffffU)
#elif (SIZEOF_INT == 4)
    LZOCHK_ASSERT((~0l  & ~0u) == 0xffffffffU)
    LZOCHK_ASSERT((~0ul & ~0u) == 0xffffffffU)
#endif
#if (LZO_CC_INTELC && (__INTEL_COMPILER >= 900))
#  pragma warning(pop)
#endif
    LZOCHK_ASSERT_IS_SIGNED_T(signed char)
    LZOCHK_ASSERT_IS_UNSIGNED_T(unsigned char)
    LZOCHK_ASSERT(sizeof(signed char) == sizeof(char))
    LZOCHK_ASSERT(sizeof(unsigned char) == sizeof(char))
    LZOCHK_ASSERT(sizeof(char) == 1)
#if (LZO_CC_CILLY) && (!defined(__CILLY__) || (__CILLY__ < 0x010302L))
#else
    LZOCHK_ASSERT(sizeof(char) == sizeof(LZO_STATIC_CAST(char, 0)))
#endif
#if defined(__cplusplus)
    LZOCHK_ASSERT(sizeof('\0') == sizeof(char))
#else
#  if (LZO_CC_DMC)
#  else
    LZOCHK_ASSERT(sizeof('\0') == sizeof(int))
#  endif
#endif
#if defined(__lzo_alignof)
    LZOCHK_ASSERT(__lzo_alignof(char) == 1)
    LZOCHK_ASSERT(__lzo_alignof(signed char) == 1)
    LZOCHK_ASSERT(__lzo_alignof(unsigned char) == 1)
#if defined(lzo_int16e_t)
    LZOCHK_ASSERT(__lzo_alignof(lzo_int16e_t) >= 1)
    LZOCHK_ASSERT(__lzo_alignof(lzo_int16e_t) <= 2)
#endif
#if defined(lzo_int32e_t)
    LZOCHK_ASSERT(__lzo_alignof(lzo_int32e_t) >= 1)
    LZOCHK_ASSERT(__lzo_alignof(lzo_int32e_t) <= 4)
#endif
#endif
    LZOCHK_ASSERT_IS_SIGNED_T(short)
    LZOCHK_ASSERT_IS_UNSIGNED_T(unsigned short)
    LZOCHK_ASSERT(sizeof(short) == sizeof(unsigned short))
#if !(LZO_ABI_I8LP16)
    LZOCHK_ASSERT(sizeof(short) >= 2)
#endif
    LZOCHK_ASSERT(sizeof(short) >= sizeof(char))
#if (LZO_CC_CILLY) && (!defined(__CILLY__) || (__CILLY__ < 0x010302L))
#else
    LZOCHK_ASSERT(sizeof(short) == sizeof(LZO_STATIC_CAST(short, 0)))
#endif
#if (SIZEOF_SHORT > 0)
    LZOCHK_ASSERT(sizeof(short) == SIZEOF_SHORT)
#endif
    LZOCHK_ASSERT_IS_SIGNED_T(int)
    LZOCHK_ASSERT_IS_UNSIGNED_T(unsigned int)
    LZOCHK_ASSERT(sizeof(int) == sizeof(unsigned int))
#if !(LZO_ABI_I8LP16)
    LZOCHK_ASSERT(sizeof(int) >= 2)
#endif
    LZOCHK_ASSERT(sizeof(int) >= sizeof(short))
    LZOCHK_ASSERT(sizeof(int) == sizeof(0))
    LZOCHK_ASSERT(sizeof(int) == sizeof(LZO_STATIC_CAST(int, 0)))
#if (SIZEOF_INT > 0)
    LZOCHK_ASSERT(sizeof(int) == SIZEOF_INT)
#endif
    LZOCHK_ASSERT(sizeof(0) == sizeof(int))
    LZOCHK_ASSERT_IS_SIGNED_T(long)
    LZOCHK_ASSERT_IS_UNSIGNED_T(unsigned long)
    LZOCHK_ASSERT(sizeof(long) == sizeof(unsigned long))
#if !(LZO_ABI_I8LP16)
    LZOCHK_ASSERT(sizeof(long) >= 4)
#endif
    LZOCHK_ASSERT(sizeof(long) >= sizeof(int))
    LZOCHK_ASSERT(sizeof(long) == sizeof(0L))
    LZOCHK_ASSERT(sizeof(long) == sizeof(LZO_STATIC_CAST(long, 0)))
#if (SIZEOF_LONG > 0)
    LZOCHK_ASSERT(sizeof(long) == SIZEOF_LONG)
#endif
    LZOCHK_ASSERT(sizeof(0L) == sizeof(long))
    LZOCHK_ASSERT_IS_UNSIGNED_T(size_t)
    LZOCHK_ASSERT(sizeof(size_t) >= sizeof(int))
    LZOCHK_ASSERT(sizeof(size_t) == sizeof(sizeof(0)))
#if (SIZEOF_SIZE_T > 0)
    LZOCHK_ASSERT(sizeof(size_t) == SIZEOF_SIZE_T)
#endif
    LZOCHK_ASSERT_IS_SIGNED_T(ptrdiff_t)
    LZOCHK_ASSERT(sizeof(ptrdiff_t) >= sizeof(int))
    LZOCHK_ASSERT(sizeof(ptrdiff_t) >= sizeof(size_t))
#if !(LZO_BROKEN_SIZEOF)
    LZOCHK_ASSERT(sizeof(ptrdiff_t) == sizeof(LZO_STATIC_CAST(char*, 0) - LZO_STATIC_CAST(char*, 0)))
# if (LZO_HAVE_MM_HUGE_PTR)
    LZOCHK_ASSERT(4 == sizeof(LZO_STATIC_CAST(char __huge*, 0) - LZO_STATIC_CAST(char __huge*, 0)))
# endif
#endif
#if (SIZEOF_PTRDIFF_T > 0)
    LZOCHK_ASSERT(sizeof(ptrdiff_t) == SIZEOF_PTRDIFF_T)
#endif
    LZOCHK_ASSERT(sizeof(void*) >= sizeof(char*))
#if (SIZEOF_VOID_P > 0)
    LZOCHK_ASSERT(sizeof(void*) == SIZEOF_VOID_P)
    LZOCHK_ASSERT(sizeof(char*) == SIZEOF_VOID_P)
#endif
#if (LZO_HAVE_MM_HUGE_PTR)
    LZOCHK_ASSERT(4 == sizeof(void __huge*))
    LZOCHK_ASSERT(4 == sizeof(char __huge*))
#endif
#if (LZO_ABI_I8LP16)
    LZOCHK_ASSERT((((1u  <<  7) + 1) >>  7) == 1)
    LZOCHK_ASSERT((((1ul << 15) + 1) >> 15) == 1)
#else
    LZOCHK_ASSERT((((1u  << 15) + 1) >> 15) == 1)
    LZOCHK_ASSERT((((1ul << 31) + 1) >> 31) == 1)
#endif
#if defined(LZOCHK_CFG_PEDANTIC)
#if defined(__MSDOS__) && defined(__TURBOC__) && (__TURBOC__ < 0x0150)
#else
    LZOCHK_ASSERT((1   << (8*SIZEOF_INT-1)) < 0)
#endif
#endif
    LZOCHK_ASSERT((1u  << (8*SIZEOF_INT-1)) > 0)
#if defined(LZOCHK_CFG_PEDANTIC)
    LZOCHK_ASSERT((1l  << (8*SIZEOF_LONG-1)) < 0)
#endif
    LZOCHK_ASSERT((1ul << (8*SIZEOF_LONG-1)) > 0)
#if defined(lzo_int16e_t)
    LZOCHK_ASSERT(sizeof(lzo_int16e_t) == 2)
    LZOCHK_ASSERT(sizeof(lzo_int16e_t) == LZO_SIZEOF_LZO_INT16E_T)
    LZOCHK_ASSERT(sizeof(lzo_uint16e_t) == 2)
    LZOCHK_ASSERT(sizeof(lzo_int16e_t) == sizeof(lzo_uint16e_t))
    LZOCHK_ASSERT_IS_SIGNED_T(lzo_int16e_t)
    LZOCHK_ASSERT_IS_UNSIGNED_T(lzo_uint16e_t)
#if defined(__MSDOS__) && defined(__TURBOC__) && (__TURBOC__ < 0x0150)
#else
    LZOCHK_ASSERT((LZO_STATIC_CAST(lzo_uint16e_t, (~LZO_STATIC_CAST(lzo_uint16e_t,0ul))) >> 15) == 1)
#endif
    LZOCHK_ASSERT( LZO_STATIC_CAST(lzo_int16e_t, (1 + ~LZO_STATIC_CAST(lzo_int16e_t, 0))) == 0)
#if defined(LZOCHK_CFG_PEDANTIC)
    LZOCHK_ASSERT( LZO_STATIC_CAST(lzo_uint16e_t, (1 + ~LZO_STATIC_CAST(lzo_uint16e_t, 0))) == 0)
#endif
#endif
#if defined(lzo_int32e_t)
    LZOCHK_ASSERT(sizeof(lzo_int32e_t) == 4)
    LZOCHK_ASSERT(sizeof(lzo_int32e_t) == LZO_SIZEOF_LZO_INT32E_T)
    LZOCHK_ASSERT(sizeof(lzo_uint32e_t) == 4)
    LZOCHK_ASSERT(sizeof(lzo_int32e_t) == sizeof(lzo_uint32e_t))
    LZOCHK_ASSERT_IS_SIGNED_T(lzo_int32e_t)
    LZOCHK_ASSERT(((( LZO_STATIC_CAST(lzo_int32e_t, 1) << 30) + 1) >> 30) == 1)
    LZOCHK_ASSERT_IS_UNSIGNED_T(lzo_uint32e_t)
    LZOCHK_ASSERT(((( LZO_STATIC_CAST(lzo_uint32e_t, 1) << 31) + 1) >> 31) == 1)
    LZOCHK_ASSERT((LZO_STATIC_CAST(lzo_uint32e_t, (~LZO_STATIC_CAST(lzo_uint32e_t, 0ul))) >> 31) == 1)
    LZOCHK_ASSERT( LZO_STATIC_CAST(lzo_int32e_t, (1 + ~LZO_STATIC_CAST(lzo_int32e_t, 0))) == 0)
#if defined(LZOCHK_CFG_PEDANTIC)
    LZOCHK_ASSERT( LZO_STATIC_CAST(lzo_uint32e_t, (1 + ~LZO_STATIC_CAST(lzo_uint32e_t, 0))) == 0)
#endif
#endif
#if defined(lzo_int32e_t)
    LZOCHK_ASSERT(sizeof(lzo_int32l_t) >= sizeof(lzo_int32e_t))
#endif
    LZOCHK_ASSERT(sizeof(lzo_int32l_t) >= 4)
    LZOCHK_ASSERT(sizeof(lzo_int32l_t) == LZO_SIZEOF_LZO_INT32L_T)
    LZOCHK_ASSERT(sizeof(lzo_uint32l_t) >= 4)
    LZOCHK_ASSERT(sizeof(lzo_int32l_t) == sizeof(lzo_uint32l_t))
    LZOCHK_ASSERT_IS_SIGNED_T(lzo_int32l_t)
    LZOCHK_ASSERT(((( LZO_STATIC_CAST(lzo_int32l_t, 1) << 30) + 1) >> 30) == 1)
    LZOCHK_ASSERT_IS_UNSIGNED_T(lzo_uint32l_t)
    LZOCHK_ASSERT(((( LZO_STATIC_CAST(lzo_uint32l_t, 1) << 31) + 1) >> 31) == 1)
    LZOCHK_ASSERT(sizeof(lzo_int32f_t) >= sizeof(int))
#if defined(lzo_int32e_t)
    LZOCHK_ASSERT(sizeof(lzo_int32f_t) >= sizeof(lzo_int32e_t))
#endif
    LZOCHK_ASSERT(sizeof(lzo_int32f_t) >= sizeof(lzo_int32l_t))
    LZOCHK_ASSERT(sizeof(lzo_int32f_t) >= 4)
    LZOCHK_ASSERT(sizeof(lzo_int32f_t) >= sizeof(lzo_int32l_t))
    LZOCHK_ASSERT(sizeof(lzo_int32f_t) == LZO_SIZEOF_LZO_INT32F_T)
    LZOCHK_ASSERT(sizeof(lzo_uint32f_t) >= 4)
    LZOCHK_ASSERT(sizeof(lzo_uint32f_t) >= sizeof(lzo_uint32l_t))
    LZOCHK_ASSERT(sizeof(lzo_int32f_t) == sizeof(lzo_uint32f_t))
    LZOCHK_ASSERT_IS_SIGNED_T(lzo_int32f_t)
    LZOCHK_ASSERT(((( LZO_STATIC_CAST(lzo_int32f_t, 1) << 30) + 1) >> 30) == 1)
    LZOCHK_ASSERT_IS_UNSIGNED_T(lzo_uint32f_t)
    LZOCHK_ASSERT(((( LZO_STATIC_CAST(lzo_uint32f_t, 1) << 31) + 1) >> 31) == 1)
#if defined(lzo_int64e_t)
    LZOCHK_ASSERT(sizeof(lzo_int64e_t) == 8)
    LZOCHK_ASSERT(sizeof(lzo_int64e_t) == LZO_SIZEOF_LZO_INT64E_T)
    LZOCHK_ASSERT(sizeof(lzo_uint64e_t) == 8)
    LZOCHK_ASSERT(sizeof(lzo_int64e_t) == sizeof(lzo_uint64e_t))
    LZOCHK_ASSERT_IS_SIGNED_T(lzo_int64e_t)
#if (LZO_CC_BORLANDC && (__BORLANDC__ < 0x0530))
#else
    LZOCHK_ASSERT_IS_UNSIGNED_T(lzo_uint64e_t)
#endif
#endif
#if defined(lzo_int64l_t)
#if defined(lzo_int64e_t)
    LZOCHK_ASSERT(sizeof(lzo_int64l_t) >= sizeof(lzo_int64e_t))
#endif
    LZOCHK_ASSERT(sizeof(lzo_int64l_t) >= 8)
    LZOCHK_ASSERT(sizeof(lzo_int64l_t) == LZO_SIZEOF_LZO_INT64L_T)
    LZOCHK_ASSERT(sizeof(lzo_uint64l_t) >= 8)
    LZOCHK_ASSERT(sizeof(lzo_int64l_t) == sizeof(lzo_uint64l_t))
    LZOCHK_ASSERT_IS_SIGNED_T(lzo_int64l_t)
    LZOCHK_ASSERT(((( LZO_STATIC_CAST(lzo_int64l_t, 1) << 62) + 1) >> 62) == 1)
    LZOCHK_ASSERT(((( LZO_INT64_C(1) << 62) + 1) >> 62) == 1)
#if (LZO_CC_BORLANDC && (__BORLANDC__ < 0x0530))
#else
    LZOCHK_ASSERT_IS_UNSIGNED_T(lzo_uint64l_t)
    LZOCHK_ASSERT(LZO_UINT64_C(18446744073709551615)     > 0)
#endif
    LZOCHK_ASSERT(((( LZO_STATIC_CAST(lzo_uint64l_t, 1) << 63) + 1) >> 63) == 1)
    LZOCHK_ASSERT(((( LZO_UINT64_C(1) << 63) + 1) >> 63) == 1)
#if (LZO_CC_GNUC && (LZO_CC_GNUC < 0x020600ul))
    LZOCHK_ASSERT(LZO_INT64_C(9223372036854775807)       > LZO_INT64_C(0))
#else
    LZOCHK_ASSERT(LZO_INT64_C(9223372036854775807)       > 0)
#endif
    LZOCHK_ASSERT(LZO_INT64_C(-9223372036854775807) - 1  < 0)
    LZOCHK_ASSERT( LZO_INT64_C(9223372036854775807) % LZO_INT32_C(2147483629)  == 721)
    LZOCHK_ASSERT( LZO_INT64_C(9223372036854775807) % LZO_INT32_C(2147483647)  == 1)
    LZOCHK_ASSERT(LZO_UINT64_C(9223372036854775807) % LZO_UINT32_C(2147483629) == 721)
    LZOCHK_ASSERT(LZO_UINT64_C(9223372036854775807) % LZO_UINT32_C(2147483647) == 1)
#endif
#if defined(lzo_int64f_t)
#if defined(lzo_int64e_t)
    LZOCHK_ASSERT(sizeof(lzo_int64f_t) >= sizeof(lzo_int64e_t))
#endif
    LZOCHK_ASSERT(sizeof(lzo_int64f_t) >= sizeof(lzo_int64l_t))
    LZOCHK_ASSERT(sizeof(lzo_int64f_t) >= 8)
    LZOCHK_ASSERT(sizeof(lzo_int64f_t) >= sizeof(lzo_int64l_t))
    LZOCHK_ASSERT(sizeof(lzo_int64f_t) == LZO_SIZEOF_LZO_INT64F_T)
    LZOCHK_ASSERT(sizeof(lzo_uint64f_t) >= 8)
    LZOCHK_ASSERT(sizeof(lzo_uint64f_t) >= sizeof(lzo_uint64l_t))
    LZOCHK_ASSERT(sizeof(lzo_int64f_t) == sizeof(lzo_uint64f_t))
    LZOCHK_ASSERT_IS_SIGNED_T(lzo_int64f_t)
#if (LZO_CC_BORLANDC && (__BORLANDC__ < 0x0530))
#else
    LZOCHK_ASSERT_IS_UNSIGNED_T(lzo_uint64f_t)
#endif
#endif
#if !defined(__LZO_INTPTR_T_IS_POINTER)
    LZOCHK_ASSERT_IS_SIGNED_T(lzo_intptr_t)
    LZOCHK_ASSERT_IS_UNSIGNED_T(lzo_uintptr_t)
#endif
    LZOCHK_ASSERT(sizeof(lzo_intptr_t) >= sizeof(void *))
    LZOCHK_ASSERT(sizeof(lzo_intptr_t) == LZO_SIZEOF_LZO_INTPTR_T)
    LZOCHK_ASSERT(sizeof(lzo_intptr_t) == sizeof(lzo_uintptr_t))
#if defined(lzo_word_t)
    LZOCHK_ASSERT(LZO_WORDSIZE == LZO_SIZEOF_LZO_WORD_T)
    LZOCHK_ASSERT_IS_UNSIGNED_T(lzo_word_t)
    LZOCHK_ASSERT_IS_SIGNED_T(lzo_sword_t)
    LZOCHK_ASSERT(sizeof(lzo_word_t) == LZO_SIZEOF_LZO_WORD_T)
    LZOCHK_ASSERT(sizeof(lzo_word_t) == sizeof(lzo_sword_t))
#endif
    LZOCHK_ASSERT(sizeof(lzo_int8_t) == 1)
    LZOCHK_ASSERT(sizeof(lzo_uint8_t) == 1)
    LZOCHK_ASSERT(sizeof(lzo_int8_t) == sizeof(lzo_uint8_t))
    LZOCHK_ASSERT_IS_SIGNED_T(lzo_int8_t)
    LZOCHK_ASSERT_IS_UNSIGNED_T(lzo_uint8_t)
#if defined(LZO_INT16_C)
    LZOCHK_ASSERT(sizeof(LZO_INT16_C(0)) >= 2)
    LZOCHK_ASSERT(sizeof(LZO_UINT16_C(0)) >= 2)
    LZOCHK_ASSERT((LZO_UINT16_C(0xffff) >> 15) == 1)
#endif
#if defined(LZO_INT32_C)
    LZOCHK_ASSERT(sizeof(LZO_INT32_C(0)) >= 4)
    LZOCHK_ASSERT(sizeof(LZO_UINT32_C(0)) >= 4)
    LZOCHK_ASSERT((LZO_UINT32_C(0xffffffff) >> 31) == 1)
#endif
#if defined(LZO_INT64_C)
#if (LZO_CC_BORLANDC && (__BORLANDC__ < 0x0560))
#else
    LZOCHK_ASSERT(sizeof(LZO_INT64_C(0)) >= 8)
    LZOCHK_ASSERT(sizeof(LZO_UINT64_C(0)) >= 8)
#endif
    LZOCHK_ASSERT((LZO_UINT64_C(0xffffffffffffffff) >> 63) == 1)
    LZOCHK_ASSERT((LZO_UINT64_C(0xffffffffffffffff) & ~0)  == LZO_UINT64_C(0xffffffffffffffff))
    LZOCHK_ASSERT((LZO_UINT64_C(0xffffffffffffffff) & ~0l) == LZO_UINT64_C(0xffffffffffffffff))
#if (SIZEOF_INT == 4)
# if (LZO_CC_GNUC && (LZO_CC_GNUC < 0x020000ul))
# else
    LZOCHK_ASSERT((LZO_UINT64_C(0xffffffffffffffff) & (~0u+0u)) == 0xffffffffu)
# endif
#endif
#if (SIZEOF_LONG == 4)
# if (LZO_CC_GNUC && (LZO_CC_GNUC < 0x020000ul))
# else
    LZOCHK_ASSERT((LZO_UINT64_C(0xffffffffffffffff) & (~0ul+0ul)) == 0xfffffffful)
# endif
#endif
#endif
#if (LZO_MM_TINY || LZO_MM_SMALL || LZO_MM_MEDIUM)
    LZOCHK_ASSERT(sizeof(void*) == 2)
    LZOCHK_ASSERT(sizeof(ptrdiff_t) == 2)
#elif (LZO_MM_COMPACT || LZO_MM_LARGE || LZO_MM_HUGE)
    LZOCHK_ASSERT(sizeof(void*) == 4)
#endif
#if (LZO_MM_TINY || LZO_MM_SMALL || LZO_MM_COMPACT)
    LZOCHK_ASSERT(sizeof(void (*)(void)) == 2)
#elif (LZO_MM_MEDIUM || LZO_MM_LARGE || LZO_MM_HUGE)
    LZOCHK_ASSERT(sizeof(void (*)(void)) == 4)
#endif
#if (LZO_ABI_ILP32)
    LZOCHK_ASSERT(sizeof(int) == 4)
    LZOCHK_ASSERT(sizeof(long) == 4)
    LZOCHK_ASSERT(sizeof(void*) == 4)
    LZOCHK_ASSERT(sizeof(ptrdiff_t) == sizeof(void*))
    LZOCHK_ASSERT(sizeof(size_t) == sizeof(void*))
    LZOCHK_ASSERT(sizeof(lzo_intptr_t) == sizeof(void *))
#endif
#if (LZO_ABI_ILP64)
    LZOCHK_ASSERT(sizeof(int) == 8)
    LZOCHK_ASSERT(sizeof(long) == 8)
    LZOCHK_ASSERT(sizeof(void*) == 8)
    LZOCHK_ASSERT(sizeof(ptrdiff_t) == sizeof(void*))
    LZOCHK_ASSERT(sizeof(size_t) == sizeof(void*))
    LZOCHK_ASSERT(sizeof(lzo_intptr_t) == sizeof(void *))
#endif
#if (LZO_ABI_IP32L64)
    LZOCHK_ASSERT(sizeof(int) == 4)
    LZOCHK_ASSERT(sizeof(long) == 8)
    LZOCHK_ASSERT(sizeof(void*) == 4)
    LZOCHK_ASSERT(sizeof(ptrdiff_t) == sizeof(void*))
    LZOCHK_ASSERT(sizeof(size_t) == sizeof(void*))
    LZOCHK_ASSERT(sizeof(lzo_intptr_t) == sizeof(void *))
#endif
#if (LZO_ABI_LLP64)
    LZOCHK_ASSERT(sizeof(int) == 4)
    LZOCHK_ASSERT(sizeof(long) == 4)
    LZOCHK_ASSERT(sizeof(void*) == 8)
    LZOCHK_ASSERT(sizeof(ptrdiff_t) == sizeof(void*))
    LZOCHK_ASSERT(sizeof(size_t) == sizeof(void*))
    LZOCHK_ASSERT(sizeof(lzo_intptr_t) == sizeof(void *))
#endif
#if (LZO_ABI_LP32)
    LZOCHK_ASSERT(sizeof(int) == 2)
    LZOCHK_ASSERT(sizeof(long) == 4)
    LZOCHK_ASSERT(sizeof(void*) == 4)
    LZOCHK_ASSERT(sizeof(lzo_intptr_t) == sizeof(void *))
#endif
#if (LZO_ABI_LP64)
    LZOCHK_ASSERT(sizeof(int) == 4)
    LZOCHK_ASSERT(sizeof(long) == 8)
    LZOCHK_ASSERT(sizeof(void*) == 8)
    LZOCHK_ASSERT(sizeof(ptrdiff_t) == sizeof(void*))
    LZOCHK_ASSERT(sizeof(size_t) == sizeof(void*))
    LZOCHK_ASSERT(sizeof(lzo_intptr_t) == sizeof(void *))
#endif
#if (LZO_ARCH_I086)
    LZOCHK_ASSERT(sizeof(size_t) == 2)
    LZOCHK_ASSERT(sizeof(lzo_intptr_t) == sizeof(void *))
#elif (LZO_ARCH_I386 || LZO_ARCH_M68K)
    LZOCHK_ASSERT(sizeof(size_t) == 4)
    LZOCHK_ASSERT(sizeof(ptrdiff_t) == 4)
    LZOCHK_ASSERT(sizeof(lzo_intptr_t) == sizeof(void *))
#endif
#if (LZO_OS_DOS32 || LZO_OS_OS2 || LZO_OS_WIN32)
    LZOCHK_ASSERT(sizeof(size_t) == 4)
    LZOCHK_ASSERT(sizeof(ptrdiff_t) == 4)
    LZOCHK_ASSERT(sizeof(void (*)(void)) == 4)
#elif (LZO_OS_WIN64)
    LZOCHK_ASSERT(sizeof(size_t) == 8)
    LZOCHK_ASSERT(sizeof(ptrdiff_t) == 8)
    LZOCHK_ASSERT(sizeof(void (*)(void)) == 8)
#endif
#if (LZO_CC_NDPC)
#elif (SIZEOF_INT > 1)
    LZOCHK_ASSERT( LZO_STATIC_CAST(int, LZO_STATIC_CAST(unsigned char, LZO_STATIC_CAST(signed char, -1))) == 255)
#endif
#if defined(LZOCHK_CFG_PEDANTIC)
#if (LZO_CC_KEILC)
#elif (LZO_CC_NDPC)
#elif !(LZO_BROKEN_INTEGRAL_PROMOTION) && (SIZEOF_INT > 1)
    LZOCHK_ASSERT( ((LZO_STATIC_CAST(unsigned char, 128)) << LZO_STATIC_CAST(int, (8*sizeof(int)-8))) < 0)
#endif
#endif
#if defined(LZOCHK_CFG_PEDANTIC)
#if (LZO_CC_BORLANDC && (__BORLANDC__ >= 0x0530) && (__BORLANDC__ < 0x0560))
#  pragma option pop
#endif
#endif
#endif
#if defined(LZO_WANT_ACCLIB_VGET)
#  undef LZO_WANT_ACCLIB_VGET
#define __LZOLIB_VGET_CH_INCLUDED 1
#if !defined(LZOLIB_PUBLIC)
#  define LZOLIB_PUBLIC(r,f)                r __LZOLIB_FUNCNAME(f)
#endif
#if !defined(LZOLIB_PUBLIC_NOINLINE)
#  if !defined(__lzo_noinline)
#    define LZOLIB_PUBLIC_NOINLINE(r,f)     r __LZOLIB_FUNCNAME(f)
