/*
 * Northstar AMAC Ethernet driver
 *
 * 
 */

#include <linux/kernel.h>
#include <linux/module.h>
#include <linux/io.h>
#include <linux/bug.h>
#include <linux/ioport.h>
#include <linux/dmapool.h>
#include <linux/interrupt.h>
#include <linux/netdevice.h>
#include <linux/etherdevice.h>
#include <linux/if_vlan.h>

#undef	_EXTRA_DEBUG

#define	AMAC_MAX_PACKET	(ETH_FRAME_LEN+ETH_FCS_LEN+2*VLAN_HLEN)


/*
 * RESOURCES
 */
static struct resource amac_regs[4] = {
	{
	.name	= "amac0regs", .flags	= IORESOURCE_MEM,
	.start	= 0x18024000, .end	= 0x18024FFF,
	},
	{
	.name	= "amac1regs", .flags	= IORESOURCE_MEM,
	.start	= 0x18025000, .end	= 0x18025FFF,
	},
	{
	.name	= "amac2regs", .flags	= IORESOURCE_MEM,
	.start	= 0x18026000, .end	= 0x18026FFF,
	},
	{
	.name	= "amac3regs", .flags	= IORESOURCE_MEM,
	.start	= 0x18027000, .end	= 0x18027FFF,
	},

};

static struct resource amac_irqs[4] = {
	{
	.name	= "amac0irq",	.flags	= IORESOURCE_IRQ,
	.start	= 179,  .end	= 179,
	},
	{
	.name	= "amac1irq",	.flags	= IORESOURCE_IRQ,
	.start	= 180,	 .end	= 180,
	},
	{
	.name	= "amac2irq",	.flags	= IORESOURCE_IRQ,
	.start	= 181,	 .end	= 181,
	},
	{
	.name	= "amac3irq",	.flags	= IORESOURCE_IRQ,
	.start	= 182,	 .end	= 182,
	},
};

/*
 * REGISTERS
 *
 * Individual bit-fields aof registers are specificed here
 * for clarity, and the rest of the code will access each field
 * as if it was its own register.
 *
 */
#define	REG_BIT_FIELD(r,p,w)	((reg_bit_field_t){(r),(p),(w)})

#define	GMAC_CTL_TX_ARB_MODE		REG_BIT_FIELD(0x0, 0, 1)
#define	GMAC_CTL_RX_OVFLOW_MODE		REG_BIT_FIELD(0x0, 1, 1)
#define	GMAC_CTL_FLOW_CNTLSRC		REG_BIT_FIELD(0x0, 2, 1)
#define	GMAC_CTL_LINKSTAT_SEL		REG_BIT_FIELD(0x0, 3, 1)
#define	GMAC_CTL_MIB_RESET		REG_BIT_FIELD(0x0, 4, 1)
#define	GMAC_CTL_FLOW_CNTL_MODE		REG_BIT_FIELD(0x0, 5, 2)
#define	GMAC_CTL_NWAY_AUTO_POLL		REG_BIT_FIELD(0x0, 7, 1)
#define	GMAC_CTL_TX_FLUSH		REG_BIT_FIELD(0x0, 8, 1)
#define	GMAC_CTL_RXCLK_DMG		REG_BIT_FIELD(0x0, 16, 2)
#define	GMAC_CTL_TXCLK_DMG		REG_BIT_FIELD(0x0, 18, 2)
#define	GMAC_CTL_RXCLK_DLL		REG_BIT_FIELD(0x0, 20, 1)
#define	GMAC_CTL_TXCLK_DLL		REG_BIT_FIELD(0x0, 21, 1)

#define	GMAC_STAT			REG_BIT_FIELD(0x04, 0, 32)
#define	GMAC_STAT_RX_FIFO_FULL		REG_BIT_FIELD(0x04, 0, 1)
#define	GMAC_STAT_RX_DBUF_FULL		REG_BIT_FIELD(0x04, 1, 1)
#define	GMAC_STAT_RX_IBUF_FULL		REG_BIT_FIELD(0x04, 2, 1)
#define	GMAC_STAT_TX_FIFO_FULL		REG_BIT_FIELD(0x04, 3, 1)
#define	GMAC_STAT_TX_DBUF_FULL		REG_BIT_FIELD(0x04, 4, 1)
#define	GMAC_STAT_TX_IBUF_FULL		REG_BIT_FIELD(0x04, 5, 1)
#define	GMAC_STAT_TX_PAUSE		REG_BIT_FIELD(0x04, 6, 1)
#define	GMAC_STAT_TX_IF_MODE		REG_BIT_FIELD(0x04, 7, 2)
#define	GMAC_STAT_RX_Q_SIZE		REG_BIT_FIELD(0x04, 16, 4)
#define	GMAC_STAT_TX_Q_SIZE		REG_BIT_FIELD(0x04, 20, 4)

#define	GMAC_INTSTAT			REG_BIT_FIELD(0x020, 0, 32)
#define	GMAC_INTSTAT_MIB_RX_OVRUN	REG_BIT_FIELD(0x020, 0, 1)
#define	GMAC_INTSTAT_MIB_TX_OVRUN	REG_BIT_FIELD(0x020, 1, 1)
#define	GMAC_INTSTAT_TX_FLUSH_DONE	REG_BIT_FIELD(0x020, 2, 1)
#define	GMAC_INTSTAT_MII_LINK_CHANGE	REG_BIT_FIELD(0x020, 3, 1)
#define	GMAC_INTSTAT_MDIO_DONE		REG_BIT_FIELD(0x020, 4, 1)
#define	GMAC_INTSTAT_MIB_RX_HALF	REG_BIT_FIELD(0x020, 5, 1)
#define	GMAC_INTSTAT_MIB_TX_HALF	REG_BIT_FIELD(0x020, 6, 1)
#define	GMAC_INTSTAT_TIMER_INT		REG_BIT_FIELD(0x020, 7, 1)
#define	GMAC_INTSTAT_SW_LINK_CHANGE	REG_BIT_FIELD(0x020, 8, 1)
#define	GMAC_INTSTAT_DMA_DESC_ERR	REG_BIT_FIELD(0x020, 10, 1)
#define	GMAC_INTSTAT_DMA_DATA_ERR	REG_BIT_FIELD(0x020, 11, 1)
#define	GMAC_INTSTAT_DMA_PROTO_ERR	REG_BIT_FIELD(0x020, 12, 1)
#define	GMAC_INTSTAT_DMA_RX_UNDERFLOW	REG_BIT_FIELD(0x020, 13, 1)
#define	GMAC_INTSTAT_DMA_RX_OVERFLOW	REG_BIT_FIELD(0x020, 14, 1)
#define	GMAC_INTSTAT_DMA_TX_UNDERFLOW	REG_BIT_FIELD(0x020, 15, 1)
#define	GMAC_INTSTAT_RX_INT		REG_BIT_FIELD(0x020, 16, 1)
#define	GMAC_INTSTAT_TX_INT(q)		REG_BIT_FIELD(0x020, 24+(q), 1)
#define	GMAC_INTSTAT_RX_ECC_SOFT	REG_BIT_FIELD(0x020, 28, 1)
#define	GMAC_INTSTAT_RX_ECC_HARD	REG_BIT_FIELD(0x020, 29, 1)
#define	GMAC_INTSTAT_TX_ECC_SOFT	REG_BIT_FIELD(0x020, 30, 1)
#define	GMAC_INTSTAT_TX_ECC_HARD	REG_BIT_FIELD(0x020, 31, 1)

#define	GMAC_INTMASK			REG_BIT_FIELD(0x024, 0, 32)
#define	GMAC_INTMASK_MIB_RX_OVRUN	REG_BIT_FIELD(0x024, 0, 1)
#define	GMAC_INTMASK_MIB_TX_OVRUN	REG_BIT_FIELD(0x024, 1, 1)
#define	GMAC_INTMASK_TX_FLUSH_DONE	REG_BIT_FIELD(0x024, 2, 1)
#define	GMAC_INTMASK_MII_LINK_CHANGE	REG_BIT_FIELD(0x024, 3, 1)
#define	GMAC_INTMASK_MDIO_DONE		REG_BIT_FIELD(0x024, 4, 1)
#define	GMAC_INTMASK_MIB_RX_HALF	REG_BIT_FIELD(0x024, 5, 1)
#define	GMAC_INTMASK_MIB_TX_HALF	REG_BIT_FIELD(0x024, 6, 1)
#define	GMAC_INTMASK_TIMER_INT		REG_BIT_FIELD(0x024, 7, 1)
#define	GMAC_INTMASK_SW_LINK_CHANGE	REG_BIT_FIELD(0x024, 8, 1)
#define	GMAC_INTMASK_DMA_DESC_ERR	REG_BIT_FIELD(0x024, 10, 1)
#define	GMAC_INTMASK_DMA_DATA_ERR	REG_BIT_FIELD(0x024, 11, 1)
#define	GMAC_INTMASK_DMA_PROTO_ERR	REG_BIT_FIELD(0x024, 12, 1)
#define	GMAC_INTMASK_DMA_RX_UNDERFLOW	REG_BIT_FIELD(0x024, 13, 1)
#define	GMAC_INTMASK_DMA_RX_OVERFLOW	REG_BIT_FIELD(0x024, 14, 1)
#define	GMAC_INTMASK_DMA_TX_UNDERFLOW	REG_BIT_FIELD(0x024, 15, 1)
#define	GMAC_INTMASK_RX_INT		REG_BIT_FIELD(0x024, 16, 1)
#define	GMAC_INTMASK_TX_INT(q)		REG_BIT_FIELD(0x024, 24+(q), 1)
#define	GMAC_INTMASK_RX_ECC_SOFT	REG_BIT_FIELD(0x024, 28, 1)
#define	GMAC_INTMASK_RX_ECC_HARD	REG_BIT_FIELD(0x024, 29, 1)
#define	GMAC_INTMASK_TX_ECC_SOFT	REG_BIT_FIELD(0x024, 30, 1)
#define	GMAC_INTMASK_TX_ECC_HARD	REG_BIT_FIELD(0x024, 31, 1)

#define	GMAC_TIMER			REG_BIT_FIELD(0x028, 0, 32)

#define	GMAC_INTRX_LZY_TIMEOUT		REG_BIT_FIELD(0x100,0,24)
#define	GMAC_INTRX_LZY_FRMCNT		REG_BIT_FIELD(0x100,24,8)

#define	GMAC_PHYACC_DATA		REG_BIT_FIELD(0x180, 0, 16)
#define	GMAC_PHYACC_ADDR		REG_BIT_FIELD(0x180, 16, 5)
#define	GMAC_PHYACC_REG			REG_BIT_FIELD(0x180, 24, 5)
#define	GMAC_PHYACC_WRITE		REG_BIT_FIELD(0x180, 29, 1)
#define	GMAC_PHYACC_GO			REG_BIT_FIELD(0x180, 30, 1)

#define	GMAC_PHYCTL_ADDR		REG_BIT_FIELD(0x188, 0, 5)
#define	GMAC_PHYCTL_MDC_CYCLE		REG_BIT_FIELD(0x188, 16, 7)
#define	GMAC_PHYCTL_MDC_TRANS		REG_BIT_FIELD(0x188, 23, 1)

/* GMAC has 4 Tx queues, all bit-fields are defined per <q> number */
#define	GMAC_TXCTL(q)			REG_BIT_FIELD(0x200+((q)<<6),0,32)
#define	GMAC_TXCTL_TX_EN(q)		REG_BIT_FIELD(0x200+((q)<<6),0,1)
#define	GMAC_TXCTL_SUSPEND(q)		REG_BIT_FIELD(0x200+((q)<<6),1,1)
#define	GMAC_TXCTL_DMALOOPBACK(q)	REG_BIT_FIELD(0x200+((q)<<6),2,1)
#define	GMAC_TXCTL_DESC_ALIGN(q)	REG_BIT_FIELD(0x200+((q)<<6),5,1)
#define	GMAC_TXCTL_OUTSTAND_READS(q)	REG_BIT_FIELD(0x200+((q)<<6),6,2)
#define	GMAC_TXCTL_PARITY_DIS(q)	REG_BIT_FIELD(0x200+((q)<<6),11,1)
#define	GMAC_TXCTL_DNA_ACT_INDEX(q)	REG_BIT_FIELD(0x200+((q)<<6),13,1)
#define	GMAC_TXCTL_EXTADDR(q)		REG_BIT_FIELD(0x200+((q)<<6),16,2)
#define	GMAC_TXCTL_BURST_LEN(q)		REG_BIT_FIELD(0x200+((q)<<6),18,3)
#define	GMAC_TXCTL_PFETCH_CTL(q)	REG_BIT_FIELD(0x200+((q)<<6),21,3)
#define	GMAC_TXCTL_PFETCH_TH(q)		REG_BIT_FIELD(0x200+((q)<<6),24,2)

#define	GMAC_TX_PTR(q)			REG_BIT_FIELD(0x204+((q)<<6),0,12)
#define	GMAC_TX_ADDR_LOW(q)		REG_BIT_FIELD(0x208+((q)<<6),0,32)
#define	GMAC_TX_ADDR_HIGH(q)		REG_BIT_FIELD(0x20c+((q)<<6),0,32)
#define	GMAC_TXSTAT_CURR_DESC(q)	REG_BIT_FIELD(0x210+((q)<<6),0,12)
#define	GMAC_TXSTAT_TXSTATE(q)		REG_BIT_FIELD(0x210+((q)<<6),28,4)
#define	GMAC_TXSTAT_ACT_DESC(q)		REG_BIT_FIELD(0x214+((q)<<6),0,12)
#define	GMAC_TXSTAT_TXERR(q)		REG_BIT_FIELD(0x214+((q)<<6),28,4)

#define	GMAC_RXCTL			REG_BIT_FIELD(0x220,0,32)
#define	GMAC_RXCTL_RX_EN		REG_BIT_FIELD(0x220,0,1)
#define	GMAC_RXCTL_RX_OFFSET		REG_BIT_FIELD(0x220,1,7)
#define	GMAC_RXCTL_SEP_HDR_DESC		REG_BIT_FIELD(0x220,9,1)
#define	GMAC_RXCTL_OFLOW_CONT		REG_BIT_FIELD(0x220,10,1)
#define	GMAC_RXCTL_PARITY_DIS		REG_BIT_FIELD(0x220,11,1)
#define	GMAC_RXCTL_WAIT_COMPLETE	REG_BIT_FIELD(0x220,12,1)
#define	GMAC_RXCTL_DMA_ACT_INDEX	REG_BIT_FIELD(0x220,13,1)
#define	GMAC_RXCTL_EXTADDR		REG_BIT_FIELD(0x220,16,2)
#define	GMAC_RXCTL_BURST_LEN		REG_BIT_FIELD(0x220,18,3)
#define	GMAC_RXCTL_PFETCH_CTL		REG_BIT_FIELD(0x220,21,3)
#define	GMAC_RXCTL_PFETCH_TH		REG_BIT_FIELD(0x220,24,2)
#define	GMAC_RX_PTR			REG_BIT_FIELD(0x224,0,12)
#define	GMAC_RX_ADDR_LOW		REG_BIT_FIELD(0x228,0,32)
#define	GMAC_RX_ADDR_HIGH		REG_BIT_FIELD(0x22c,0,32)
#define	GMAC_RXSTAT_CURR_DESC		REG_BIT_FIELD(0x230,0,12)
#define	GMAC_RXSTAT_RXSTATE		REG_BIT_FIELD(0x230,28,4)
#define	GMAC_RXSTAT_ACT_DESC		REG_BIT_FIELD(0x234,0,12)
#define	GMAC_RXSTAT_RXERR		REG_BIT_FIELD(0x234,28,4)

#define	UMAC_CORE_VERSION		REG_BIT_FIELD(0x800,0,32)
#define	UMAC_HD_FC_ENA			REG_BIT_FIELD(0x804,0,1)
#define	UMAC_HD_FC_NKOFF		REG_BIT_FIELD(0x804,1,1)
#define	UMAC_IPG_CONFIG_RX		REG_BIT_FIELD(0x804,2,5)

#define	UMAC_CONFIG			REG_BIT_FIELD(0x808,0,32)
#define	UMAC_CONFIG_TX_EN		REG_BIT_FIELD(0x808,0,1)
#define	UMAC_CONFIG_RX_EN		REG_BIT_FIELD(0x808,1,1)
#define	UMAC_CONFIG_ETH_SPEED		REG_BIT_FIELD(0x808,2,2)
#define	UMAC_CONFIG_PROMISC		REG_BIT_FIELD(0x808,4,1)
#define	UMAC_CONFIG_PAD_EN		REG_BIT_FIELD(0x808,5,1)
#define	UMAC_CONFIG_CRC_FW		REG_BIT_FIELD(0x808,6,1)
#define	UMAC_CONFIG_PAUSE_FW		REG_BIT_FIELD(0x808,7,1)
#define	UMAC_CONFIG_RX_PAUSE_IGN	REG_BIT_FIELD(0x808,8,1)
#define	UMAC_CONFIG_TX_ADDR_INS		REG_BIT_FIELD(0x808,9,1)
#define	UMAC_CONFIG_HD_ENA		REG_BIT_FIELD(0x808,10,1)
#define	UMAC_CONFIG_SW_RESET		REG_BIT_FIELD(0x808,11,1)
#define	UMAC_CONFIG_LCL_LOOP_EN		REG_BIT_FIELD(0x808,15,1)
#define	UMAC_CONFIG_AUTO_EN		REG_BIT_FIELD(0x808,22,1)
#define	UMAC_CONFIG_CNTLFRM_EN		REG_BIT_FIELD(0x808,23,1)
#define	UMAC_CONFIG_LNGTHCHK_DIS	REG_BIT_FIELD(0x808,24,1)
#define	UMAC_CONFIG_RMT_LOOP_EN		REG_BIT_FIELD(0x808,25,1)
#define	UMAC_CONFIG_PREAMB_EN		REG_BIT_FIELD(0x808,27,1)
#define	UMAC_CONFIG_TX_PAUSE_IGN	REG_BIT_FIELD(0x808,28,1)
#define	UMAC_CONFIG_TXRX_AUTO_EN	REG_BIT_FIELD(0x808,29,1)

#define	UMAC_MACADDR_LOW		REG_BIT_FIELD(0x80c,0,32)
#define	UMAC_MACADDR_HIGH		REG_BIT_FIELD(0x810,0,16)
#define	UMAC_FRM_LENGTH			REG_BIT_FIELD(0x814,0,14)
#define	UMAC_PAUSE_QUANT		REG_BIT_FIELD(0x818,0,16)

#define	UMAC_MAC_STAT			REG_BIT_FIELD(0x844,0,32)
#define	UMAC_MAC_SPEED			REG_BIT_FIELD(0x844,0,2)
#define	UMAC_MAC_DUPLEX			REG_BIT_FIELD(0x844,2,1)
#define	UMAC_MAC_RX_PAUSE		REG_BIT_FIELD(0x844,3,1)
#define	UMAC_MAC_TX_PAUSE		REG_BIT_FIELD(0x844,4,1)
#define	UMAC_MAC_LINK			REG_BIT_FIELD(0x844,5,1)

#define	UMAC_FRM_TAG0			REG_BIT_FIELD(0x848,0,16)
#define	UMAC_FRM_TAG1			REG_BIT_FIELD(0x84c,0,16)
#define	UMAC_IPG_CONFIG_TX		REG_BIT_FIELD(0x85c,0,5)

#define	UMAC_PAUSE_TIMER		REG_BIT_FIELD(0xb30,0,17)
#define	UMAC_PAUSE_CONTROL_EN		REG_BIT_FIELD(0xb30,17,1)
#define	UMAC_TXFIFO_FLUSH		REG_BIT_FIELD(0xb34,0,1)
#define	UMAC_RXFIFO_STAT		REG_BIT_FIELD(0xb38,0,2)

#define	GMAC_MIB_COUNTERS_OFFSET	0x300

/* GMAC MIB counters structure, with same names as link_stats_64 if exists */
struct gmac_mib_counters {
	/* TX stats */
	u64	tx_bytes;		/* 0x300-0x304 */
        u32	tx_packets;		/* 0x308 */
	u64	tx_all_bytes;		/* 0x30c-0x310 */
	u32	tx_all_packets;		/* 0x314 */
	u32	tx_bcast_packets;	/* 0x318 */
	u32	tx_mcast_packets;	/* 0x31c */
	u32	tx_64b_packets;		/* 0x320 */
	u32	tx_127b_packets;	/* 0x324 */
	u32	tx_255b_packets;	/* 0x328 */
	u32	tx_511b_packets;	/* 0x32c */
	u32	tx_1kb_packets;		/* 0x330 */
	u32	tx_1_5kb_packets;	/* 0x334 */
	u32	tx_2kb_packets;		/* 0x338 */
	u32	tx_4kb_pakcets;		/* 0x33c */
	u32	tx_8kb_pakcets;		/* 0x340 */
	u32	tx_max_pakcets;		/* 0x344 */
	u32	tx_jabbers;		/* 0x348 */
	u32	tx_oversize;		/* 0x34c */
	u32	tx_runt;		/* 0x350 */
        u32	tx_fifo_errors;		/* 0x354 */
	u32	collisions;		/* 0x358 */
	u32	tx_1_col_packets;	/* 0x35c */
	u32	tx_m_col_packets;	/* 0x360 */
        u32	tx_aborted_errors;	/* 0x364 */
	u32	tx_window_errors;	/* 0x368 */
	u32	tx_deferred_packets;	/* 0x36c */
	u32	tx_carrier_errors;	/* 0x370 */
	u32	tx_pause_packets;	/* 0x374 */
	u32	tx_unicast_packets;	/* 0x378 */
	u32	tx_qos_0_packets;	/* 0x37c */
	u64	tx_qos_0_bytes;		/* 0x380-0x384 */
	u32	tx_qos_1_packets;	/* 0x388 */
	u64	tx_qos_1_bytes;		/* 0x38c-0x390 */
	u32	tx_qos_2_packets;	/* 0x394 */
	u64	tx_qos_2_bytes;		/* 0x398-0x39c */
	u32	tx_qos_3_packets;	/* 0x3a0 */
	u64	tx_qos_3_bytes;		/* 0x3a4-0x3a8 */
	u32	reserved[1];		/* 0x3ac */

	/* RX stats */
        u64	rx_bytes;		/* 0x3b0-0x3b4 */
	u32	rx_packets;		/* 0x3b8 */
	u64	rx_all_bytes;		/* 0x3bc-0x3c0 */
	u32	rx_all_packets;		/* 0x3c4 */
	u32	rx_bcast_packets;	/* 0x3c8 */
	u32	multicast;		/* 0x3cc */
	u32	rx_64b_packets;		/* 0x3d0 */
	u32	rx_127b_packets;	/* 0x3d4 */
	u32	rx_255b_packets;	/* 0x3d8 */
	u32	rx_511b_packets;	/* 0x3dc */
	u32	rx_1kb_packets;		/* 0x3e0 */
	u32	rx_1_5kb_packets;	/* 0x3e4 */
	u32	rx_2kb_packets;		/* 0x3e8 */
	u32	rx_4kb_packets;		/* 0x3ec */
	u32	rx_8kb_packets;		/* 0x3f0 */
	u32	rx_max_packets;		/* 0x3f4 */
	u32	rx_jabbers;		/* 0x3f8 */
	u32	rx_length_errors;	/* 0x3fc */
	u32	rx_runt_bad_packets;	/* 0x400 */
	u32	rx_over_errors;         /* 0x404 */
	u32	rx_crc_or_align_errors;	/* 0x408 */
	u32	rx_runt_good_packets;	/* 0x40c */
	u32	rx_crc_errors;		/* 0x410 */
	u32	rx_frame_errors;	/* 0x414 */
	u32	rx_missed_errors;	/* 0x418 */
	u32	rx_pause_packets;	/* 0x41c */
	u32	rx_control_packets;	/* 0x420 */
	u32	rx_src_mac_chanhges;	/* 0x424 */
	u32	rx_unicast_packets;	/* 0x428 */
}__attribute__((packed)) ;

/*
 * Register bit-field manipulation routines
 * NOTE: These compile to just a few machine instructions in-line
 */

typedef	struct {unsigned reg, pos, width;} reg_bit_field_t ;

static unsigned inline _reg_read( struct net_device *dev,  reg_bit_field_t rbf )
{
	void * __iomem base = (void *) dev->base_addr;
	unsigned val ;

	val =  __raw_readl( base + rbf.reg);
	val >>= rbf.pos;
	val &= (1 << rbf.width)-1;

	return val;
}

static void inline _reg_write( struct net_device *dev,  
	reg_bit_field_t rbf, unsigned newval )
{
	void * __iomem base = (void *) dev->base_addr;
	unsigned val, msk ;

	msk = (1 << rbf.width)-1;
	msk <<= rbf.pos;
	newval <<= rbf.pos;
	newval &= msk ;

	val =  __raw_readl( base + rbf.reg);
	val &= ~msk ;
	val |= newval ;
	__raw_writel( val, base + rbf.reg);
}

/*
 * BUFFER DESCRIPTORS
 */
#define	GMAC_DESC_SIZE_SHIFT	4	/* Descriptors are 16 bytes in size */

/* 
