Repository: RMerl/asuswrt-merlin
Catalog: release/src/router/e2fsprogs/po/*.po
Languages: pl

source: Bad block %u out of range; ignored.
pl: Wadliwy blok %u poza zakresem - zignorowany.

source: while sanity checking the bad blocks inode
pl: podczas sprawdzania poprawno¶ci i-wêz³a wadliwych bloków

source: while reading the bad blocks inode
pl: podczas odczytu i-wêz³a wadliwych bloków

source: while trying to open %s
pl: podczas próby otworzenia %s

source: while trying popen '%s'
pl: podczas próby popen '%s'

source: while reading in list of bad blocks from file
pl: podczas wczytywania z pliku listy wadliwych bloków

source: while updating bad block inode
pl: podczas uaktualniania i-wêz³a wadliwego bloku

source: Warning: illegal block %u found in bad block inode. Cleared.
pl: Uwaga: znaleziono niedopuszczalny blok %u w i-wê¼le wadliwego bloku. Wyczyszczono.

source: Error reading block %lu (%s) while %s.
pl: B³±d przy odczycie bloku %lu (%s) podczas %s.

source: Error reading block %lu (%s).
pl: B³±d przy odczycie bloku %lu (%s).

source: Ignore error
pl: Zignorowaæ b³±d

source: Force rewrite
pl: Wymusiæ ponowny zapis

source: Error writing block %lu (%s) while %s.
pl: B³±d przy zapisie bloku %lu (%s) podczas %s.

source: Error writing block %lu (%s).
pl: B³±d przy zapisie bloku %lu (%s).

source: empty dirblocks
pl: puste bloki katalogu

source: empty dir map
pl: pusta mapa katalogu

source: Empty directory block %u (#%d) in inode %u
pl: Pusty blok katalogu %u (#%d) w i-wê¼le %u

source: %s: %s filename nblocks blocksize
pl: %s: %s nazwa_pliku liczba_bloków rozmiar_bloku

source: Illegal number of blocks!
pl: Niedopuszczalna liczba bloków!

source: Couldn't allocate block buffer (size=%d)
pl: Nie mo¿na przydzieliæ bufora bloku (rozmiar=%d)

source: Usage: %s disk
pl: Sk³adnia: %s dysk

source: BLKFLSBUF ioctl not supported! Can't flush buffers.
pl: ioctl BLKFLSBUF nie obs³ugiwany! Nie mo¿na opró¿niæ buforów.

source: Usage: %s [-F] [-I inode_buffer_blocks] device
pl: Sk³adnia: %s [-F] [-I bloki_bufora_i-wêz³ów] urz±dzenie

source: while opening %s for flushing
pl: podczas otwierania %s w celu opró¿nienia

source: while trying to flush %s
pl: podczas próby opró¿nienia %s

source: while opening inode scan
pl: podczas otwierania obrazu i-wêz³ów

source: while getting next inode
pl: podczas pobierania nastêpnego i-wêz³a

source: %u inodes scanned.
pl: Przeszukano i-wêz³ów: %u.

source: reading journal superblock
pl: odczyt superbloku kroniki

source: %s: no valid journal superblock found
pl: %s: nie znaleziono poprawnego superbloku kroniki

source: %s: journal too short
pl: %s: kronika za krótka

source: %s: recovering journal
pl: %s: odtwarzanie z kroniki

source: %s: won't do journal recovery while read-only
pl: %s: odtworzenie z kroniki nie zostanie wykonane w trybie tylko do odczytu

source: while trying to re-open %s
pl: podczas próby ponownego otwarcia %s

source: aextended attribute
pl: arozszerzony atrybut

source: Aerror allocating
pl: Ab³±d podczas przydzielania

source: bblock
pl: bblok

source: Bbitmap
pl: Bbitmapa

source: ccompress
pl: ckompresja

source: Cconflicts with some other fs @b
pl: Ckonflikt z innym @biem systemu plików

source: iinode
pl: ii-wêze³

source: Iillegal
pl: Iniedopuszczalny

source: jjournal
pl: jkronika

source: Ddeleted
pl: Dusuniêty

source: ddirectory
pl: dkatalog

source: eentry
pl: ewpis

source: E@e '%Dn' in %p (%i)
pl: E@e '%Dn' w %p (%i)

source: ffilesystem
pl: fsystem plików

source: Ffor @i %i (%Q) is
pl: Fdla i-wêz³a %i (%Q) wynosi

source: ggroup
pl: ggrupa

source: hHTREE @d @i
pl: h@i @du HTREE

source: Lis a link
pl: Ljest dowi±zaniem

source: mmultiply-claimed
pl: mwielokrotnie zadeklarowany

source: ninvalid
pl: nb³êdny

source: oorphaned
pl: oosierocony

source: pproblem in
pl: pproblem w

source: rroot @i
pl: rg³ówny @i

source: sshould be
pl: spowinno byæ

source: uunattached
pl: uniedo³±czony

source: vdevice
pl: vurz±dzenie

source: xextent
pl: xekstent

source: zzero-length
pl: zzerowej d³ugo¶ci

source: <The NULL inode>
pl: <pusty i-wêze³>

source: <The bad blocks inode>
pl: <i-wêze³ wadliwych bloków>

source: <The ACL index inode>
pl: <i-wêze³ indeksu ACL>

source: <The ACL data inode>
pl: <i-wêze³ danych ACL

source: <The boot loader inode>
pl: <i-wêze³ boot-loadera>

source: <The undelete directory inode>
pl: <i-wêze³ katalogu undelete>

source: <The group descriptor inode>
pl: <i-wêze³ deskryptora grupy>

source: <The journal inode>
pl: <i-wêze³ kroniki>

source: <Reserved inode 9>
pl: <zarezerwowany i-wêze³ 9>

source: <Reserved inode 10>
pl: <zarezerwowany i-wêze³ 10>

source: regular file
pl: plik zwyk³y

source: directory
pl: katalog

source: character device
pl: urz±dzenie znakowe

source: block device
pl: urz±dzenie blokowe

source: named pipe
pl: nazwany potok

source: symbolic link
pl: dowi±zanie symboliczne

source: socket
pl: gniazdo

source: unknown file type with mode 0%o
pl: nieznany rodzaj pliku typu 0%o

source: indirect block
pl: blok po¶redni

source: double indirect block
pl: blok podwójnie po¶redni

source: triple indirect block
pl: blok potrójnie po¶redni

source: translator block
pl: blok t³umacz±cy

source: block #
pl: blok #

source: multiply claimed inode map
pl: wielokrotnie zadeklarowana mapa i-wêz³ów

source: internal error: can't find dup_blk for %u
pl: b³±d wewnêtrzny; nie mo¿na znale¼æ dup_blk dla %u

source: returned from clone_file_block
pl: powrót z clone_file_block

source: internal error: couldn't lookup EA block record for %u
pl: b³±d wewnêtrzny: nie mo¿na znale¼æ rekordu bloku EA dla %u

source: internal error: couldn't lookup EA inode record for %u
pl: B³±d wewnêtrzny: nie mo¿na znale¼æ rekordu i-wêz³a EA dla %u

source: reading directory block
pl: odczytu bloku katalogu

source: in-use inode map
pl: mapa u¿ywanych i-wêz³ów

source: directory inode map
pl: mapa i-wêz³ów katalogów

source: regular file inode map
pl: mapa i-wêz³ów zwyk³ych plików

source: in-use block map
pl: mapa u¿ywanych bloków

source: opening inode scan
pl: rozpoczynania przeszukiwania i-wêz³ów

source: getting next inode from scan
pl: pobierania nastêpnego i-wêz³a

source: Pass 1
pl: Przebieg 1

source: reading indirect blocks of inode %u
pl: odczytu niebezpo¶rednich bloków i-wêz³a %u

source: bad inode map
pl: b³êdna mapa i-wêz³ów

source: inode in bad block map
pl: i-wêze³ w mapie wadliwych bloków

source: imagic inode map
pl: mapa i-wêz³ów imagic

source: multiply claimed block map
pl: wielokrotnie zadeklarowana mapa bloków

source: ext attr block map
pl: mapa bloków rozszerzonych atrybutów

source: %6lu(%c): expecting %6lu got phys %6lu (blkcnt %lld)
pl: %6lu(%c): oczekiwano %6lu, otrzymano phys %6lu (blkcnt %lld)

source: block bitmap
pl: bitmapa bloków

source: inode bitmap
pl: bitmapa i-wêz³ów

source: inode table
pl: tablica i-wêz³ów

source: Pass 2
pl: Przebieg 2

source: Can not continue.
pl: Nie mo¿na kontynuowaæ.

source: inode done bitmap
pl: bitmapa wykonanych i-wêz³ów

source: Peak memory
pl: Najwiêksze u¿ycie pamiêci

source: Pass 3
pl: Przebieg 3

source: inode loop detection bitmap
pl: bitmapa wykrywania pêtli i-wêz³ów

source: Pass 4
pl: Przebieg 4

source: Pass 5
pl: Przebieg 5

source: (no prompt)
pl: (bez pytania)

source: Fix
pl: Poprawiæ

source: Clear
pl: Wyczy¶ciæ

source: Relocate
pl: Przenie¶æ

source: Allocate
pl: Przydzieliæ

source: Expand
pl: Rozszerzyæ

source: Connect to /lost+found
pl: Do³±czyæ do /lost+found

source: Create
pl: Wyczy¶ciæ

source: Salvage
pl: Uratowaæ

source: Truncate
pl: Uci±æ

source: Clear inode
pl: Wyczy¶ciæ i-wêze³

source: Abort
pl: Przerwaæ

source: Split
pl: Podzieliæ

source: Continue
pl: Kontynuowaæ

source: Clone multiply-claimed blocks
pl: Sklonowaæ wielokrotnie zadeklarowane bloki

source: Delete file
pl: Usun±æ plik

source: Suppress messages
pl: Pomin±æ komunikaty

source: Unlink
pl: Od³±czyæ

source: Clear HTree index
pl: Wyczy¶ciæ indeks HTree

source: Recreate
pl: Odtworzyæ

source: (NONE)
pl: (NIC)

source: FIXED
pl: POPRAWIONO

source: CLEARED
pl: WYCZYSZCZONO

source: RELOCATED
pl: PRZENIESIONO

source: ALLOCATED
pl: PRZYDZIELONO

source: EXPANDED
pl: ROZSZERZONO

source: RECONNECTED
pl: POD£¡CZONO

source: CREATED
pl: UTWORZONO

source: SALVAGED
pl: URATOWANO

source: TRUNCATED
pl: SKRÓCONO

source: INODE CLEARED
pl: I-WÊZE£ WYCZYSZCZONY

source: ABORTED
pl: PRZERWANO

source: SPLIT
pl: PODZIELONO

source: CONTINUING
pl: KONTYNUACJA

source: MULTIPLY-CLAIMED BLOCKS CLONED
pl: SKLONOWANO WIELOKROTNIE ZADEKLAROWANE BLOKI

source: FILE DELETED
pl: PLIK USUNIÊTY

source: SUPPRESSED
pl: POMINIÊTO

source: UNLINKED
pl: OD£¡CZONO

source: HTREE INDEX CLEARED
pl: INDEKS HTREE WYCZYSZCZONY

source: WILL RECREATE
pl: ZOSTANIE ODTWORZONY

source: @b @B for @g %g is not in @g. (@b %b)
pl: @B @bów dla grupy %g nie jest w grupie. (@b %b)

source: @i @B for @g %g is not in @g. (@b %b)
pl: @B i-wêz³ów dla grupy %g nie jest w grupie. (@b %b)

source: @i table for @g %g is not in @g. (@b %b) WARNING: SEVERE DATA LOSS POSSIBLE.
pl: tablica i-wêz³ów dla grupy %g nie jest w grupie. (@b %b) UWAGA: MO¯LIWA POWA¯NA UTRATA DANYCH.

source: The @S could not be read or does not describe a correct ext2 @f. If the @v is valid and it really contains an ext2 @f (and not swap or ufs or something else), then the @S is corrupt, and you might try running e2fsck with an alternate @S: e2fsck -b %S <@v>
pl: @S nie móg³ byæ odczytany lub nie opisuje prawid³owego systemu plików ext2. Je¿eli @v jest prawid³owe i naprawdê zawiera @f ext2 (nie jest swapem, ufs-em ani niczym innym), to @S jest uszkodzony - mo¿na próbowaæ uruchomiæ e2fsck z innym @Siem: e2fsck -b %S <@v>

source: The @f size (according to the @S) is %b @bs The physical size of the @v is %c @bs Either the @S or the partition table is likely to be corrupt!
pl: Rozmiar systemu plików (wed³ug @Su) wynosi %b @bów Fizyczny rozmiar urz±dzenia wynosi %c @bów Mo¿liwe, ¿e @S albo tablica partycji jest uszkodzona!

source: @S @b_size = %b, fragsize = %c. This version of e2fsck does not support fragment sizes different from the @b size.
pl: W @Su block_size (rozm. bloku) = %b, fragsize (rozm. fragmentu) = %c. Ta wersja e2fsck nie obs³uguje rozmiarów fragmentu ró¿nych od rozmiaru @bu.

source: @S @bs_per_group = %b, should have been %c
pl: W @Su blocks_per_group (bloków w grupie) = %b, powinno byæ %c

source: @S first_data_@b = %b, should have been %c
pl: W @Su first_data_block (1. @b danych) = %b, powinien byæ %c

source: @f did not have a UUID; generating one.
pl: @f nie mia³ UUID-a; wygenerowano.

source: Note: if several inode or block bitmap blocks or part of the inode table require relocation, you may wish to try running e2fsck with the '-b %S' option first. The problem may lie only with the primary block group descriptors, and the backup block group descriptors may be OK.
pl: Uwaga: je¶li jakie¶ bloki bitmap i-wêz³ów lub bloków albo czê¶æ tabeli i-wêz³ów wymaga relokacji, mo¿na uruchomiæ najpierw e2fsck z opcj± '-b %S'. Problem mo¿e tkwiæ tylko w deskryptorach g³ównej grupy bloków, a zapasowe deskryptory grupy bloków mog± byæ poprawne.

source: Corruption found in @S. (%s = %N).
pl: Znaleziono uszkodzenia w @Su. (%s = %N).

source: Error determining size of the physical @v: %m
pl: B³±d podczas okre¶lania rozmiaru fizycznego urz±dzenia: %m

source: @i count in @S is %i, @s %j.
pl: licznik i-wêz³ów w @Su wynosi %i, powinien byæ %j.

source: The Hurd does not support the filetype feature.
pl: Hurd nie obs³uguje w³asno¶ci filetype.

source: @S has an @n @j (@i %i).
pl: @S ma b³êdn± kronikê (@i %i).

source: External @j has multiple @f users (unsupported).
pl: Zewnêtrzna @j ma wielu u¿ytkowników systemu plików (nie obs³ugiwane).

source: Can't find external @j
pl: Nie mo¿na znale¼æ zewnêtrznej kroniki

source: External @j has bad @S
pl: Zewnêtrzna @j ma b³êdny @S

source: External @j does not support this @f
pl: Zewnêtrzna @j nie obs³uguje tego systemu plików

source: @f @j @S is unknown type %N (unsupported). It is likely that your copy of e2fsck is old and/or doesn't support this @j format. It is also possible the @j @S is corrupt.
pl: @S kroniki systemu plików ma nieznany typ %N (nie obs³ugiwany). Mo¿liwe, ¿e ta kopia e2fsck jest stara i/lub nie obs³uguje tego formatu kroniki. Mo¿liwe te¿, ¿e @S kroniki jest uszkodzony.

source: @j @S is corrupt.
pl: @S kroniki jest uszkodzony.

source: @S has_@j flag is clear, but a @j %s is present.
pl: flaga has_journal @Su jest wyzerowana, ale @j %s istnieje.

source: @S needs_recovery flag is set, but no @j is present.
pl: @S ma ustawion± flagê needs_recovery, ale nie ma kroniki.

source: @S needs_recovery flag is clear, but @j has data.
pl: flaga needs_recovery @Su jest wyzerowana, ale @j zawiera dane.

source: Clear @j
pl: Wyczy¶ciæ kronikê

source: @f has feature flag(s) set, but is a revision 0 @f.
pl: @f ma ustawione flagi cech, ale ma wersjê 0 systemu plików.

source: %s @o @i %i (uid=%Iu, gid=%Ig, mode=%Im, size=%Is)
pl: %s @o @i %i (uid=%Iu, gid=%Ig, uprawnienia=%Im, rozmiar=%Is)

source: @I %B (%b) found in @o @i %i.
pl: znaleziono @I %B (%b) w @om i-wê¼le %i.

source: Already cleared %B (%b) found in @o @i %i.
pl: Ju¿ wyczyszczono %B (%b) znaleziony w @om i-wê¼le %i.

source: @I @o @i %i in @S.
pl: @I @o @i %i w @Su.

source: @I @i %i in @o @i list.
pl: @I @i %i w li¶cie @och i-wêz³ów.

source: @j @S has an unknown read-only feature flag set.
pl: @S kroniki ma ustawion± nieznan± flagê tylko do odczytu.

source: @j @S has an unknown incompatible feature flag set.
pl: @S kroniki ma ustawion± flagê nieznanej cechy.

source: @j version not supported by this e2fsck.
pl: Wersja kroniki nie obs³ugiwana przez ten e2fsck.

source: Moving @j from /%s to hidden @i.
pl: Przenoszenie kroniki z /%s do ukrytego i-wêz³a.

source: Error moving @j: %m
pl: B³±d podczas przenoszenia kroniki: %m

source: Found @n V2 @j @S fields (from V1 @j). Clearing fields beyond the V1 @j @S...
pl: Znaleziono b³êdne pola @Su kroniki V2 (z kroniki V1). Czyszczenie pól spoza @Su kroniki V1...

source: Run @j anyway
pl: Wykonaæ zapisy z kroniki

source: Recovery flag not set in backup @S, so running @j anyway.
pl: Flaga odtworzenia nie ustawiona w zapasowym @Su, wiêc wykonujê zapisy z kroniki mimo to.

source: Backing up @j @i @b information.
pl: Tworzenie kopii zapasowej informacji z @bu i-wêz³a kroniki.

source: @f does not have resize_@i enabled, but s_reserved_gdt_@bs is %N; @s zero.
pl: @f nie ma w³±czonego resize_inode, ale s_reserved_gdt_blocks wynosi %N; @s zero.

source: Resize_@i not enabled, but the resize @i is non-zero.
pl: Resize_inode nie w³±czone, ale i-wêze³ zmiany rozmiaru jest niezerowy.

source: Resize @i not valid.
pl: i-wêze³ zmiany rozmiaru (resize) nieprawid³owy.

source: @S last mount time (%t, now = %T) is in the future.
pl: Czas ostatniego montowania @Su (%t, teraz = %T) jest w przysz³o¶ci.

source: @S last write time (%t, now = %T) is in the future.
pl: Czas ostatniego zapisu @Su (%t, teraz = %T) jest w przysz³o¶ci.

source: @S hint for external superblock @s %X.
pl: Podpowied¼ @Su dla zewnêtrznego superbloku powinna byæ %X.

source: Adding dirhash hint to @f.
pl: Dodawanie podpowiedzi dirhash do systemu plików.

source: @g descriptor %g checksum is invalid.
pl: Suma kontrolna deskryptora grupy %g jest b³êdna.

source: @g descriptor %g marked uninitialized without feature set.
pl: Deskryptor grupy %g oznaczony jako nie zainicjowany bez zbioru cech.

source: @g %g @b @B uninitialized but @i @B in use.
pl: Bitmapa bloku grupy %g nie zainicjowana, ale @i @By jest u¿ywany.

source: @g descriptor %g has invalid unused inodes count %b.
pl: Deskryptor grupy %g ma b³êdn± liczbê nie u¿ywanych i-wêz³ów %b.

source: Last @g @b @B uninitialized.
pl: @B @bu ostatniej grupy niezainicjowana.

source: Journal transaction %i was corrupt, replay was aborted.
pl: Transakcja %i kroniki by³a uszkodzona, odtwarzanie przerwano.

source: The test_fs flag is set (and ext4 is available).
pl: Flags test_fs jest ustawiona (i ext4 jest dostêpny).

source: @S last mount time is in the future. (by less than a day, probably due to the hardware clock being incorrectly set)
pl: Czas ostatniego montowania @Su jest w przysz³o¶ci (o mniej ni¿ dzieñ, zapewne z powodu z³ego ustawienia zegara sprzêtowego)

source: @S last write time is in the future. (by less than a day, probably due to the hardware clock being incorrectly set).
pl: Czas ostatniego zapisu @Su jest w przysz³o¶ci (o mniej ni¿ dzieñ, zapewne z powodu z³ego ustawienia zegara sprzêtowego)

source: One or more @b @g descriptor checksums are invalid.
pl: Jeden lub wiêcej deskryptorów grup bloków jest b³êdnych.

source: Pass 1: Checking @is, @bs, and sizes
pl: Przebieg 1: Sprawdzanie i-wêz³ów, @bów i rozmiarów

source: @r is not a @d.
pl: @r nie jest @diem.

source: @r has dtime set (probably due to old mke2fs).
pl: @r ma ustawiony dtime (zapewne przez stary mke2fs).

source: Reserved @i %i (%Q) has @n mode.
pl: Zarezerwowany @i %i (%Q) ma b³êdne uprawnienia.

source: @D @i %i has zero dtime.
pl: @D @i %i ma zerowy dtime.

source: @i %i is in use, but has dtime set.
pl: @i %i jest u¿ywany, ale ma ustawiony dtime.

source: @i %i is a @z @d.
pl: @i %i jest @diem @z.

source: @g %g's @b @B at %b @C.
pl: @B @bów grupy %g w %b jest w konflikcie z innym @biem.

source: @g %g's @i @B at %b @C.
pl: @B i-wêz³ów grupy %g w %b jest w konflikcie z innym @biem.

source: @g %g's @i table at %b @C.
pl: tablica i-wêz³ów grupy %g w %b jest w konflikcie z innym @biem.

source: @g %g's @b @B (%b) is bad.
pl: @B @bów grupy %g (%b) jest b³êdna.

source: @g %g's @i @B (%b) is bad.
pl: @B i-wêz³ów grupy %g (%b) jest b³êdna.

source: @i %i, i_size is %Is, @s %N.
pl: @i %i, i_size wynosi %Is, @s %N.

source: @i %i, i_@bs is %Ib, @s %N.
pl: @i %i, i_blocks wynosi %Ib, @s %N.

source: @I %B (%b) in @i %i.
pl: @I %B (%b) w i-wê¼le %i.

source: %B (%b) overlaps @f metadata in @i %i.
pl: %B (%b) nak³ada siê na metadane systemu plików w i-wê¼le %i.

source: @i %i has illegal @b(s).
pl: @i %i ma niedopuszczalne @bi.

source: Too many illegal @bs in @i %i.
pl: Za du¿o niedopuszczalnych @bów w i-wê¼le %i.

source: @I %B (%b) in bad @b @i.
pl: @I %B (%b) w i-wê¼le wadliwych @bów.

source: Bad @b @i has illegal @b(s).
pl: I-wêze³ wadliwych @bów ma niedopuszczalne @bi.

source: Duplicate or bad @b in use!
pl: Podwójny lub wadliwy @b jest u¿ywany!

source: Bad @b %b used as bad @b @i indirect @b.
pl: Wadliwy @b %b jest u¿ywany jako niebiezpo¶redni @b i-wê¼³a z wadliwym @biem.

source: The bad @b @i has probably been corrupted. You probably should stop now and run e2fsck -c to scan for bad blocks in the @f.
pl: I-wêze³ z wadliwym @biem zosta³ prawdopodobnie uszkodzony. Prawdopodobnie nale¿a³oby teraz zatrzymaæ i uruchomiæ e2fsck -c aby przeszukaæ @f pod k±tem wadliwych bloków.

source: If the @b is really bad, the @f can not be fixed.
pl: Je¿eli @b jest naprawdê wadliwy, @f nie mo¿e byæ naprawiony.

source: You can remove this @b from the bad @b list and hope that the @b is really OK. But there are no guarantees.
pl: Mo¿na wyczy¶ciæ ten @b z listy wadliwych @bów i mieæ nadziejê, ¿e @b jest naprawdê dobry. Ale nie ma takiej gwarancji.

source: The primary @S (%b) is on the bad @b list.
pl: G³ówny @S (%b) jest na li¶cie wadliwych @bów.

source: Block %b in the primary @g descriptors is on the bad @b list
pl: Blok %b z deskryptorów g³ównej grupy jest na li¶cie wadliwych @bów

source: Warning: Group %g's @S (%b) is bad.
pl: Uwaga: w grupie %g @S (%b) jest wadliwy.

source: Warning: Group %g's copy of the @g descriptors has a bad @b (%b).
pl: Uwaga: kopia deskryptorów grupy %g ma b³êdny @b (%b).

source: Programming error? @b #%b claimed for no reason in process_bad_@b.
pl: B³±d programu? @b #%b uznany bez powodu w process_bad_block.

source: @A %N contiguous @b(s) in @b @g %g for %s: %m
pl: @A %N ci±g³ych @bów w grupie @bów %g dla %s: %m

source: @A @b buffer for relocating %s
pl: @A bufora @bów do przenoszenia %s

source: Relocating @g %g's %s from %b to %c...
pl: Przenoszenie w grupie %g %s z %b do %c...

source: Relocating @g %g's %s to %c...
pl: Przenoszenie w grupie %g %s do %c...

source: Warning: could not read @b %b of %s: %m
pl: Uwaga: nie mo¿na odczytaæ @bu %b z %s: %m

source: Warning: could not write @b %b for %s: %m
pl: Uwaga: nie mo¿na zapisaæ @bu %b do %s: %m

source: @A @i @B (%N): %m
pl: @A bitmapy i-wêz³ów (%N): %m

source: @A @b @B (%N): %m
pl: @A bitmapy i-wêz³ów (%N): %m

source: @A icount link information: %m
pl: @A informacji o liczniku dowi±zañ (icount): %m

source: @A @d @b array: %m
pl: @A tablicy @dch @bów: %m

source: Error while scanning @is (%i): %m
pl: B³±d podczas przeszukiwania i-wêz³ów (%i): %m

source: Error while iterating over @bs in @i %i: %m
pl: B³±d podczas iteracji po @bach w i-wê¼le %i: %m

source: Error storing @i count information (@i=%i, count=%N): %m
pl: B³±d podczas zapisu informacji o liczbie i-wêz³ów (@i=%i, liczba=%N): %m

source: Error storing @d @b information (@i=%i, @b=%b, num=%N): %m
pl: B³±d podczas zapisu informacji o @dch @bach (@i=%i, @b=%b, liczba=%N): %m

source: Error reading @i %i: %m
pl: B³±d podczas odczytu i-wêz³a %i: %m

source: @i %i has imagic flag set.
pl: @i %i ma ustawion± flagê imagic.

source: Special (@v/socket/fifo/symlink) file (@i %i) has immutable or append-only flag set.
pl: Specjalny plik (@v/gniazdo/potok/dowi±zanie) (@i %i) ma ustawion± flagê nienaruszalno¶ci (immutable) lub dopisywania (append-only).

source: @i %i has @cion flag set on @f without @cion support.
pl: @i %i ma ustawion± flagê kompresji na systemie plików bez obs³ugi kompresji.

source: Special (@v/socket/fifo) @i %i has non-zero size.
pl: Specjalny (@v/gniazdo/potok/dowi±zanie) @i %i ma niezerowy rozmiar.

source: @j @i is not in use, but contains data.
pl: @i kroniki nie jest u¿ywany, ale zawiera dane.

source: @j is not regular file.
pl: @j nie jest zwyk³ym plikiem.

source: @i %i was part of the @o @i list.
pl: @i %i by³ czê¶ci± listy osieroconych i-wêz³ów.

source: @is that were part of a corrupted orphan linked list found.
pl: Znaleziono i-wêz³y, które by³y czê¶ci± uszkodzonej listy sierot.

source: @A refcount structure (%N): %m
pl: @A struktury refcount (%N): %m

source: Error reading @a @b %b for @i %i.
pl: B³±d podczas odczytu @bu rozszerzonych atrybutów %b dla i-wêz³a %i.

source: @i %i has a bad @a @b %b.
pl: @i %i ma b³êdny @b rozszerzonych atrybutów %b.

source: Error reading @a @b %b (%m).
pl: B³±d podczas odczytu @bu rozszerzonych atrybutów %b (%m).

source: @a @b %b has reference count %r, @s %N.
pl: @b rozszerzonych atrybutów %b ma liczbê odniesieñ %r, powinno byæ %N.

source: Error writing @a @b %b (%m).
pl: B³±d podczas zapisu @bu rozszerzonych atrybutów %b (%m).

source: @a @b %b has h_@bs > 1.
pl: @b rozszerzonych atrybutów %b ma h_blocks > 1.

source: @A @a @b %b.
pl: @A @bu rozszerzonych atrybutów %b.

source: @a @b %b is corrupt (allocation collision).
pl: @b rozszerzonych atrybutów %b jest uszkodzony (kolizja przydzielania).

source: @a @b %b is corrupt (@n name).
pl: @b rozszerzonych atrybutów %b jest uszkodzony (b³êdna nazwa).

source: @a @b %b is corrupt (@n value).
pl: @b rozszerzonych atrybutów %b jest uszkodzony (b³êdna warto¶æ).

source: @i %i is too big.
pl: @i %i jest zbyt du¿y.

source: %B (%b) causes @d to be too big.
pl: %B (%b) powoduje, ¿e @d jest zbyt du¿y.

source: %B (%b) causes file to be too big.
pl: %B (%b) powoduje, ¿e plik jest zbyt du¿y.

source: %B (%b) causes symlink to be too big.
pl: %B (%b) powoduje, ¿e dowi±zanie jest zbyt du¿e.

source: @i %i has INDEX_FL flag set on @f without htree support.
pl: @i %i ma ustawion± flagê INDEX_FL na systemie plików bez obs³ugi htree.

source: @i %i has INDEX_FL flag set but is not a @d.
pl: @i %i ma ustawion± flagê INDEX_FL, ale nie jest @diem.

source: @h %i has an @n root node.
pl: @h %i ma b³êdny g³ówny wêze³.

source: @h %i has an unsupported hash version (%N)
pl: @h %i ma nie obs³ugiwan± wersjê hasza (%N)
