Repository: RMerl/asuswrt-merlin
Catalog: release/src/router/e2fsprogs/po/*.po
Languages: pl

source: @h %i uses an incompatible htree root node flag.
pl: @h %i u¿ywa niekompatybilnej flagi g³ównego wêz³a htree.

source: @h %i has a tree depth (%N) which is too big
pl: @h %i ma zbyt du¿± g³êboko¶æ drzewa (%N)

source: Bad @b @i has an indirect @b (%b) that conflicts with @f metadata.
pl: I-wêze³ z wadliwym @biem ma niebezpo¶redni @b (%b) bêd±cy w konflikcie z metadanymi systemu plików.

source: Resize @i (re)creation failed: %m.
pl: Tworzenie/odtwarzanie i-wêz³a zmiany rozmiaru nie powiod³o siê: %m.

source: @i %i has a extra size (%IS) which is @n
pl: @i %i ma dodatkowy rozmiar (%IS), co jest b³êdne

source: @a in @i %i has a namelen (%N) which is @n
pl: @a w i-wê¼le %i ma namelen (%N), co jest b³êdne

source: @a in @i %i has a value offset (%N) which is @n
pl: @a w i-wê¼le %i ma przesuniêcie warto¶ci (%N), co jest b³êdne

source: @a in @i %i has a value @b (%N) which is @n (must be 0)
pl: @a w i-wê¼le %i ma @b warto¶ci (%N), co jest b³êdne (musi byæ 0)

source: @a in @i %i has a value size (%N) which is @n
pl: @a w i-wê¼le %i ma rozmiar warto¶ci (%N), co jest b³êdne

source: @a in @i %i has a hash (%N) which is @n
pl: @a w i-wê¼le %i ma hash (%N), co jest b³êdne

source: @i %i is a %It but it looks like it is really a directory.
pl: @i %i to %It, ale wygl±da jakby w rzeczywisto¶ci by³ katalogiem.

source: Error while reading over @x tree in @i %i: %m
pl: B³±d podczas czytania po @xach w i-wê¼le %i: %m

source: Failed to iterate extents in @i %i (op %s, blk %b, lblk %c): %m
pl: Nie uda³o siê przej¶æ ekstentów w i-wê¼le %i (op %s, blk %b, lblk %c): %m

source: @i %i has an @n extent (logical @b %c, @n physical @b %b, len %N)
pl: @i %i ma @n ekstent (@b logiczny %c, @n @b fizyczny %b, d³ugo¶æ %N)

source: @i %i has an @n extent (logical @b %c, physical @b %b, @n len %N)
pl: @i %i ma b³êdny ekstent (@b logiczny %c, @b fizyczny %b, b³êdna d³ugo¶æ %N)

source: @i %i has EXTENTS_FL flag set on @f without extents support.
pl: @i %i ma ustawion± flagê EXTENTS_FL na systemie plików bez obs³ugi ekstentów.

source: @i %i is in extent format, but @S is missing EXTENTS feature
pl: @i %i ma format z ekstentami, ale w superbloku brakuje w³a¶ciwo¶ci EXTENTS

source: @i %i missing EXTENT_FL, but is in extents format
pl: @i %i nie ma flagi EXTENT_FL, ale jest w formacie z ekstentami

source: Fast symlink %i has EXTENT_FL set.
pl: Szybkie dowi±zanie symboliczne %i ma ustawion± flagê EXTENT_FL.

source: @i %i has out of order extents (@n logical @b %c, physical @b %b, len %N)
pl: @i %i ma ekstenty spoza kolejno¶ci (@b @b logiczny %c, @b fizyczny %b, d³ugo¶æ %N)

source: @i %i has an invalid extent node (blk %b, lblk %c)
pl: @i %i ma b³êdny wêze³ ekstentu (blk %b, lblk %c)

source: @i %i should not have EOFBLOCKS_FL set (size %Is, lblk %r)
pl: @i %i nie powinien mieæ ustawionej flagi EOFBLOCKS_FL (rozmiar %Is, lblk %r)

source: Running additional passes to resolve @bs claimed by more than one @i... Pass 1B: Rescanning for @m @bs
pl: Uruchamianie dodatkowych przebiegów do rozwi±zania bloków zadeklarowanych przez wiêcej ni¿ jeden @i... Przebieg 1B: Ponowne przeszukiwanie @mch @bów

source: @m @b(s) in @i %i:
pl: @m @b(i) w i-wê¼le %i:

source: Error while scanning inodes (%i): %m
pl: B³±d podczas szukania i-wêz³a (%i): %m

source: @A @i @B (@i_dup_map): %m
pl: @A bitmapy i-wêz³ów (inode_dup_map): %m

source: Error while iterating over @bs in @i %i (%s): %m
pl: B³±d podczas iteracji po @bach w i-wê¼le %i (%s): %m

source: Error adjusting refcount for @a @b %b (@i %i): %m
pl: B³±d podczas poprawiania refcount dla @bu rozszerzonych atrybutów %b (@i %i): %m

source: Pass 1C: Scanning directories for @is with @m @bs
pl: Przebieg 1C: Przeszukiwanie katalogów pod k±tem i-wêz³ów z @mmi @bami

source: Pass 1D: Reconciling @m @bs
pl: Przebieg 1D: Uzgadnianie @mch @bów

source: File %Q (@i #%i, mod time %IM) has %r @m @b(s), shared with %N file(s):
pl: Plik %Q (@i #%i, czas modyfikacji %IM) ma %r @mch @bów, dzielonych z %N plikami:

source: %Q (@i #%i, mod time %IM)
pl: %Q (@i #%i, czas modyfikacji %IM)

source: <@f metadata>
pl: <metadane systemu plików>

source: (There are %N @is containing @m @bs.)
pl: (Jest %N i-wêz³ów zawieraj±cych podwójnie zadeklarowane @bi.)

source: @m @bs already reassigned or cloned.
pl: Podwójnie zadeklarowane @bi ju¿ przepisane lub sklonowane.

source: Couldn't clone file: %m
pl: Nie mo¿na sklonowaæ pliku: %m

source: Pass 2: Checking @d structure
pl: Przebieg 2: Sprawdzanie struktury @dów

source: @n @i number for '.' in @d @i %i.
pl: B³êdny numer i-wêz³a dla '.' w i-wê¼le @du %i.

source: @E has @n @i #: %Di.
pl: @E ma b³êdny numer i-wêz³a: %Di.

source: @E has @D/unused @i %Di.
pl: @E ma @D/nie u¿ywany @i %Di.

source: @E @L to '.'
pl: @E @L do '.'

source: @E points to @i (%Di) located in a bad @b.
pl: @E wskazuje na @i (%Di) po³o¿ony w wadliwym @b.

source: @E @L to @d %P (%Di).
pl: @E @L do @du %P (%Di).

source: @E @L to the @r.
pl: @E @L do g³ównego katalogu.

source: @E has illegal characters in its name.
pl: @E ma niedopuszczalne znaki w nazwie.

source: Missing '.' in @d @i %i.
pl: Brakuje '.' w i-wê¼le @du %i.

source: Missing '..' in @d @i %i.
pl: Brakuje '..' w i-wê¼le @du %i.

source: First @e '%Dn' (@i=%Di) in @d @i %i (%p) @s '.'
pl: Pierwszym @eem '%Dn' (@i=%Di) w i-wê¼le @du %i (%p) @s '.'

source: Second @e '%Dn' (@i=%Di) in @d @i %i @s '..'
pl: Drugim @eem '%Dn' (@i=%Di) w i-wê¼le @du %i @s '..'

source: @i %i (%Q) has @n mode (%Im).
pl: @i %i (%Q) ma b³êdne uprawnienia (%Im).

source: @d @i %i, %B, offset %N: @d corrupted
pl: @i @du %i, %B, offset %N: @d uszkodzony

source: @d @i %i, %B, offset %N: filename too long
pl: @i @du %i, %B, offset %N: nazwa pliku zbyt d³uga

source: @d @i %i has an unallocated %B.
pl: @i @du %i ma nie przydzielony %B.

source: '.' @d @e in @d @i %i is not NULL terminated
pl: @e @du '.' w i-wê¼le @du %i nie jest zakoñczony przez NULL

source: '..' @d @e in @d @i %i is not NULL terminated
pl: @e @du '..' w i-wê¼le @du %i nie jest zakoñczony przez NULL

source: @i %i (%Q) is an @I character @v.
pl: @i %i (%Q) jest @Im @vm znakowym.

source: @i %i (%Q) is an @I @b @v.
pl: @i %i (%Q) jest @Im @vm @bowym.

source: @E is duplicate '.' @e.
pl: @E jest powielonym @eem '.'.

source: @E is duplicate '..' @e.
pl: @E jest powielonym @eem '..'.

source: Internal error: couldn't find dir_info for %i.
pl: B³±d wewnêtrzny: nie mo¿na znale¼æ dir_info dla %i.

source: @E has rec_len of %Dr, @s %N.
pl: @E ma rec_len %Dr, @s %N.

source: @A icount structure: %m
pl: @A struktury icount: %m

source: Error iterating over @d @bs: %m
pl: B³±d podczas iteracji po @bach @du: %m

source: Error reading @d @b %b (@i %i): %m
pl: B³±d podczas odczytu @b %b @du (@i %i): %m

source: Error writing @d @b %b (@i %i): %m
pl: B³±d podczas zapisu @b %b @du (@i %i): %m

source: @A new @d @b for @i %i (%s): %m
pl: @A nowego @bu @du dla i-wêz³a %i (%s): %m

source: Error deallocating @i %i: %m
pl: B³±d podczas zwalniania i-wêz³a %i: %m

source: @d @e for '.' in %p (%i) is big.
pl: @e @du dla '.' w %p (%i) jest du¿y.

source: @i %i (%Q) is an @I FIFO.
pl: @i %i (%Q) jest @Im FIFO.

source: @i %i (%Q) is an @I socket.
pl: @i %i (%Q) jest @Im gniazdem.

source: Setting filetype for @E to %N.
pl: Ustawiono filetype dla @eu '%Dn' w %p (%i) na %N.

source: @E has an incorrect filetype (was %Dt, @s %N).
pl: @E ma b³êdny filetype (by³ %Dt, powinien byæ %N).

source: @E has filetype set.
pl: @E ma ustawione filetype.

source: @E has a @z name.
pl: @E ma nazwê zerowej d³ugo¶ci.

source: Symlink %Q (@i #%i) is @n.
pl: Dowi±zanie symboliczne %Q (@i #%i) jest b³êdne.

source: @a @b @F @n (%If).
pl: @b rozszerzonych atrybutów dla i-wêz³a %i (%Q) jest b³êdny (%If).

source: @f contains large files, but lacks LARGE_FILE flag in @S.
pl: @f zawiera du¿e pliki, ale brak flagi LARGE_FILE w @Su.

source: @p @h %d: %B not referenced
pl: @p i-wê¼le @du HTREE %d: %B nie ma odwo³añ

source: @p @h %d: %B referenced twice
pl: @p i-wê¼le @du HTREE %d: %B ma podwójne odwo³anie

source: @p @h %d: %B has bad min hash
pl: @p i-wê¼le @du HTREE %d: %B ma b³êdny minimalny hasz

source: @p @h %d: %B has bad max hash
pl: @p i-wê¼le @du HTREE %d: %B ma b³êdny maksymalny hasz

source: @n @h %d (%q).
pl: B³êdne @h %d (%q).

source: @p @h %d (%q): bad @b number %b.
pl: @p i-wê¼le @du HTREE %d (%q): b³êdny numer @bu %b.

source: @p @h %d: root node is @n
pl: @p i-wê¼le @du HTREE %d: g³ówny wêze³ jest b³êdny

source: @p @h %d: %B has @n limit (%N)
pl: @p i-wê¼le @du HTREE %d: %B ma b³êdny limit (%N)

source: @p @h %d: %B has @n count (%N)
pl: @p i-wê¼le @du HTREE %d: %B ma b³êdny licznik (%N)

source: @p @h %d: %B has an unordered hash table
pl: @p i-wê¼le @du HTREE %d: %B ma nie uporz±dkowan± tablicê haszuj±c±

source: @p @h %d: %B has @n depth (%N)
pl: @p i-wê¼le @du HTREE %d: %B ma b³êdn± g³êboko¶æ (%N)

source: Duplicate @E found.
pl: Znaleziono podwójny @E.

source: @E has a non-unique filename. Rename to %s
pl: @E ma nieunikaln± nazwê pliku. Zmieniæ na %s

source: Duplicate @e '%Dn' found. Marking %p (%i) to be rebuilt.
pl: Znaleziono podwójny @e '%Dn'. Zaznaczono %p (%i) do przebudowania.

source: Unexpected @b in @h %d (%q).
pl: Nieoczekiwany @b w i-wê¼le @du HTREE %d (%q)

source: @E references @i %Di in @g %g where _INODE_UNINIT is set.
pl: @i %Di znaleziony w grupie %g, która ma ustawion± flagê _INONE_UNINIT.

source: @E references @i %Di found in @g %g's unused inodes area.
pl: @i %Di znaleziony w grupie %g obszaru nie u¿ywanych i-wêz³ów.

source: Pass 3: Checking @d connectivity
pl: Przebieg 3: Sprawdzanie ³±czno¶ci @dów

source: @r not allocated.
pl: @r jest nie przydzielony.

source: No room in @l @d.
pl: Brak miejsca w @du @l.

source: Unconnected @d @i %i (%p)
pl: Nie pod³±czony @i @du %i (%p)

source: /@l not found.
pl: Nie znaleziono /@l.

source: '..' in %Q (%i) is %P (%j), @s %q (%d).
pl: '..' w %Q (%i) jest %P (%j), @s %q (%d).

source: Bad or non-existent /@l. Cannot reconnect.
pl: B³êdny lub nie istniej±cy /@l. Nie mo¿na pod³±czyæ.

source: Could not expand /@l: %m
pl: Nie mo¿na rozszerzyæ /@l: %m

source: Could not reconnect %i: %m
pl: Nie mo¿na pod³±czyæ %i: %m

source: Error while trying to find /@l: %m
pl: B³±d podczas szukania /@l: %m

source: ext2fs_new_@b: %m while trying to create /@l @d
pl: ext2fs_new_block: %m podczas próby utworzenia @du /@l

source: ext2fs_new_@i: %m while trying to create /@l @d
pl: ext2fs_new_inode: %m podczas próby utworzenia @du /@l

source: ext2fs_new_dir_@b: %m while creating new @d @b
pl: ext2fs_new_dir_block: %m podczas tworzenia nowego @bu @du

source: ext2fs_write_dir_@b: %m while writing the @d @b for /@l
pl: ext2fs_write_dir_block: %m podczas zapisu @bu @du dla /@l

source: Error while adjusting @i count on @i %i
pl: B³±d podczas poprawiania liczby i-wêz³ów w i-wê¼le %i

source: Couldn't fix parent of @i %i: %m
pl: Nie mo¿na poprawiæ rodzica i-wêz³a %i: %m

source: Couldn't fix parent of @i %i: Couldn't find parent @d @e
pl: Nie mo¿na poprawiæ rodzica i-wêz³a %i: nie znaleziono wpisu @du rodzica

source: Error creating root @d (%s): %m
pl: B³±d podczas tworzenia g³ównego @du (%s): %m

source: Error creating /@l @d (%s): %m
pl: B³±d podczas tworzenia @du /@l (%s): %m

source: @r is not a @d; aborting.
pl: @r nie jest @diem; przerwanie.

source: Cannot proceed without a @r.
pl: Nie mo¿na kontynuowaæ bez g³ównego katalogu.

source: /@l is not a @d (ino=%i)
pl: /@l nie jest @diem (@i=%i)

source: Pass 3A: Optimizing directories
pl: Przebieg 3A: Optymalizacja katalogów

source: Failed to create dirs_to_hash iterator: %m
pl: Tworzenie iteratora dirs_to_hash nie powiod³o siê: %m

source: Failed to optimize directory %q (%d): %m
pl: Optymalizacja katalogu %q (%d) nie powiod³a siê: %m

source: Optimizing directories:
pl: Optymalizacja katalogów:

source: Pass 4: Checking reference counts
pl: Przebieg 4: Sprawdzanie liczników odwo³añ

source: @u @z @i %i.
pl: @u @i @z %i.

source: @i %i ref count is %Il, @s %N.
pl: licznik odwo³añ i-wêz³a %i wynosi %Il, @s %N.

source: WARNING: PROGRAMMING BUG IN E2FSCK! OR SOME BONEHEAD (YOU) IS CHECKING A MOUNTED (LIVE) FILESYSTEM. @i_link_info[%i] is %N, @i.i_links_count is %Il. They @s the same!
pl: UWAGA: B£¡D PROGRAMU W E2FSCK! LUB KTO¦ BEZMÓZGI (TY) SPRAWDZA PODMONTOWANY (¯YWY) SYSTEM PLIKÓW. inode_link_info[%i]=%N, inode.i_links_count=%Il. Powinny byæ takie same!

source: Pass 5: Checking @g summary information
pl: Przebieg 5: Sprawdzanie sumarycznych informacji o @gch

source: Padding at end of @i @B is not set.
pl: Wype³nienie na koñcu bitmapy i-wêz³ów nie jest ustawione.

source: Padding at end of @b @B is not set.
pl: Wype³nienie na koñcu bitmapy @bów nie jest ustawione.

source: @b @B differences:
pl: Ró¿nice bitmapy @bów:

source: @i @B differences:
pl: Ró¿nice bitmapy i-wêz³ów:

source: Free @is count wrong for @g #%g (%i, counted=%j).
pl: B³êdna liczba wolnych i-wêz³ów dla grupy #%g (%i, naliczono %j).

source: Directories count wrong for @g #%g (%i, counted=%j).
pl: B³êdna liczba katalogów dla grupy #%g (%i, naliczono %j).

source: Free @is count wrong (%i, counted=%j).
pl: B³êdna liczba wolnych i-wêz³ów (%i, naliczono %j).

source: Free @bs count wrong for @g #%g (%b, counted=%c).
pl: B³êdna liczba wolnych @bów dla grupy #%g (%b, naliczono %c).

source: Free @bs count wrong (%b, counted=%c).
pl: B³êdna liczba wolnych @bów (%b, naliczono %c).

source: PROGRAMMING ERROR: @f (#%N) @B endpoints (%b, %c) don't match calculated @B endpoints (%i, %j)
pl: B£¡D PROGRAMU: koñce bitmap systemu plików (#%N) (%b, %c) nie zgadzaj± siê z policzonymi koñcami bitmap (%i, %j)

source: Internal error: fudging end of bitmap (%N)
pl: B³±d wewnêtrzny: fa³szywy koniec bitmapy (%N)

source: Error copying in replacement @i @B: %m
pl: B³±d podczas kopiowania w zastêpczej bitmapie i-wêz³ów: %m

source: Error copying in replacement @b @B: %m
pl: B³±d podczas kopiowania w zastêpczej bitmapie @bów: %m

source: @g %g @b(s) in use but @g is marked BLOCK_UNINIT
pl: @b(i) grupy %g s± u¿ywane, ale @g ma flagê BLOCK_UNINIT

source: @g %g @i(s) in use but @g is marked INODE_UNINIT
pl: i-wêz³y grupy %g s± u¿ywane, ale @g ma flagê INODE_UNINIT

source: Recreate @j
pl: Odtworzyæ kronikê

source: Unhandled error code (0x%x)!
pl: Nie obs³u¿ony kod b³êdu (0x%x)!

source: IGNORED
pl: ZIGNOROWANO

source: Memory used: %d, elapsed time: %6.3f/%6.3f/%6.3f
pl: U¿yta pamiêæ: %d, up³yn±³ czas: %6.3f/%6.3f/%6.3f

source: size of inode=%d
pl: rozmiar i-wêz³a=%d

source: while starting inode scan
pl: podczas rozpoczynania przeszukiwania i-wêz³ów

source: while doing inode scan
pl: podczas przeszukiwania i-wêz³ów

source: while calling ext2fs_block_iterate for inode %d
pl: podczas wywo³ania ext2fs_block_iterate dla i-wêz³a %d

source: while calling ext2fs_adjust_ea_refcount for inode %d
pl: podczas wywo³ania ext2fs_adjust_ea_refcount dla i-wêz³a %d

source: Truncating
pl: Skracanie

source: Clearing
pl: Czyszczenie

source: Usage: %s [-panyrcdfvtDFV] [-b superblock] [-B blocksize] [-I inode_buffer_blocks] [-P process_inode_size] [-l|-L bad_blocks_file] [-C fd] [-j external_journal] [-E extended-options] device
pl: Sk³adnia: %s [-panyrcdfvtDFV] [-b superblok] [-B rozm_bloku] [-I bloków_bufora_i-wêz³ów] [-P rozmiar_i-wêz³a] [-l|-L plik_wadliwych_bloków] [-C fd] [-j zewn-kronika] [-E rozszerzone-opcje] urz±dzenie

source: Emergency help: -p Automatic repair (no questions) -n Make no changes to the filesystem -y Assume "yes" to all questions -c Check for bad blocks and add them to the badblock list -f Force checking even if filesystem is marked clean
pl: Awaryjna pomoc: -p Automatyczne naprawianie (bez pytañ) -n Nie wykonywanie zmian w systemie plików -y Przyjêcie odpowiedzi "tak" na wszystkie pytania -c Szukanie wadliwych bloków i dodanie ich do listy -f Wymuszenie sprawdzenia nawet "czystego" systemu plików

source: -v Be verbose -b superblock Use alternative superblock -B blocksize Force blocksize when looking for superblock -j external_journal Set location of the external journal -l bad_blocks_file Add to badblocks list -L bad_blocks_file Set badblocks list
pl: -v Pokazywanie wiêkszej ilo¶ci informacji -b superblok U¿ycie innego superbloku -B rozm.bloku Wymuszenie rozmiaru bloku przy poszukiwaniu superbloku -j zewn-kronika Ustawienie po³o¿enia zewnêtrznej kroniki -l plik_z³ych_bloków Dodanie do listy wadliwych bloków -L plik_z³ych_bloków Ustawienie listy wadliwych bloków

source: %s: %u/%u files (%0d.%d%% non-contiguous), %u/%u blocks
pl: %s: %u/%u plików (%0d.%d%% nieci±g³ych), %u/%u bloków

source: # of inodes with ind/dind/tind blocks: %u/%u/%u
pl: liczba i-wêz³ów z blokami ind/dind/tind: %u/%u/%u

source: Extent depth histogram:
pl: Histogram g³êboko¶ci ekstentów:

source: while determining whether %s is mounted.
pl: podczas sprawdzania, czy %s jest zamontowany.

source: Warning! %s is mounted.
pl: Uwaga! %s jest zamontowany.

source: %s is mounted.
pl: %s jest zamontowany.

source: Cannot continue, aborting.
pl: Nie mo¿na kontynuowaæ, przerwano.

source: aaaaWARNING!!! The filesystem is mounted. If you continue you ***WILL*** cause ***SEVERE*** filesystem damage.aaa
pl: aaaaUWAGA!!! System plików jest zamontowany. Kontynuacja ***SPOWODUJE*** ***POWA¯NE*** uszkodzenie systemu plików.aaa

source: Do you really want to continue
pl: Naprawdê kontynuowaæ?

source: check aborted.
pl: sprawdzanie przerwane.

source: contains a file system with errors
pl: zawiera system plików z b³êdami

source: was not cleanly unmounted
pl: nie by³ czysto odmontowany

source: primary superblock features different from backup
pl: cechy g³ównego superbloku ró¿ni± siê od kopii zapasowej

source: has been mounted %u times without being checked
pl: by³ montowany %u razy bez sprawdzania

source: has filesystem last checked time in the future
pl: ma czas ostatniego sprawdzenia systemu plików w przysz³o¶ci

source: has gone %u days without being checked
pl: przetrwa³ %u dni bez sprawdzania

source: , check forced.
pl: , wymuszono sprawdzenie.

source: %s: clean, %u/%u files, %u/%u blocks
pl: %s: czysty, %u/%u plików, %u/%u bloków

source: (check deferred; on battery)
pl: (sprawdzenie wstrzymane; zasilanie z baterii)

source: (check after next mount)
pl: (sprawdzenie po nastêpnym montowaniu)

source: (check in %ld mounts)
pl: (sprawdzenie za %ld montowañ)

source: ERROR: Couldn't open /dev/null (%s)
pl: B£¡D: Nie mo¿na otworzyæ /dev/null (%s)

source: Invalid EA version.
pl: B³êdna wersja EA.

source: Unknown extended option: %s
pl: Nieznana opcja rozszerzona: %s

source: Syntax error in e2fsck config file (%s, line #%d) %s
pl: B³±d sk³adni w pliku konfiguracyjnym e2fsck (%s, linia %d) %s

source: Error validating file descriptor %d: %s
pl: B³±d podczas kontroli deskryptora pliku %d: %s

source: Invalid completion information file descriptor
pl: B³êdne informacje dope³niaj±ce deskryptora plików

source: Only one of the options -p/-a, -n or -y may be specified.
pl: Mo¿na podaæ tylko jedn± z opcji -p/-a, -n lub -y.

source: The -t option is not supported on this version of e2fsck.
pl: Opcja -t nie jest obs³ugiwana przez tê wersjê e2fsck.

source: The -n and -D options are incompatible.
pl: Opcje -n i -D s± niekompatybilne.

source: The -n and -c options are incompatible.
pl: Opcje -n i -c s± niekompatybilne.

source: The -n and -l/-L options are incompatible.
pl: Opcje -n i -l/-L s± niekompatybilne.

source: Unable to resolve '%s'
pl: Nie uda³o siê rozwi±zaæ '%s'

source: The -c and the -l/-L options may not be both used at the same time.
pl: Opcje -c oraz -l/-L nie mog± byæ podane jednocze¶nie.

source: E2FSCK_JBD_DEBUG "%s" not an integer
pl: E2FSCK_JBD_DEBUG "%s" nie jest liczb± ca³kowit±

source: Invalid non-numeric argument to -%c ("%s")
pl: B³êdny argument nieliczbowy dla -%c ("%s")

source: Error: ext2fs library version out of date!
pl: B³±d: wersja biblioteki ext2fs jest za stara!

source: while trying to initialize program
pl: podczas próby inicjalizacji programu

source: Using %s, %s
pl: U¿ywane %s, %s

source: need terminal for interactive repairs
pl: interaktywna naprawa wymaga terminala

source: %s: %s trying backup blocks...
pl: %s: %s próba u¿ycia zapasowych bloków...

source: Superblock invalid,
pl: Superblok b³êdny,

source: Group descriptors look bad...
pl: Deskryptory grup wygl±daj± ¼le...

source: %s: going back to original superblock
pl: %s: powracanie do oryginalnego superbloku

source: The filesystem revision is apparently too high for this version of e2fsck. (Or the filesystem superblock is corrupt)
pl: Wersja systemu plików jest zbyt du¿a dla tej wersji e2fsck. (lub superblok systemu plików jest uszkodzony)

source: Could this be a zero-length partition?
pl: Czy to mo¿e jest partycja zerowej d³ugo¶ci?

source: You must have %s access to the filesystem or be root
pl: Trzeba mieæ dostêp %s do systemu plików lub byæ rootem

source: Possibly non-existent or swap device?
pl: Zapewne nie istniej±ce urz±dzenie lub swap?

source: Filesystem mounted or opened exclusively by another program?
pl: System plików zamontowany lub otwarty na wy³±czno¶æ przez inny program?

source: Disk write-protected; use the -n option to do a read-only check of the device.
pl: Dysk zabezpieczony przed zapisem; mo¿na u¿yæ opcji -n aby sprawdziæ urz±dzenie w trybie tylko do odczytu.

source: Get a newer version of e2fsck!
pl: Potrzeba nowszej wersji e2fsck!

source: while checking ext3 journal for %s
pl: podczas sprawdzania kroniki ext3 dla %s

source: Warning: skipping journal recovery because doing a read-only filesystem check.
pl: Uwaga: pominiêto odtwarzanie z kroniki z powodu sprawdzania w trybie tylko do odczytu.

source: unable to set superblock flags on %s
pl: nie mo¿na ustawiæ flag superbloku na %s

source: while recovering ext3 journal of %s
pl: podczas odtwarzania z kroniki ext3 dla %s

source: %s has unsupported feature(s):
pl: %s ma w³±czone nie obs³ugiwane cechy:

source: Warning: compression support is experimental.
pl: Uwaga: obs³uga kompresji jest eksperymentalna.

source: E2fsck not compiled with HTREE support, but filesystem %s has HTREE directories.
pl: E2fsck skompilowany bez obs³ugi HTREE, ale system plików %s ma katalogi HTREE.

source: while reading bad blocks inode
pl: podczas odczytu i-wêz³a wadliwych bloków

source: This doesn't bode well, but we'll try to go on...
pl: Nie wró¿y to dobrze, ale spróbujê kontynuowaæ...

source: Couldn't determine journal size
pl: Nie uda³o siê okre¶liæ rozmiaru kroniki

source: Creating journal (%d blocks):
pl: Tworzenie kroniki (%d bloków):

source: while trying to create journal
pl: podczas próby utworzenia kroniki

source: Done.
pl: Wykonano.

source: *** journal has been re-created - filesystem is now ext3 again ***
pl: *** kronika zosta³a ponownie utworzona - system plików to znowu ext3 ***

source: Restarting e2fsck from the beginning...
pl: Restart e2fsck od pocz±tku...

source: while resetting context
pl: podczas resetowania kontekstu

source: %s: e2fsck canceled.
pl: %s: e2fsck przerwany.

source: aborted
pl: przerwano

source: %s: ***** FILE SYSTEM WAS MODIFIED *****
pl: %s: ***** SYSTEM PLIKÓW ZMODYFIKOWANY *****

source: %s: ***** REBOOT LINUX *****
pl: %s: ***** WYMAGANY RESTART LINUKSA *****

source: %s: ********** WARNING: Filesystem still has errors **********
pl: %s: ********** UWAGA: System plików nadal ma b³êdy **********

source: while setting block group checksum info
pl: podczas ustawiania informacji o sumie kontrolnej grupy bloków

source: yY
pl: tTyY

source: <y>
pl: <t>

source: (y/n)
pl: (t/n)

source: cancelled!
pl: anulowano!

source: yes
pl: tak

source: no
pl: nie

source: %s? no
pl: %s? nie

source: %s? yes
pl: %s? tak

source: yes
pl: tak

source: no
pl: nie

source: e2fsck_read_bitmaps: illegal bitmap block(s) for %s
pl: e2fsck_read_bitmaps: niedopuszczalne bloki bitmapy dla %s

source: reading inode and block bitmaps
pl: odczytu bitmap i-wêz³ów i bloków
