Repository: RMerl/asuswrt-merlin
Catalog: release/src/router/e2fsprogs/po/*.po
Languages: pl

source: This may result in very poor performance, (re)-partitioning suggested.
pl: Mo¿e to powodowaæ bardzo nisk± wydajno¶æ, zalecane jest (prze)partycjonowanie.

source: reserved online resize blocks not supported on non-sparse filesystem
pl: zarezerwowane bloki do zmiany rozmiaru w locie nie obs³ugiwane na nieci±g³ym systemie plików

source: blocks per group count out of range
pl: liczba bloków w grupie spoza zakresu

source: Flex_bg feature not enabled, so flex_bg size may not be specified
pl: Cecha flex_bg nie jest w³±czona, wiêc nie mo¿na okre¶liæ rozmiaru flex_bg

source: invalid inode size %d (min %d/max %d)
pl: b³êdny rozmiar i-wêz³a %d (min %d/max %d)

source: too many inodes (%llu), raise inode ratio?
pl: zbyt ma³o i-wêz³ów (%llu), zwiêkszyæ wspó³czynnik i-wêz³ów?

source: too many inodes (%llu), specify < 2^32 inodes
pl: zbyt du¿o i-wêz³ów (%llu), nale¿y podaæ < 2^32

source: inode_size (%u) * inodes_count (%u) too big for a filesystem with %lu blocks, specify higher inode_ratio (-i) or lower inode count (-N).
pl: rozm_iwêz³a (%u) * liczba_iwêz³ów (%u) zbyt du¿e dla systemu plików o liczbie bloków %lu, nale¿y podaæ wiêkszy wspó³czynnik (-i) lub mniejsz± liczbê i-wêz³ów (-N).

source: Couldn't allocate memory for tdb filename
pl: Nie mo¿na przydzieliæ pamiêci na nazwê plików tdb

source: while trying to delete %s
pl: podczas próby usuniêcia %s

source: Overwriting existing filesystem; this can be undone using the command: e2undo %s %s
pl: Nadpisywanie istniej±cego systemu plików; mo¿na to wycofaæ poleceniem: e2undo %s %s

source: Calling BLKDISCARD from %llu to %llu
pl: Wywo³anie BLKDISCARD z %llu na %llu

source: failed.
pl: nie powiod³o siê.

source: succeeded.
pl: powiod³o siê.

source: while setting up superblock
pl: podczas ustawiania superbloku

source: unknown os - %s
pl: nieznany os - %s

source: while trying to allocate filesystem tables
pl: podczas próby przydzielenia tablic systemu plików

source: while zeroing block %u at end of filesystem
pl: podczas zerowania bloku %u na koñcu systemu plików

source: while reserving blocks for online resize
pl: podczas rezerwowania bloków na zmianê rozmiaru w locie

source: journal
pl: kronika

source: Adding journal to device %s:
pl: Dodano kronikê do urz±dzenia %s:

source: while trying to add journal to device %s
pl: podczas próby dodania kroniki do urz±dzenia %s

source: done
pl: wykonano

source: Skipping journal creation in super-only mode
pl: Pominiêto tworzenie kroniki w trybie super-only

source: Creating journal (%u blocks):
pl: Tworzenie kroniki (%u bloków):

source: Writing superblocks and filesystem accounting information:
pl: Zapis superbloków i podsumowania systemu plików:

source: Warning, had trouble writing out superblocks.
pl: Uwaga, problemy z zapisem superbloków.

source: done
pl: wykonano

source: Usage: mklost+found
pl: Sk³adnia: mklost+found

source: Usage: %s device... Prints out the partition information for each given device. For example: %s /dev/hda
pl: Sk³adnia: %s urz±dzenie... Wypisanie informacji o partycjach na ka¿dym podanym urz±dzeniu. Przyk³ad: %s /dev/hda

source: Cannot open %s: %s
pl: Nie mo¿na otworzyæ %s: %s

source: Cannot get geometry of %s: %s
pl: Nie mo¿na pobraæ geometrii %s: %s

source: Cannot get size of %s: %s
pl: Nie mo¿na pobraæ rozmiaru %s: %s

source: %s: h=%3d s=%3d c=%4d start=%8d size=%8lu end=%8d
pl: %s: h=%3d s=%3d c=%4d pocz±tek=%8d rozmiar=%8lu koniec=%8d

source: Please run e2fsck on the filesystem.
pl: Proszê uruchomiæ e2fsck na systemie plików.

source: Usage: %s [-c max_mounts_count] [-e errors_behavior] [-g group] [-i interval[d|m|w]] [-j] [-J journal_options] [-l] [-m reserved_blocks_percent] [-o [^]mount_options[,...]] [-r reserved_blocks_count] [-u user] [-C mount_count] [-L volume_label] [-M last_mounted_dir] [-O [^]feature[,...]] [-E extended-option[,...]] [-T last_check_time] [-U UUID] [ -I new_inode_size ] device
pl: Sk³adnia: %s [-c max_licznik_montowañ] [-e trakt._b³êdów] [-g grupa] [-i odstêp[d|m|w]] [-j] [-J opcje_kroniki] [-l] [-m procent_rezerw._bloków] [-o [^]opcje_montowania[,...]] [-r liczba_zarez._bloków] [-u u¿ytkownik] [-C licznik_montowañ] [-L etykieta_wolumenu] [-M ostatnio_mont._katalog] [-O [^]cecha[,...]] [-E opcja_rozszerzona[,...]] [-T czas_ost._sprawdz.] [-U UUID] [-I nowy_rozmiar_i-wêz³a] urz±dzenie

source: while trying to open external journal
pl: podczas próby otworzenia zewnêtrznej kroniki

source: %s is not a journal device.
pl: %s nie jest urz±dzeniem kroniki.

source: Journal superblock not found!
pl: Nie znaleziono superbloku kroniki!

source: Filesystem's UUID not found on journal device.
pl: UUID systemu plików nie znaleziony na urz±dzeniu kroniki.

source: Journal NOT removed
pl: Kronika NIE usuniêta

source: Journal removed
pl: Kronika usuniêta

source: while reading bitmaps
pl: podczas odczytu bitmap

source: while clearing journal inode
pl: podczas czyszczenia i-wêz³a kroniki

source: while writing journal inode
pl: podczas zapisu i-wêz³a kroniki

source: Invalid mount option set: %s
pl: Ustawiona b³êdna opcja montowania: %s

source: Clearing filesystem feature '%s' not supported.
pl: Usuwanie cechy systemu plików '%s' nie jest obs³ugiwane.

source: Setting filesystem feature '%s' not supported.
pl: Ustawianie cechy systemu plików '%s' nie jest obs³ugiwane.

source: The has_journal feature may only be cleared when the filesystem is unmounted or mounted read-only.
pl: Flaga has_journal mo¿e byæ wyczyszczona tylko kiedy system plików jest odmontowany lub zamontowany tylko do odczytu.

source: The needs_recovery flag is set. Please run e2fsck before clearing the has_journal flag.
pl: Flaga needs_recovery jest ustawiona. Proszê uruchomiæ e2fsck przed czyszczeniem flagi has_journal.

source: Clearing the flex_bg flag would cause the the filesystem to be inconsistent.
pl: Wy³±czenie flagi flex_bg spowoduje niespójno¶æ systemu plików.

source: The huge_file feature may only be cleared when the filesystem is unmounted or mounted read-only.
pl: Flaga huge_file mo¿e byæ wyczyszczona tylko kiedy system plików jest odmontowany lub zamontowany tylko do odczytu.

source: (and reboot afterwards!)
pl: (proszê zrestartowaæ potem system!)

source: The filesystem already has a journal.
pl: System plików ju¿ ma kronikê.

source: while trying to open journal on %s
pl: podczas próby otworzenia kroniki na %s

source: Creating journal on device %s:
pl: Tworzenie kroniki na urz±dzeniu %s:

source: while adding filesystem to journal on %s
pl: podczas dodawania systemu plików do kroniki na %s

source: Creating journal inode:
pl: Tworzenie i-wêz³a kroniki:

source: while trying to create journal file
pl: podczas próby utworzenia pliku kroniki

source: Couldn't parse date/time specifier: %s
pl: Nie mo¿na przeanalizowaæ podanej daty/czasu: %s

source: bad mounts count - %s
pl: b³êdna liczba montowañ - %s

source: bad error behavior - %s
pl: b³êdne traktowanie b³êdów - %s

source: bad gid/group name - %s
pl: b³êdny gid/nazwa grupy - %s

source: bad interval - %s
pl: b³êdny odstêp - %s

source: bad reserved block ratio - %s
pl: b³êdny procent zarezerwowanych bloków - %s

source: -o may only be specified once
pl: -o mo¿e byæ podane tylko raz

source: -O may only be specified once
pl: -O mo¿e byæ podane tylko raz

source: bad reserved blocks count - %s
pl: b³êdna liczba zarezerwowanych bloków - %s

source: bad uid/user name - %s
pl: b³êdny uid/nazwa u¿ytkownika - %s

source: bad inode size - %s
pl: b³êdny rozmiar i-wêz³a - %s

source: Inode size must be a power of two- %s
pl: Rozmiar i-wêz³a musi byæ potêg± dwójki - %s

source: Invalid RAID stride: %s
pl: B³êdny parametr RAID stride: %s

source: Invalid RAID stripe-width: %s
pl: B³êdny parametr RAID stripe-width: %s

source: Invalid hash algorithm: %s
pl: B³êdny algorytm haszowania: %s

source: Setting default hash algorithm to %s (%d)
pl: Ustawianie domy¶lnego algorytmu haszowania na %s (%d)

source: Bad options specified. Extended options are separated by commas, and may take an argument which is set off by an equals ('=') sign. Valid extended options are: stride=<RAID per-disk chunk size in blocks> stripe_width=<RAID stride*data disks in blocks> hash_alg=<hash algorithm> test_fs ^test_fs
pl: Podano b³êdne opcje. Opcje rozszerzone s± oddzielane przecinkami i mog± przyjmowaæ parametr, który jest ustawiany znakiem '='. Poprawne opcje to: stride=<rozmiar porcji danych RAID na dysku w blokach> stripe_width=<RAID stride * liczba dysków danych w blokach> hash_alg=<algorytm haszowania> test_fs ^test_fs

source: blocks to be moved
pl: bloki do przeniesienia

source: Failed to allocate block bitmap when increasing inode size
pl: Nie uda³o siê przydzieliæ bitmapy bloków podczas zwiêkszania rozmiaru i-wêz³a

source: Not enough space to increase inode size
pl: Za ma³o miejsca, aby zwiêkszyæ rozmiar i-wêz³a

source: Failed to relocate blocks during inode resize
pl: Nie uda³o siê przemie¶ciæ bloków podczas zmiany rozmiaru i-wêz³a

source: Error in resizing the inode size. Run e2undo to undo the file system changes.
pl: B³±d podczas zmiany rozmiaru i-wêz³a. Nale¿y uruchomiæ e2undo w celu wycofania zmian w systemie plików.

source: To undo the tune2fs operation please run the command e2undo %s %s
pl: Aby wycofaæ operacjê tune2fs, proszê wydaæ polecenie e2undo %s %s

source: The inode size is already %lu
pl: Rozmiar i-wêz³a ju¿ wynosi %lu

source: Shrinking the inode size is not supported
pl: Zmniejszanie rozmiaru i-wêz³a nie jest obs³ugiwane

source: Setting maximal mount count to %d
pl: Ustawianie maksymalnej liczby montowañ na %d

source: Setting current mount count to %d
pl: Ustawianie aktualnego licznika montowañ na %d

source: Setting error behavior to %d
pl: Ustawianie traktowania b³êdów na %d

source: Setting reserved blocks gid to %lu
pl: Ustawianie gid-a zarezerwowanych bloków na %lu

source: Setting interval between checks to %lu seconds
pl: Ustawianie odstêpu pomiêdzy sprawdzeniami na %lu sekund

source: Setting reserved blocks percentage to %g%% (%u blocks)
pl: Ustawianie procent zarezerwowanych bloków na %g%% (%u bloków)

source: reserved blocks count is too big (%lu)
pl: liczba zarezerwowanych bloków zbyt du¿e (%lu)

source: Setting reserved blocks count to %lu
pl: Ustawianie liczby zarezerwowanych bloków na %lu

source: The filesystem already has sparse superblocks.
pl: System plików ju¿ ma rzadkie superbloki.

source: Sparse superblock flag set. %s
pl: Flaga rzadkich superbloków ustawiona. %s

source: Clearing the sparse superflag not supported.
pl: Usuwanie superflagi sparse nie jest obs³ugiwane.

source: Setting time filesystem last checked to %s
pl: Ustawianie czasu ostatniego sprawdzenia systemu plików na %s

source: Setting reserved blocks uid to %lu
pl: Ustawianie uid-a zarezerwowanych bloków na %lu

source: Invalid UUID format
pl: B³êdny format UUID-a

source: The inode size may only be changed when the filesystem is unmounted.
pl: Rozmiar i-wêz³a mo¿na zmieniæ tylko na niezamontowanym systemie plików.

source: Changing the inode size not supported for filesystems with the flex_bg feature enabled.
pl: Zmiana rozmiaru i-wêz³a nie jest obs³ugiwana dla systemów plików z w³±czon± cech± flex_bg.

source: Setting inode size %lu
pl: Ustawianie rozmiaru i-wêz³a na %lu

source: Setting stride size to %d
pl: Ustawianie rozmiaru stride na %d

source: Setting stripe width to %d
pl: Ustawianie szeroko¶ci stripe na na %d

source: Proceed anyway? (y,n)
pl: Kontynuowaæ mimo to? (t,n)

source: Could not stat %s --- %s
pl: Nie mo¿na wykonaæ stat na %s --- %s

source: The device apparently does not exist; did you specify it correctly?
pl: Urz±dzenie najwyra¼niej nie istnieje; czy zosta³o podane poprawnie?

source: %s is not a block special device.
pl: %s nie jest specjalnym urz±dzeniem blokowym.

source: %s is entire device, not just one partition!
pl: %s jest ca³ym urz±dzeniem, a nie tylko jedn± partycj±!

source: mke2fs forced anyway. Hope /etc/mtab is incorrect.
pl: mke2fs wymuszone mimo to. Mam nadziejê, ¿e /etc/mtab siê myli.

source: will not make a %s here!
pl: nie zrobiê tutaj %s!

source: mke2fs forced anyway.
pl: mke2fs wymuszone mimo to.

source: Couldn't allocate memory to parse journal options!
pl: Nie mo¿na przydzieliæ pamiêci na analizê opcji kroniki!

source: Could not find journal device matching %s
pl: Nie mo¿na znale¼æ urz±dzenia kroniki pasuj±cego do %s

source: Bad journal options specified. Journal options are separated by commas, and may take an argument which is set off by an equals ('=') sign. Valid journal options are: size=<journal size in megabytes> device=<journal device> The journal size must be between 1024 and 10240000 filesystem blocks.
pl: Podano b³êdne opcje kroniki. Opcje kroniki s± oddzielane przecinkami i mog± przyjmowaæ parametr, który ustawia siê znakiem '='. Poprawne opcje kroniki to: size=<rozmiar kroniki w megabajtach> device=<urz±dzenie kroniki> Rozmiar kroniki musi byæ pomiêdzy 1024 a 10240000 blokami systemu plików.

source: Filesystem too small for a journal
pl: System plików za ma³y na kronikê

source: The requested journal size is %d blocks; it must be between 1024 and 10240000 blocks. Aborting.
pl: ¯±dany rozmiar kroniki to %d bloków; musi byæ pomiêdzy 1024 a 10240000 bloków. Przerwano.

source: Journal size too big for filesystem.
pl: Rozmiar kroniki zbyt du¿y dla systemu plików.

source: This filesystem will be automatically checked every %d mounts or %g days, whichever comes first. Use tune2fs -c or -i to override.
pl: Ten system plików bêdzie automatycznie sprawdzany co ka¿de %d montowañ lub co %g dni, zale¿nie co nast±pi pierwsze. Mo¿na to zmieniæ poprzez tune2fs -c lub -i.

source: Usage: %s [-r] [-t]
pl: Sk³adnia: %s [-r] [-t]

source: # Extent dump:
pl: # Zrzut ekstentu:

source: # Num=%d, Size=%d, Cursor=%d, Sorted=%d
pl: # Num=%d, Rozmiar=%d, Kursor=%d, Sortowane=%d

source: Usage: %s [-d debug_flags] [-f] [-F] [-M] [-P] [-p] device [new_size]
pl: Sk³adnia: %s [-d flagi_¶ledzenia] [-f] [-F] [-M] [-P] [-p] urz±dzenie [nowy_rozm]

source: Extending the inode table
pl: Rozszerzanie tablicy i-wêz³ów

source: Relocating blocks
pl: Relokowanie bloków

source: Scanning inode table
pl: Przeszukiwanie tablicy i-wêz³ów

source: Updating inode references
pl: Uaktualnianie odwo³añ do i-wêz³ów

source: Moving inode table
pl: Przenoszenie tablicy i-wêz³ów

source: Unknown pass?!?
pl: Nieznany przebieg?!?

source: Begin pass %d (max = %lu)
pl: Pocz±tkowy przebieg %d (maksymalny = %lu)

source: while opening %s
pl: podczas otwierania %s

source: while getting stat information for %s
pl: podczas pobierania informacji stat dla %s

source: %s: The combination of flex_bg and !resize_inode features is not supported by resize2fs.
pl: %s: Kombinacja cech flex_bg i !resize_inode nie jest obs³ugiwana przez resize2fs.

source: Please run 'e2fsck -f %s' first.
pl: Proszê uruchomiæ najpierw 'e2fsck -f %s'.

source: Estimated minimum size of the filesystem: %u
pl: Przybli¿ony minimalny rozmiar systemu plików: %u

source: Invalid new size: %s
pl: B³êdny nowy rozmiar: %s

source: New size smaller than minimum (%u)
pl: Nowy rozmiar jest mniejszy ni¿ minimalny (%u)

source: Invalid stride length
pl: B³êdna d³ugo¶æ stride

source: The containing partition (or device) is only %u (%dk) blocks. You requested a new size of %u blocks.
pl: Partycja zawieraj±ca (lub urz±dzenie) ma tylko %u bloków (%dk). Za¿±dano nowego rozmiaru %u bloków.

source: The filesystem is already %u blocks long. Nothing to do!
pl: System plików ju¿ ma wielko¶æ %u bloków. Nie ma nic do roboty!

source: Resizing the filesystem on %s to %u (%dk) blocks.
pl: Zmiana rozmiaru systemu plików %s na %u (%dk) bloków.

source: while trying to resize %s
pl: podczas próby zmiany rozmiaru %s

source: Please run 'e2fsck -fy %s' to fix the filesystem after the aborted resize operation.
pl: Proszê uruchomiæ 'e2fsck -fy %s', aby naprawiæ system plików po przerwanej operacji zmiany rozmiaru.

source: The filesystem on %s is now %u blocks long.
pl: System plików na %s ma teraz %u bloków.

source: while trying to truncate %s
pl: podczas próby skrócenia %s

source: Filesystem at %s is mounted on %s; on-line resizing required
pl: System plików %s jest zamontowany pod %s; wymagana zmiana rozmiaru w locie

source: On-line shrinking from %u to %u not supported.
pl: Zmniejszanie w locie z %u na %u nie jest obs³ugiwane.

source: Filesystem does not support online resizing
pl: System plików nie obs³uguje zmiany rozmiaru w locie

source: while trying to open mountpoint %s
pl: podczas próby otwarcia punktu montowania %s

source: Permission denied to resize filesystem
pl: Brak uprawnieñ do zmiany rozmiaru systemu plików

source: Kernel does not support online resizing
pl: J±dro nie obs³uguje zmiany rozmiaru w locie

source: While checking for on-line resizing support
pl: Podczas sprawdzania obs³ugi zmiany rozmiaru w locie

source: Performing an on-line resize of %s to %u (%dk) blocks.
pl: Wykonywanie zmiany rozmiaru w locie %s na %u (%dk) bloków.

source: While trying to extend the last group
pl: Podczas próby rozszerzenia ostatniej grupy

source: While trying to add group #%d
pl: Podczas próby dodania grupy #%d

source: Filesystem at %s is mounted on %s, and on-line resizing is not supported on this system.
pl: System plików na %s jest zamontowany pod %s, zmiana rozmiaru w locie nie jest obs³ugiwana na tym systemie.

source: inodes (%llu) must be less than %u
pl: liczba i-wêz³ów (%llu) musi byæ mniejsza ni¿ %u

source: reserved blocks
pl: zarezerwowane bloki

source: meta-data blocks
pl: bloki metadanych

source: Should never happen: resize inode corrupt!
pl: Nigdy siê nie powinno zdarzyæ: i-wêze³ zmiany rozmiaru uszkodzony!
