Repository: RMerl/asuswrt-merlin
Catalog: release/src/router/e2fsprogs/po/*.po
Languages: pl

source: while retrying to read bitmaps for %s
pl: podczas ponawiania próby odczytu bitmap dla %s

source: writing block and inode bitmaps
pl: zapisu bitmap bloków i i-wêz³ów

source: while rewriting block and inode bitmaps for %s
pl: podczas ponownego zapisu bitmap blików i i-wêz³ów dla %s

source: %s: UNEXPECTED INCONSISTENCY; RUN fsck MANUALLY. (i.e., without -a or -p options)
pl: %s: NIEOCZEKIWANA NIESPÓJNO¦Æ; TRZEBA URUCHOMIÆ fsck RÊCZNIE. (tzn. bez opcji -a ani -p)

source: Memory used: %luk/%luk (%luk/%luk),
pl: U¿yta pamiêæ: %luk/%luk (%luk/%luk),

source: Memory used: %lu,
pl: U¿yta pamiêæ: %lu,

source: time: %5.2f/%5.2f/%5.2f
pl: czas: %5.2f/%5.2f/%5.2f

source: elapsed time: %6.3f
pl: up³yn±³ czas: %6.f

source: while reading inode %lu in %s
pl: podczas odczytu i-wêz³a %lu w %s

source: while writing inode %lu in %s
pl: podczas zapisu i-wêz³a %lu w %s

source: while allocating zeroizing buffer
pl: podczas przydzielania bufora zeruj±cego

source: done
pl: zakoñczono

source: Usage: %s [-b block_size] [-i input_file] [-o output_file] [-svwnf] [-c blocks_at_once] [-d delay_factor_between_reads] [-e max_bad_blocks] [-p num_passes] [-t test_pattern [-t test_pattern [...]]] device [last_block [first_block]]
pl: Sk³adnia: %s [-b rozm_bloku] [-i plik_wej] [-o plik_wyj] [-svwnf] [-c bloków_naraz] [-d wsp_opó¼n_miêdzy_odczytami] [-e maks_b³êdnych_bloków] [-p przebiegów] [-t wzór_testowy [-t wzór_testowy [...]]] urz±dzenie [ostatni_blok [pierwszy_blok]]

source: %s: The -n and -w options are mutually exclusive.
pl: %s: Opcje -n i -w wykluczaj± siê wzajemnie.

source: %6.2f%% done, %s elapsed
pl: Gotowe w %6.2f%%, minê³o %s

source: Testing with random pattern:
pl: Testowanie wzorcem losowym:

source: Testing with pattern 0x
pl: Testowanie wzorcem 0x

source: during seek
pl: podczas przeskakiwania

source: Weird value (%ld) in do_read
pl: Dziwna warto¶æ (%ld) w do_read

source: during ext2fs_sync_device
pl: podczas ext2fs_sync_device

source: while beginning bad block list iteration
pl: podczas rozpoczynania iteracji po li¶cie wadliwych bloków

source: while allocating buffers
pl: podczas przydzielania buforów

source: Checking blocks %lu to %lu
pl: Sprawdzanie bloków od %lu do %lu

source: Checking for bad blocks in read-only mode
pl: Poszukiwanie wadliwych bloków w trybie tylko do odczytu

source: Checking for bad blocks (read-only test):
pl: Poszukiwanie wadliwych bloków (tylko odczyt):

source: Too many bad blocks, aborting test
pl: Zbyt du¿o wadliwych bloków, przerwanie testu

source: Checking for bad blocks in read-write mode
pl: Poszukiwanie wadliwych bloków w trybie odczytu i zapisu

source: From block %lu to %lu
pl: Od bloku %lu do %lu

source: Reading and comparing:
pl: Odczyt i porównywanie:

source: Checking for bad blocks in non-destructive read-write mode
pl: Poszukiwanie wadliwych bloków w trybie z niedestruktywnym zapisem

source: Checking for bad blocks (non-destructive read-write test)
pl: Poszukiwanie wadliwych bloków (odczyt i niedestruktywny zapis)

source: Interrupt caught, cleaning up
pl: Otrzymano przerwanie, sprz±tam

source: during test data write, block %lu
pl: podczas zapisu testowych danych, blok %lu

source: %s is mounted;
pl: %s jest zamontowany;

source: badblocks forced anyway. Hope /etc/mtab is incorrect.
pl: badblocks wymuszone mimo to. Mam nadziejê, ¿e /etc/mtab siê myli.

source: it's not safe to run badblocks!
pl: nie jest bezpiecznie uruchamiaæ badblocks!

source: %s is apparently in use by the system;
pl: %s jest najwyra¼niej u¿ywany przez system;

source: badblocks forced anyway.
pl: badblocks wymuszone mimo to.

source: invalid %s - %s
pl: b³êdny %s - %s

source: can't allocate memory for test_pattern - %s
pl: nie mo¿na przydzieliæ pamiêci na wzorzec_testowy - %s

source: Maximum of one test_pattern may be specified in read-only mode
pl: W trybie odczytu-zapisu mo¿na podaæ najwy¿ej jeden wzorzec testowy

source: Random test_pattern is not allowed in read-only mode
pl: W trybie samego odczytu nie mo¿na podaæ wzorca_testowego

source: Couldn't determine device size; you must specify the size manually
pl: Nie mo¿na okre¶liæ rozmiaru urz±dzenia; trzeba podaæ rozmiar rêcznie

source: while trying to determine device size
pl: podczas próby okre¶lenia rozmiaru urz±dzenia

source: last block
pl: ostatni blok

source: first block
pl: pierwszy blok

source: invalid starting block (%lu): must be less than %lu
pl: b³êdny pocz±tkowy blok (%lu): musi byæ mniejszy ni¿ %lu

source: while creating in-memory bad blocks list
pl: podczas tworzenia listy wadliwych bloków w pamiêci

source: while adding to in-memory bad block list
pl: podczas dodawania do listy wadliwych bloków w pamiêci

source: Pass completed, %u bad blocks found.
pl: Przebieg zakoñczony, znaleziono %u wadliwych bloków.

source: Usage: %s [-RVf] [-+=AacDdeijsSu] [-v version] files...
pl: Sk³adnia: %s [-RVf] [-+=AacDdeijsSu] [-v wersja] pliki...

source: bad version - %s
pl: b³êdna wersja - %s

source: while trying to stat %s
pl: podczas próby stat %s

source: while reading flags on %s
pl: podczas odczytu flag %s

source: Clearing extent flag not supported on %s
pl: Usuwanie flagi ekstentów nie jest obs³ugiwane na %s

source: Flags of %s set as
pl: Flagi %s ustawiono jako

source: while setting flags on %s
pl: podczas ustawiania flag %s

source: Version of %s set as %lu
pl: Wersja %s ustawiona jako %lu

source: while setting version on %s
pl: podczas ustawiania wersji %s

source: Couldn't allocate path variable in chattr_dir_proc
pl: Nie mo¿na przydzieliæ zmiennej path w chattr_dir_proc

source: = is incompatible with - and +
pl: = jest niekompatybilne z - i +

source: Must use '-v', =, - or +
pl: Trzeba u¿yæ '-v', =, - lub +

source: Usage: %s [-bfhixV] [-o superblock=<num>] [-o blocksize=<num>] device
pl: Sk³adnia: %s [-bfhixV] [-o superblok=<numer>] [-o blocksize=<rozmiar>] urz±dzenie

source: Group %lu: (Blocks
pl: Grupa %lu: (Bloki

source: Checksum 0x%04x, unused inodes %d
pl: Suma kontrolna 0x%04x, %d nie u¿ywanych i-wêz³ów

source: %s superblock at
pl: %s superblok pod

source: Primary
pl: G³ówny

source: Backup
pl: Zapasowy

source: , Group descriptors at
pl: , Deskryptory grup pod

source: Reserved GDT blocks at
pl: Zarezerwowane bloki GDT pod

source: Group descriptor at
pl: , Deskryptory grup pod

source: Block bitmap at
pl: Bitmapa bloków pod

source: , Inode bitmap at
pl: , bitmapa i-wêz³ów pod

source: Inode table at
pl: Tablica i-wêz³ów pod

source: %u free blocks, %u free inodes, %u directories%s
pl: %u wolnych bloków, %u wolnych i-wêz³ów, %u katalogów%s

source: , %u unused inodes
pl: , %u nie u¿ywanych i-wêz³ów

source: Free blocks:
pl: Wolne bloki:

source: Free inodes:
pl: Wolne i-wêz³y:

source: while printing bad block list
pl: podczas wypisywania listy wadliwych bloków

source: Bad blocks: %u
pl: Wadliwe bloki: %u

source: while reading journal inode
pl: podczas odczytu i-wêz³a kroniki

source: while opening journal inode
pl: podczas otwierania i-wêz³a kroniki

source: while reading journal super block
pl: podczas odczytu superbloku kroniki

source: Journal features:
pl: Cechy kroniki:

source: Journal size:
pl: Rozmiar kroniki:

source: Journal length: %u Journal sequence: 0x%08x Journal start: %u
pl: D³ugo¶æ kroniki: %u Sekwencja kroniki: 0x%08x Pocz±tek kroniki: %u

source: while reading journal superblock
pl: podczas odczytu superbloku kroniki

source: Couldn't find journal superblock magic numbers
pl: Nie mo¿na znale¼æ magicznych liczb superbloku kroniki

source: Journal block size: %u Journal length: %u Journal first block: %u Journal sequence: 0x%08x Journal start: %u Journal number of users: %u
pl: Rozmiar bloku kroniki: %u D³ugo¶æ kroniki: %u Pierwszy blok kroniki: %u Sekwencja kroniki: 0x%08x Pocz±tek kroniki: %u Liczba u¿ytkowników kroniki: %u

source: Journal users: %s
pl: U¿ytkownicy kroniki: %s

source: Couldn't allocate memory to parse options!
pl: Nie mo¿na przydzieliæ pamiêci do analizy opcji!

source: Invalid superblock parameter: %s
pl: B³êdny parametr superblock: %s

source: Invalid blocksize parameter: %s
pl: B³êdny parametr blocksize: %s

source: Bad extended option(s) specified: %s Extended options are separated by commas, and may take an argument which is set off by an equals ('=') sign. Valid extended options are: superblock=<superblock number> blocksize=<blocksize>
pl: Podano b³êdne opcje rozszerzone: %s. Opcje rozszerzone s± oddzielane przecinkami i mog± przyjmowaæ parametr, który jest ustawiany znakiem '='. Poprawne opcje rozszerzone to: superblock=<numer superbloku> blocksize=<rozmiar bloku>

source: Using %s
pl: U¿ywane %s

source: Couldn't find valid filesystem superblock.
pl: Nie mo¿na znale¼æ poprawnego superbloku systemu plików.

source: %s: %s: error reading bitmaps: %s
pl: %s: %s: b³±d podczas czytania bitmap: %s

source: Usage: %s [-rsI] device image_file
pl: Sk³adnia: %s [-rsI] urz±dzenie plik_obrazu

source: Couldn't allocate header buffer
pl: Nie mo¿na przydzieliæ bufora nag³ówka

source: short write (only %d bytes) for writing image header
pl: skrócony zapis (tylko %d bajtów) podczas zapisu nag³ówka obrazu

source: while writing superblock
pl: podczas zapisu superbloku

source: while writing inode table
pl: podczas zapisu tabeli i-wêz³ów

source: while writing block bitmap
pl: podczas zapisu bitmapy bloków

source: while writing inode bitmap
pl: podczas zapisu bitmapy i-wêz³ów

source: e2label: cannot open %s
pl: e2label: nie mo¿na otworzyæ %s

source: e2label: cannot seek to superblock
pl: e2label: nie mo¿na przej¶æ do superbloku

source: e2label: error reading superblock
pl: e2label: b³±d podczas odczytu superbloku

source: e2label: not an ext2 filesystem
pl: e2label: to nie jest system plików ext2

source: Warning: label too long, truncating.
pl: Uwaga: etykieta za d³uga, skrócono.

source: e2label: cannot seek to superblock again
pl: e2label: nie mo¿na przej¶æ ponownie do superbloku

source: e2label: error writing superblock
pl: e2label: b³±d podczas zapisu superbloku

source: Usage: e2label device [newlabel]
pl: Sk³adnia: e2label urz±dzenie [nowa-etykieta]

source: Usage: %s <transaction file> <filesystem>
pl: Sk³adnia: %s <plik_transakcji> <system_plików>

source: Failed to read the file system data
pl: Nie uda³o siê odczytaæ danych systemu plików

source: Failed tdb_fetch %s
pl: tdb_fetch %s nie powiod³o siê

source: The file system Mount time didn't match %u
pl: Czas montowania systemu plików nie odpowiada %u

source: The file system UUID didn't match
pl: UUID systemu plików nie pasuje

source: Failed tdb_open %s
pl: tdb_open %s nie powiod³o siê

source: Error while determining whether %s is mounted.
pl: B³±d podczas sprawdzania, czy %s jest zamontowany.

source: e2undo should only be run on unmounted file system
pl: e2undo powinno byæ uruchamiane tylko na odmontowanym systemie plików

source: Failed to open %s
pl: Nie uda³o siê otworzyæ %s

source: Replayed transaction of size %zd at location %ld
pl: Odtworzono transakcjê rozmiaru %zd w po³o¿eniu %ld

source: Failed write %s
pl: Nie uda³o siê zapisaæ %s

source: WARNING: couldn't open %s: %s
pl: UWAGA: nie mo¿na otworzyæ %s: %s

source: WARNING: bad format on line %d of %s
pl: UWAGA: z³y format w linii %d pliku %s

source: aaaWARNING: Your /etc/fstab does not contain the fsck passno field. I will kludge around things for you, but you should fix your /etc/fstab file as soon as you can.
pl: aaaUWAGA: /etc/fstab nie zawiera pola passno dla fsck. Pominê ten b³±d, ale /etc/fstab nale¿y jak najszybciej poprawiæ.

source: fsck: %s: not found
pl: fsck: %s: nie znaleziono

source: %s: wait: No more child process?!?
pl: %s: wait: Nie ma wiêcej procesów potomnych?!?

source: Warning... %s for device %s exited with signal %d.
pl: Uwaga... %s dla urz±dzenia %s zakoñczy³ siê sygna³em %d.

source: %s %s: status is %x, should never happen.
pl: %s %s: status wynosi %x, to siê nie powinno nigdy zdarzyæ.

source: Finished with %s (exit status %d)
pl: Skoñczono z %s (status wyj¶cia %d)

source: %s: Error %d while executing fsck.%s for %s
pl: %s: B³±d %d podczas wykonywania fsck.%s dla %s

source: Either all or none of the filesystem types passed to -t must be prefixed with 'no' or '!'.
pl: Albo wszystkie, albo ¿aden rodzaj systemu plików z podanych po -t musi byæ poprzedzony 'no' lub '!'.

source: Couldn't allocate memory for filesystem types
pl: Nie mo¿na przydzieliæ pamiêci na rodzaje systemów plików

source: %s: skipping bad line in /etc/fstab: bind mount with nonzero fsck pass number
pl: %s: pominiêto b³êdn± liniê w /etc/fstab: montowanie bind z niezerowym numerem przebiegu fsck

source: fsck: cannot check %s: fsck.%s not found
pl: fsck: nie mo¿na sprawdziæ %s: fsck.%s nie znaleziony

source: Checking all file systems.
pl: Sprawdzanie wszystkich systemów plików.

source: --waiting-- (pass %d)
pl: --oczekiwanie-- (przebieg %d)

source: Usage: fsck [-AMNPRTV] [ -C [ fd ] ] [-t fstype] [fs-options] [filesys ...]
pl: Sk³adnia: fsck [-AMNPRTV] [ -C [ deskryptor ] ] [-t rodzaj-fs] [opcje-fs] [system-plików ...]

source: %s: too many devices
pl: %s: za du¿o urz±dzeñ

source: %s: too many arguments
pl: %s: za du¿o parametrów

source: Usage: %s [-RVadlv] [files...]
pl: Sk³adnia: %s [-RVadlv] [pliki...]

source: While reading flags on %s
pl: Podczas odczytu flag %s

source: While reading version on %s
pl: Podczas odczytu wersji %s

source: Usage: %s [-c|-l filename] [-b block-size] [-f fragment-size] [-i bytes-per-inode] [-I inode-size] [-J journal-options] [-G meta group size] [-N number-of-inodes] [-m reserved-blocks-percentage] [-o creator-os] [-g blocks-per-group] [-L volume-label] [-M last-mounted-directory] [-O feature[,...]] [-r fs-revision] [-E extended-option[,...]] [-T fs-type] [-U UUID] [-jnqvFKSV] device [blocks-count]
pl: Sk³adnia: %s [-c|-l nazwa-pliku] [-b rozm.bloku] [-f rozm.fragm.] [-i bajtów-na-i-wêze³] [-I rozm-i-wêz³a] [-J opcje-kroniki] [-G rozmiar metagrupy] [-N liczba-i-wêz³ów] [-m procent-rezerw.-bloków] [-o os-twórcy] [-g bloków-w-grupie] [-L etykieta-wolumenu] [-M ost.-mont.-katalog] [-O cecha[,...]] [-r wersja-fs] [-E opcja-rozszerzona[,...]] [-T rodzaj-fs] [-U UUID] [-jnqvFKSV] urz±dzenie [liczba-bloków]

source: Running command: %s
pl: Uruchamianie polecenia: %s

source: while trying to run '%s'
pl: podczas próby uruchomienia '%s'

source: while processing list of bad blocks from program
pl: podczas przetwarzania listy wadliwych bloków z programu

source: Block %d in primary superblock/group descriptor area bad.
pl: Wadliwy blok %d w g³ównym superbloku/obszarze deskryptora grup.

source: Blocks %u through %u must be good in order to build a filesystem.
pl: Bloki od %u do %u musz± byæ dobre, aby stworzyæ system plików.

source: Aborting....
pl: Przerwano...

source: Warning: the backup superblock/group descriptors at block %u contain bad blocks.
pl: Uwaga: zapasowy superblok/deskryptory grup w bloku %u zawieraj± wadliwe bloki.

source: while marking bad blocks as used
pl: podczas zaznaczania wadliwych bloków jako u¿ywane

source: done
pl: zakoñczono

source: Writing inode tables:
pl: Zapis tablicy i-wêz³ów:

source: Could not write %d blocks in inode table starting at %u: %s
pl: Nie mo¿na zapisaæ %d bloków w tablicy i-wêz³ów pocz±wszy od %u: %s

source: while creating root dir
pl: podczas tworzenia g³ównego katalogu

source: while reading root inode
pl: podczas odczytu g³ównego i-wêz³a

source: while setting root inode ownership
pl: podczas ustawiania w³a¶ciciela g³ównego i-wêz³a

source: while creating /lost+found
pl: podczas tworzenia /lost+found

source: while looking up /lost+found
pl: podczas szukania /lost+found

source: while expanding /lost+found
pl: podczas rozszerzania /lost+found

source: while setting bad block inode
pl: podczas ustawiania i-wêz³a wadliwych bloków

source: Out of memory erasing sectors %d-%d
pl: Brak pamiêci podczas czyszczenia sektorów %d-%d

source: Warning: could not read block 0: %s
pl: Uwaga: nie mo¿na odczytaæ bloku 0: %s

source: Warning: could not erase sector %d: %s
pl: Uwaga: nie mo¿na wyczy¶ciæ sektora %d: %s

source: while initializing journal superblock
pl: podczas inicjalizacji superbloku kroniki

source: Zeroing journal device:
pl: Zerowanie urz±dzenia kroniki:

source: while zeroing journal device (block %u, count %d)
pl: podczas zerowania urz±dzenia kroniki (blok %u, liczba %d)

source: while writing journal superblock
pl: podczas zapisu superbloku kroniki

source: warning: %u blocks unused.
pl: uwaga: %u bloków nie u¿ywanych.

source: Filesystem label=%s
pl: Etykieta systemu plików=%s

source: OS type:
pl: Typ OS:

source: Block size=%u (log=%u)
pl: Rozmiar bloku=%u (log=%u)

source: Fragment size=%u (log=%u)
pl: Rozmiar fragmentu=%u (log=%u)

source: Stride=%u blocks, Stripe width=%u blocks
pl: Stride=%u bloków, szeroko¶æ Stripe=%u bloków

source: %u inodes, %u blocks
pl: %u i-wêz³ów, %u bloków

source: %u blocks (%2.2f%%) reserved for the super user
pl: %u bloków (%2.2f%%) zarezerwowanych dla superu¿ytkownika

source: First data block=%u
pl: Pierwszy blok danych=%u

source: Maximum filesystem blocks=%lu
pl: Maksymalna liczba bloków systemu plików=%lu

source: %u block groups
pl: %u grup bloków

source: %u block group
pl: %u grupa bloków

source: %u blocks per group, %u fragments per group
pl: %u bloków w grupie, %u fragmentów w grupie

source: %u inodes per group
pl: %u i-wêz³ów w grupie

source: Superblock backups stored on blocks:
pl: Kopie zapasowe superbloku zapisane w blokach:

source: Invalid stride parameter: %s
pl: B³êdny parametr stride: %s

source: Invalid stripe-width parameter: %s
pl: B³êdny parametr stripe-width: %s

source: Invalid resize parameter: %s
pl: B³êdny parametr resize: %s

source: The resize maximum must be greater than the filesystem size.
pl: Maksymalny rozmiar (resize) musi byæ wiêkszy od rozmiaru systemu plików.

source: On-line resizing not supported with revision 0 filesystems
pl: Zmiana rozmiaru w locie nie jest obs³ugiwana przez systemy plików w wersji 0

source: Bad option(s) specified: %s Extended options are separated by commas, and may take an argument which is set off by an equals ('=') sign. Valid extended options are: stride=<RAID per-disk data chunk in blocks> stripe-width=<RAID stride * data disks in blocks> resize=<resize maximum size in blocks> lazy_itable_init=<0 to disable, 1 to enable> test_fs
pl: Podano b³êdne opcje: %s Opcje rozszerzone s± oddzielane przecinkami i mog± przyjmowaæ parametr, który jest ustawiany znakiem '='. Poprawne opcje rozszerzone to: stride=<rozmiar porcji danych RAID na dysku w blokach> stripe-width=<RAID stride * liczba dysków danych w blokach> resize=<maksymalny rozmiar powiêkszenia w blokach> lazy_itable_init=<0 aby wy³±czyæ, 1 aby w³±czyæ> test_fs

source: Warning: RAID stripe-width %u not an even multiple of stride %u.
pl: Uwaga: RAID stripe-width %u nie jest parzyst± wielokrotno¶ci± stride %u.

source: Syntax error in mke2fs config file (%s, line #%d) %s
pl: B³±d sk³adni w pliku konfiguracyjnym mke2fs (%s, linia %d) %s

source: Invalid filesystem option set: %s
pl: Ustawiona b³êdna opcja systemu plików: %s

source: Warning! Your mke2fs.conf file does not define the %s filesystem type.
pl: Uwaga! Plik mke2fs.conf nie okre¶la typu systemu plików %s.

source: You probably need to install an updated mke2fs.conf file.
pl: Prawdopodobnie trzeba zainstalowaæ uaktualniony plik mke2fs.conf.

source: invalid block size - %s
pl: b³êdny rozmiar bloku - %s

source: Warning: blocksize %d not usable on most systems.
pl: Uwaga: rozmiar bloku %d nie u¿ywalny na wiêkszo¶ci systemów.

source: invalid fragment size - %s
pl: z³y rozmiar fragmentu - %s

source: Warning: fragments not supported. Ignoring -f option
pl: Uwaga: fragmenty nie obs³ugiwane. Opcja -f zignorowana

source: Illegal number for blocks per group
pl: B³êdna liczba bloków w grupie

source: blocks per group must be multiple of 8
pl: liczba bloków w grupie musi byæ wielokrotno¶ci± 8

source: Illegal number for flex_bg size
pl: Niedopuszczalny rozmiar flex_bg

source: flex_bg size must be a power of 2
pl: rozmiar flex_bg musi byæ potêg± 2

source: invalid inode ratio %s (min %d/max %d)
pl: b³êdny stosunek i-wêz³ów %s (min %d/max %d)

source: in malloc for bad_blocks_filename
pl: w malloc dla bad_blocks_filename

source: invalid reserved blocks percent - %s
pl: b³êdny procent zarezerwowanych bloków - %s

source: bad revision level - %s
pl: b³êdny poziom wersji - %s

source: invalid inode size - %s
pl: b³êdny rozmiar i-wêz³a - %s

source: bad num inodes - %s
pl: b³êdna liczba i-wêz³ów - %s

source: while trying to open journal device %s
pl: podczas próby otwarcia urz±dzenia kroniki %s

source: Journal dev blocksize (%d) smaller than minimum blocksize %d
pl: Rozmiar bloku urz±dzenia z kronik± (%d) mniejszy od minimalnego %d

source: Using journal device's blocksize: %d
pl: U¿ycie rozmiaru bloku urz±dzenia kroniki: %d

source: %d-byte blocks too big for system (max %d)
pl: %d-bajtowe bloki s± zbyt du¿e dla systemu (max %d)

source: Warning: %d-byte blocks too big for system (max %d), forced to continue
pl: Uwaga: %d-bajtowe bloki s± zbyt du¿e dla systemu (max %d), wymuszono kontynuacjê

source: invalid blocks count - %s
pl: b³êdna liczba bloków - %s

source: filesystem
pl: system plików

source: %s: Size of device %s too big to be expressed in 32 bits using a blocksize of %d.
pl: %s: Rozmiar urz±dzenia %s jest zbyt du¿y, aby wyraziæ go w 32 bitach przy u¿yciu rozmiaru bloku %d.

source: while trying to determine filesystem size
pl: podczas próby okre¶lenia rozmiaru systemu plików

source: Couldn't determine device size; you must specify the size of the filesystem
pl: Nie mo¿na okre¶liæ rozmiaru urz±dzenia; rozmiar systemu plików musi byæ podany

source: Device size reported to be zero. Invalid partition specified, or partition table wasn't reread after running fdisk, due to a modified partition being busy and in use. You may need to reboot to re-read your partition table.
pl: Odczytany rozmiar urz±dzenia wynosi zero. Podano b³êdn± partycjê lub tablica partycji nie by³a odczytana ponownie po uruchomieniu fdiska z powodu zajêtej modyfikowanej partycji. Ponowny odczyt tablicy partycji mo¿e wymagaæ rebootu.

source: Filesystem larger than apparent device size.
pl: System plików wiêkszy od widocznego rozmiaru urz±dzenia.

source: Failed to parse fs types list
pl: Nie uda³o siê przeanalizowaæ listy typów systemów plików

source: fs_types for mke2fs.conf resolution:
pl: Rozwiniêcie fs_types dla mke2fs.conf:

source: Filesystem features not supported with revision 0 filesystems
pl: Cechy systemu plików nie obs³ugiwane przez systemy plików w wersji 0

source: Sparse superblocks not supported with revision 0 filesystems
pl: Rzadkie superbloki nie s± obs³ugiwane przez systemy plików w wersji 0

source: Journals not supported with revision 0 filesystems
pl: Kroniki nie s± obs³ugiwane przez systemy plików w wersji 0

source: The resize_inode and meta_bg features are not compatible. They can not be both enabled simultaneously.
pl: Cechy resize_inode i meta_bg nie s± kompatybilne. Nie mo¿na ich w³±czyæ jednocze¶nie.

source: while trying to determine hardware sector size
pl: podczas próby okre¶lenia rozmiaru sprzêtowego sektora

source: while trying to determine physical sector size
pl: podczas próby okre¶lenia rozmiaru sektora fizycznego

source: while setting blocksize; too small for device
pl: podczas ustawiania rozmiaru bloku; zbyt ma³y dla urz±dzenia

source: Warning: specified blocksize %d is less than device physical sectorsize %d, forced to continue
pl: Uwaga: podany rozmiar bloku %d jest mniejszy ni¿ rozmiar sektora fizycznego %d; wymuszono kontynuacjê

source: warning: Unable to get device geometry for %s
pl: uwaga: nie uda³o siê odczytaæ geometrii urz±dzenia dla %s

source: %s alignment is offset by %lu bytes.
pl: Wyrównanie %s jest przesuniête o %lu bajtów.
