/*
 * qspi - Broadcom QSPI specific definitions
 *
 * Copyright (C) 2015, Broadcom Corporation. All Rights Reserved.
 * 
 * Permission to use, copy, modify, and/or distribute this software for any
 * purpose with or without fee is hereby granted, provided that the above
 * copyright notice and this permission notice appear in all copies.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
 * WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
 * SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
 * WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION
 * OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN
 * CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
 *
 * $Id: $
 */

#ifndef	_qspi_core_h_
#define	_qspi_core_h_

/* cpp contortions to concatenate w/arg prescan */
#ifndef PAD
#define	_PADLINE(line)	pad ## line
#define	_XSTR(line)	_PADLINE(line)
#define	PAD		_XSTR(__LINE__)
#endif	/* PAD */

typedef volatile struct {
	/* BSPI */
	uint32 bspi_revision_id;		/* 0x0 */
	uint32 bspi_scratch;			/* 0x4 */
	uint32 bspi_mast_n_boot_ctrl;		/* 0x8 */
	uint32 bspi_busy_status;		/* 0xc */
	uint32 bspi_intr_status;		/* 0x10 */
	uint32 bspi_b0_status;			/* 0x14 */
	uint32 bspi_b0_ctrl;			/* 0x18 */
	uint32 bspi_b1_status;			/* 0x1c */
	uint32 bspi_b1_ctrl;			/* 0x20 */
	uint32 bspi_strap_override_ctrl;	/* 0x24 */
	uint32 bspi_flex_mode_enable;		/* 0x28 */
	uint32 bspi_bits_per_cycle;		/* 0x2c */
	uint32 bspi_bits_per_phase;		/* 0x30 */
	uint32 bspi_cmd_and_mode_byte;		/* 0x34 */
	uint32 bspi_bspi_flash_upper_addr_byte;	/* 0x38 */
	uint32 bspi_bspi_xor_value;		/* 0x3c */
	uint32 bspi_bspi_xor_enable;		/* 0x40 */
	uint32 bspi_bspi_pio_mode_enable;	/* 0x44 */
	uint32 bspi_bspi_pio_iodir;		/* 0x48 */
	uint32 bspi_bspi_pio_data;		/* 0x4c */
	uint32 PAD[44];				/* 0x50 ~ 0xfc */

	/* RAF */
	uint32 raf_start_addr;			/* 0x100 */
	uint32 raf_num_words;			/* 0x104 */
	uint32 raf_ctrl;			/* 0x108 */
	uint32 raf_fullness;			/* 0x10c */
	uint32 raf_watermark;			/* 0x110 */
	uint32 raf_status;			/* 0x114 */
	uint32 raf_read_data;			/* 0x118 */
	uint32 raf_word_cnt;			/* 0x11c */
	uint32 raf_curr_addr;			/* 0x120 */
	uint32 PAD[55];				/* 0x124 ~ 0x1fc */

	/* MSPI */
	uint32 mspi_spcr0_lsb;			/* 0x200 */
	uint32 mspi_spcr0_msb;			/* 0x204 */
	uint32 mspi_spcr1_lsb;			/* 0x208 */
	uint32 mspi_spcr1_msb;			/* 0x20c */
	uint32 mspi_newqp;			/* 0x210 */
	uint32 mspi_endqp;			/* 0x214 */
	uint32 mspi_spcr2;			/* 0x218 */
	uint32 PAD;				/* 0x21c */
	uint32 mspi_mspi_status;		/* 0x220 */
	uint32 mspi_cptqp;			/* 0x224 */
	uint32 PAD[6];				/* 0x228 ~ 0x23c */
	uint32 mspi_txram[32];			/* 0x240 ~ 0x2b8 */
	uint32 mspi_rxram[32];			/* 0x2c0 ~ 0x33c */
	uint32 mspi_cdram[16];			/* 0x340 ~ 0x37c */
	uint32 mspi_write_lock;			/* 0x380 */
	uint32 mspi_disable_flush_gen;		/* 0x384 */
	uint32 PAD[6];				/* 0x388 ~ 0x39C */

	/* Interrupt */
	uint32 intr_raf_lr_fullness_reached;	/* 0x3a0 */
	uint32 intr_raf_lr_truncated;		/* 0x3a4 */
	uint32 intr_raf_lr_impatient;		/* 0x3a8 */
	uint32 intr_raf_lr_session_done;	/* 0x3ac */
	uint32 intr_raf_lr_overread;		/* 0x3b0 */
	uint32 intr_mspi_done;			/* 0x3b4 */
	uint32 intr_mspi_halt_set_transaction_done;	/* 0x3b8 */
} qspiregs_t;

/*
 * SPCR0_LSB - SPCR0_LSB REGISTER
 */
/* HIF_MSPI :: SPCR0_LSB :: reserved0 [31:08] */
#define MSPI_SPCR0_LSB_reserved0_MASK                     0xffffff00
#define MSPI_SPCR0_LSB_reserved0_SHIFT                    8

/* HIF_MSPI :: SPCR0_LSB :: SPBR [07:00] */
#define MSPI_SPCR0_LSB_SPBR_MASK                          0x000000ff
#define MSPI_SPCR0_LSB_SPBR_SHIFT                         0
#define MSPI_SPCR0_LSB_SPBR_DEFAULT                       0

/*
 * SPCR0_MSB - SPCR0_MSB Register
 */
/* HIF_MSPI :: SPCR0_MSB :: reserved0 [31:08] */
#define MSPI_SPCR0_MSB_reserved0_MASK                     0xffffff00
#define MSPI_SPCR0_MSB_reserved0_SHIFT                    8

/* HIF_MSPI :: SPCR0_MSB :: MSTR [07:07] */
#define MSPI_SPCR0_MSB_MSTR_MASK                          0x00000080
#define MSPI_SPCR0_MSB_MSTR_SHIFT                         7
#define MSPI_SPCR0_MSB_MSTR_DEFAULT                       1

