/////////////////////////////////////////////////////////////////////////////
// February of 2012. (C) Paragon Software
//
//
// Written by Alexander Mamaev
/////////////////////////////////////////////////////////////////////////////
// This file is under the terms of the GNU General Public License, version 2.
// http://www.gnu.org/licenses/gpl-2.0.html
// Filesystem journal-writing code for HFS+ (based on jbd2 implementation in Kernel).
/////////////////////////////////////////////////////////////////////////////
//
// This field is updated by CVS
//
static const char s_FileVer[] = "$Id: ufsdjnl.c 216367 2013-11-08 22:10:46Z shura $";

#include "config.h"

#include <linux/version.h>
#include <linux/module.h>
#include <linux/time.h>
#include <linux/fs.h>
#include <linux/errno.h>
#include <linux/slab.h>
#include <linux/init.h>
#include <linux/mm.h>
#include <linux/kthread.h>
#include <linux/vmalloc.h>
#include <linux/blkdev.h>
#include <linux/buffer_head.h>
#include <linux/proc_fs.h> // proc_mkdir
#include <linux/seq_file.h>

#include "jnl.h"


//
// Current module is supported in 2.6.20+ only
//
#if LINUX_VERSION_CODE < KERNEL_VERSION(2,6,20)

const struct jnl_operations jnl_op = {0};
static int __init
jnl_init( void ){ return 0; }
static void __exit
jnl_exit( void ){}

#else

#include <linux/freezer.h>
#include <linux/bit_spinlock.h>

#if defined HAVE_DECL_KMAP_ATOMIC_V1 && HAVE_DECL_KMAP_ATOMIC_V1
  #define atomic_kmap(p)    kmap_atomic( (p), KM_USER0 )
  #define atomic_kunmap(p)  kunmap_atomic( (p), KM_USER0 )
#else
  #define atomic_kmap(p)    kmap_atomic( (p) )
  #define atomic_kunmap(p)  kunmap_atomic( (p) )
#endif

#if LINUX_VERSION_CODE >= KERNEL_VERSION(2,6,26)
  #define kmem_cache_allocZ(c)    kmem_cache_alloc( (c), GFP_NOFS | __GFP_ZERO )
#elif defined HAVE_DECL_KMEM_CACHE_ZALLOC && HAVE_DECL_KMEM_CACHE_ZALLOC
  #define kmem_cache_allocZ(c)    kmem_cache_zalloc( (c), GFP_NOFS )
#else
  #error "Unknown version of kmem_cache_zalloc"
//  void *p = kmem_cache_alloc( (c), GFP_KERNEL );
  //if ( NULL != p )
    //memset( p, 0, kmem_cache_size( (c) ) );
#endif

#if defined CONFIG_LBD | defined CONFIG_LBDAF
  // sector_t - 64 bit value
  #define PSCT      "ll"
#else
  // sector_t - 32 bit value
  #define PSCT      "l"
#endif

#define IN
#define OUT

//#define async_commit

//#define JNL_PARANOID_IOFAIL

#if defined UFSD_TRACE && defined UFSD_DEBUG

  // Trace get_write/get_create access
  #define JNL_TRACE_LEVEL_ACCESS      0x00000001
  #define JNL_TRACE_LEVEL_DIRTY_META  0x00000002
  #define JNL_TRACE_LEVEL_HANDLE      0x00000004
  #define JNL_TRACE_LEVEL_COMMIT      0x00000008
  #define JNL_TRACE_LEVEL_HDR         0x00000010
  #define JNL_TRACE_LEVEL_THREAD      0x00000020
  #define JNL_TRACE_LEVEL_CHECK       0x00000040
  #define JNL_TRACE_LEVEL_JHDR        0x00000080
  #define JNL_TRACE_LEVEL_IO          0x00000100
  #define JNL_TRACE_LEVEL_REVOKE      0x00000200

  #define JNL_EXPENSIVE_CHECKING "enable more expensive internal consistency checks"

  static unsigned jnl_enable_debug = 0;//~(JNL_TRACE_LEVEL_ACCESS|JNL_TRACE_LEVEL_HANDLE|JNL_TRACE_LEVEL_JHDR|JNL_TRACE_LEVEL_DIRTY_META);
//  KERN_DEBUG
  #define jnl_debug( n, f, a... )                         \
    do {                                                  \
      if ( 0 == (n) || 0 != ((n) & jnl_enable_debug) ) {  \
        printk( KERN_NOTICE f, ## a );                    \
      }                                                   \
    } while ( 0 )

  #define J_ASSERT( x )  BUG_ON( !(x) )

#else

  //
  // Release version
  //
  #define jnl_debug( n, f, a... )
  #define J_ASSERT( x )  BUG_ON( !(x) )
//  #define J_ASSERT( x )
  #undef TRACE_ONLY
  #define TRACE_ONLY(x)
  #undef UFSD_TRACE

#endif

#ifdef JNL_PARANOID_IOFAIL
  #define J_EXPECT( expr, why... )        J_ASSERT( expr )
#else
  #define __journal_expect( expr, why... )  \
    ( {                                \
        int val = ( expr );             \
        if ( !val ) {                   \
          printk( KERN_ERR"JNL unexpected failure: %s: %s;\n", __func__, #expr );  \
          printk( KERN_ERR why "\n" );  \
        }                             \
        val;                          \
    } )
  #define J_EXPECT( expr, why... )  __journal_expect( expr, ## why )
#endif


//===============================================
//           GLOBALS
//===============================================

#define UFSD_PACKAGE_STAMP ", " __DATE__" "__TIME__

static const char s_DriverVer[] = PACKAGE_VERSION
#ifdef PACKAGE_TAG
   " " PACKAGE_TAG
#else
   UFSD_PACKAGE_STAMP
#endif
#if defined CONFIG_LBD | defined CONFIG_LBDAF
  ", LBD=ON"
#else
  ", LBD=OFF"
#endif
  ;


// jnl_head storage management
static struct kmem_cache *jnl_handle_cache;
static struct kmem_cache *jnl_head_cache;
static struct kmem_cache *jnl_revoke_record_cache;
#ifdef CONFIG_DEBUG_LOCK_ALLOC
static struct lock_class_key jnl_handle_key;
#endif

#define JNL_MAX_SLABS     9
// supports block sizes [512 128k] : [2^9 - 2^17]
static struct kmem_cache *jnl_slab[JNL_MAX_SLABS];

static const char jnl_slab_names[9][JNL_MAX_SLABS] = {
  "jnl_0k", "jnl_1k", "jnl_2k", "jnl_4k", "jnl_8k", "jnl_16k", "jnl_32k", "jnl_64k", "jnl_128k"
};

#define journal_oom_retry 1

#define JOURNAL_REVOKE_DEFAULT_HASH       256
#define JOURNAL_REVOKE_DEFAULT_HASH_SHIFT 8

// The default maximum commit age, in seconds.
#define JNL_DEFAULT_MAX_COMMIT_AGE 5

#define JNL_MIN_JOURNAL_BLOCKS 1024


//=========================================================
//
//       On disk structs
//
// All fields always in current endian
//=========================================================

typedef struct block_info{
  u64   bnum;   // 0x00: block # on the file system device
  u32   bsize;  // 0x08: in bytes
  u32   cksum;  // 0x0C
} block_info;

// number of bytes to checksum in a block_list_header
#define BLHDR_CHECKSUM_SIZE     0x20

#define BLHDR_FLAGS_CHECK_CHECKSUMS   0x0001
#define BLHDR_FLAGS_FIRST_HEADER      0x0002

typedef struct block_list_header{

  u16 max_blocks;     // 0x00: max number of blocks in this chunk
  u16 num_blocks;     // 0x02: number of valid block numbers plus one in 'binfo'
  u32 bytes_used;     // 0x04: how many bytes of this tbuffer are used
  u32 checksum;       // 0x08: checksum of first 0x20 bytes
  u32 flags;          // 0x0C: BLHDR_FLAGS_XXX

  u64 next;           // 0x10: if 0 then this is the last block list
  u32 zero;           // 0x18:
  u32 sequence_num;   // 0x1C:

  //
  // To iterate over binfo use the following cycle
  // for ( i = 0; i < num_blocks - 1; i++ )
  //   binfo[i]
  //
  block_info  binfo[1];   // 0x20:

} block_list_header;


#define JOURNAL_HEADER_MAGIC      0x4a4e4c78  // 'JNLx'

//
// The journal header
//
typedef struct jnl_header {
  u32 magic;          // 0x00: 'JNLx' or 'JHDR'
  u32 endian;         // 0x04: ENDIAN_MAGIC
  u64 start;          // 0x08: zero-based byte offset of the start of the first transaction
  u64 end;            // 0x10: zero-based byte offset of where free space begins
  u64 size;           // 0x18: size in bytes of the entire journal
  u32 blhdr_size;     // 0x20: size in bytes of each block_list_header in the journal
  u32 checksum;       // 0x24: checksum of first 0x2C bytes
  u32 jhdr_size;      // 0x28: block size ( in bytes ) of the journal header
  u32 sequence;       // 0x2C: a monotonically increasing value assigned to all txn's
  TRACE_ONLY( u32 overlaps; )       // 0x30: to debug

} jnl_header;


#define JOURNAL_HEADER_CKSUM_SIZE  ( offsetof( struct jnl_header, sequence ) )


//=========================================================
//
//       In memory structs
//
//=========================================================

// journaling buffer types  jlist
#define BJ_None     0 // Not journaled
#define BJ_Metadata 1 // Normal journaled metadata
#define BJ_Forget   2 // Buffer superseded by this transaction
#define BJ_IO       3 // Buffer is for temporary IO use
#define BJ_Shadow   4 // Buffer contents being shadowed to the log
#define BJ_LogCtl   5 // Buffer contains log blhdr's
#define BJ_Reserved 6 // Buffer is reserved for access by journal
#define BJ_Types    7


typedef struct jnl_head {

  // Points back to our buffer_head. [jnl_lock_bh_hdr()]
  struct buffer_head *bh;

  // Reference count. [jnl_lock_bh_hdr()]
