Repository: RMerl/asuswrt-merlin
Catalog: release/src/router/libgpg-error-1.10/po/*.po
Languages: pl

source: Unspecified source
pl: Nie podane ¼ród³o

source: GPG Agent
pl: Agent GPG

source: Any source
pl: Dowolne ¼ród³o

source: User defined source 1
pl: Zdefiniowane przez u¿ytkownika ¼ród³o 1

source: User defined source 2
pl: Zdefiniowane przez u¿ytkownika ¼ród³o 2

source: User defined source 3
pl: Zdefiniowane przez u¿ytkownika ¼ród³o 3

source: User defined source 4
pl: Zdefiniowane przez u¿ytkownika ¼ród³o 4

source: Unknown source
pl: Nieznane ¼ród³o

source: Success
pl: Sukces

source: General error
pl: B³±d ogólny

source: Unknown packet
pl: Nieznany pakiet

source: Unknown version in packet
pl: Nieznana wersja w pakiecie

source: Invalid public key algorithm
pl: Niepoprawny algorytm klucza publicznego

source: Invalid digest algorithm
pl: Niepoprawny algorytm skrótu

source: Bad public key
pl: B³êdny klucz publiczny

source: Bad secret key
pl: B³êdny klucz tajny

source: Bad signature
pl: B³êdna sygnatura

source: No public key
pl: Brak klucza publicznego

source: Checksum error
pl: B³±d sumy kontrolnej

source: Bad passphrase
pl: B³êdne has³o

source: Invalid cipher algorithm
pl: Niepoprawny algorytm szyfru

source: Keyring open
pl: Zbiór kluczy otwarty

source: Invalid packet
pl: Niepoprawny pakiet

source: Invalid armor
pl: Niepoprawne opakowanie

source: No user ID
pl: Brak identyfikatora u¿ytkownika

source: No secret key
pl: Brak klucza tajnego

source: Wrong secret key used
pl: U¿yto niew³a¶ciwego klucza tajnego

source: Bad session key
pl: B³êdny klucz sesji

source: Unknown compression algorithm
pl: Nieznany algorytm kompresji

source: Number is not prime
pl: Liczba nie jest pierwsza

source: Invalid encoding method
pl: Niepoprawna metoda kodowania

source: Invalid encryption scheme
pl: Niepoprawny uk³ad szyfrowania

source: Invalid signature scheme
pl: Niepoprawny uk³ad sygnatury

source: Invalid attribute
pl: Niepoprawny atrybut

source: No value
pl: Brak warto¶ci

source: Not found
pl: Nie znaleziono

source: Value not found
pl: Warto¶æ nie znaleziona

source: Syntax error
pl: B³±d sk³adni

source: Bad MPI value
pl: B³êdna warto¶æ MPI

source: Invalid passphrase
pl: Niepoprawne has³o

source: Invalid signature class
pl: Niepoprawna klasa sygnatury

source: Resources exhausted
pl: Zasoby wyczerpane

source: Invalid keyring
pl: Niepoprawny zbiór kluczy

source: Trust DB error
pl: B³±d bazy zaufania

source: Bad certificate
pl: B³êdny certyfikat

source: Invalid user ID
pl: Niepoprawny identyfikator u¿ytkownika

source: Unexpected error
pl: Nieoczekiwany b³±d

source: Time conflict
pl: Konflikt czasu

source: Keyserver error
pl: B³±d serwera kluczy

source: Wrong public key algorithm
pl: Niew³a¶ciwy algorytm klucza publicznego

source: Tribute to D. A.
pl: Pamiêci D. A.

source: Weak encryption key
pl: S³aby klucz szyfrowania

source: Invalid key length
pl: Niepoprawna d³ugo¶æ klucza

source: Invalid argument
pl: Niepoprawny argument

source: Syntax error in URI
pl: B³±d sk³adni w URI

source: Invalid URI
pl: B³êdne URI

source: Network error
pl: B³±d sieci

source: Unknown host
pl: Nieznany host

source: Selftest failed
pl: Test wewnêtrzny nie powiód³ siê

source: Data not encrypted
pl: Dane nie zaszyfrowane

source: Data not processed
pl: Dane nie przetworzone

source: Unusable public key
pl: Bezu¿yteczny klucz publiczny

source: Unusable secret key
pl: Bezu¿yteczny klucz tajny

source: Invalid value
pl: Niepoprawna warto¶æ

source: Bad certificate chain
pl: B³êdny ³añcuch certyfikatów

source: Missing certificate
pl: Brakuj±cy certyfikat

source: No data
pl: Brak danych

source: Bug
pl: B³±d w kodzie

source: Not supported
pl: Nie obs³ugiwane

source: Invalid operation code
pl: Niepoprawny kod operacji

source: Timeout
pl: Up³yn±³ limit czasu

source: Internal error
pl: B³±d wewnêtrzny

source: EOF (gcrypt)
pl: Koniec pliku (gcrypt)

source: Invalid object
pl: Niepoprawny obiekt

source: Provided object is too short
pl: Dostarczony obiekt jest zbyt ma³y

source: Provided object is too large
pl: Dostarczony obiekt jest zbyt du¿y

source: Missing item in object
pl: Brak elementu w obiekcie

source: Not implemented
pl: Nie zaimplementowane

source: Conflicting use
pl: Konflikt u¿ycia

source: Invalid cipher mode
pl: Niepoprawny tryb szyfru

source: Invalid flag
pl: Niepoprawna flaga

source: Invalid handle
pl: Niepoprawny uchwyt

source: Result truncated
pl: Wynik skrócony

source: Incomplete line
pl: Niekompletna linia

source: Invalid response
pl: Niepoprawna odpowied¼

source: No agent running
pl: Agent nie uruchomiony

source: agent error
pl: b³±d agenta

source: Invalid data
pl: Niepoprawne dane

source: Unspecific Assuan server fault
pl: Nieokre¶lone niepowodzenie serwera Assuan

source: General Assuan error
pl: B³±d ogólny Assuana

source: Invalid session key
pl: Niepoprawny klucz sesji

source: Invalid S-expression
pl: Niepoprawne S-wyra¿enie

source: Unsupported algorithm
pl: Nieobs³ugiwany algorytn

source: No pinentry
pl: Brak pinentry

source: pinentry error
pl: B³±d pinentry

source: Bad PIN
pl: B³êdny PIN

source: Invalid name
pl: Niepoprawna nazwa

source: Bad data
pl: B³êdne dane

source: Invalid parameter
pl: Niepoprawny parametr

source: Wrong card
pl: Niew³a¶ciwa karta

source: No dirmngr
pl: Brak dirmngr

source: dirmngr error
pl: B³±d dirmngr

source: Certificate revoked
pl: Certyfikat anulowany

source: No CRL known
pl: Nieznane CRL

source: CRL too old
pl: CRL zbyt stare

source: Line too long
pl: Linia zbyt d³uga

source: Not trusted
pl: Nie zaufany

source: Operation cancelled
pl: Operacja anulowana

source: Bad CA certificate
pl: B³êdny certyfikat CA

source: Certificate expired
pl: Certyfikat wygas³

source: Certificate too young
pl: Certyfikat zbyt m³ody

source: Unsupported certificate
pl: Nieobs³ugiwany certyfikat

source: Unknown S-expression
pl: Nieznane S-wyra¿enie

source: Unsupported protection
pl: Nieobs³ugiwane zabezpieczenie

source: Corrupted protection
pl: Uszkodzone zabezpieczenie

source: Ambiguous name
pl: Niejednoznaczna nazwa

source: Card error
pl: B³±d karty

source: Card reset required
pl: Wymagany reset karty

source: Card removed
pl: Karta wyci±gniêta

source: Invalid card
pl: Niepoprawna karta

source: Card not present
pl: Karta nieobecna

source: No PKCS15 application
pl: Brak aplikacji PKCS15

source: Not confirmed
pl: Brak potwierdzenia

source: Configuration error
pl: B³±d konfiguracji

source: No policy match
pl: Brak zgodno¶ci polityki

source: Invalid index
pl: Niepoprawny indeks

source: Invalid ID
pl: Niepoprawny identyfikator

source: No SmartCard daemon
pl: Brak demona SmartCard

source: SmartCard daemon error
pl: B³±d demona SmartCard

source: Unsupported protocol
pl: Nieobs³ugiwany protokó³

source: Bad PIN method
pl: B³êdna metoda PIN-u

source: Card not initialized
pl: Karta nie zainicjowana

source: Unsupported operation
pl: Nieobs³ugiwana operacja

source: Wrong key usage
pl: Niew³a¶ciwe u¿ycie klucza

source: Nothing found
pl: Nic nie znaleziono

source: Wrong blob type
pl: Niew³a¶ciwy typ blob

source: Missing value
pl: Brak warto¶ci

source: Hardware problem
pl: Problem sprzêtowy

source: PIN blocked
pl: PIN zablokowany

source: Conditions of use not satisfied
pl: Warunki u¿ycia nie spe³nione

source: PINs are not synced
pl: PIN-y nie zsynchronizowane

source: Invalid CRL
pl: Niepoprawne CRL

source: BER error
pl: B³±d BER

source: Invalid BER
pl: Niepoprawne BER

source: Element not found
pl: Element nie znaleziony

source: Identifier not found
pl: Identyfikator nie znaleziony

source: Invalid tag
pl: Niepoprawny znacznik

source: Invalid length
pl: Niepoprawna d³ugo¶æ

source: Invalid key info
pl: Niepoprawna informacja klucza

source: Unexpected tag
pl: Nieoczekiwany znacznik

source: Not DER encoded
pl: Nie zakodowane DER

source: No CMS object
pl: Brak obiektu CMS

source: Invalid CMS object
pl: Niepoprawny obiekt CMS

source: Unknown CMS object
pl: Nieznany obiekt CMS

source: Unsupported CMS object
pl: Nieobs³ugiwany obiekt CMS

source: Unsupported encoding
pl: Nieobs³ugiwane kodowanie

source: Unsupported CMS version
pl: Nieobs³ugiwana wersja CMS

source: Unknown algorithm
pl: Nieznany algorytm

source: Invalid crypto engine
pl: Niepoprawny silnik kryptograficzny

source: Public key not trusted
pl: Klucz publiczny nie zaufany

source: Decryption failed
pl: Odszyfrowywanie nie powiod³o siê

source: Key expired
pl: Klucz wygas³

source: Signature expired
pl: Sygnatura wygas³a

source: Encoding problem
pl: Problem z kodowaniem

source: Invalid state
pl: Niepoprawny stan

source: Duplicated value
pl: Powtórzona warto¶æ

source: Missing action
pl: Brak akcji

source: ASN.1 module not found
pl: Nie znaleziono modu³u ASN.1

source: Invalid OID string
pl: Niepoprawny ³añcuch OID

source: Invalid time
pl: Niepoprawny czas

source: Invalid CRL object
pl: Niepoprawny obiekt CRL

source: Unsupported CRL version
pl: Nieobs³ugiwana wersja CRL

source: Invalid certificate object
pl: Niepoprawny obiekt certyfikatu

source: Unknown name
pl: Nieznana nazwa

source: A locale function failed
pl: Funkcja lokalizacji nie powiod³a siê

source: Not locked
pl: Nie zablokowany

source: Protocol violation
pl: Naruszenie protoko³u

source: Invalid MAC
pl: Niepoprawny MAC

source: Invalid request
pl: Niepoprawne ¿±danie

source: Unknown extension
pl: Nieznane rozszerzenie

source: Unknown critical extension
pl: Nieznane rozszerzenie krytyczne

source: Locked
pl: Zablokowany

source: Unknown option
pl: Nieznana opcja

source: Unknown command
pl: Nieznane polecenie

source: Not operational
pl: Nie gotowy

source: No passphrase given
pl: Nie podano has³a

source: No PIN given
pl: Nie podano PIN-u

source: Not enabled
pl: Nie w³±czony

source: No crypto engine
pl: Brak silnika kryptograficznego

source: Missing key
pl: Brak klucza

source: Too many objects
pl: Zbyt du¿o obiektów

source: Limit reached
pl: Osi±gniêto limit

source: Operation not yet finished
pl: Operacja jeszcze nie zakoñczona

source: Buffer too short
pl: Bufor zbyt ma³y

source: Invalid length specifier in S-expression
pl: Niepoprawne okre¶lenie d³ugo¶ci w S-wyra¿eniu

source: String too long in S-expression
pl: Zbyt d³ugi ³añcuch w S-wyra¿eniu

source: Unmatched parentheses in S-expression
pl: Niedopasowane nawiasy w S-wyra¿eniu

source: S-expression not canonical
pl: S-wyra¿enie nie kanoniczne

source: Bad character in S-expression
pl: B³êdny znak w S-wyra¿eniu

source: Bad quotation in S-expression
pl: B³êdne cytowanie w S-wyra¿eniu

source: Zero prefix in S-expression
pl: Zerowy prefiks w S-wyra¿eniu

source: Nested display hints in S-expression
pl: Zagnie¿d¿one podpowiedzi wy¶wietlania w S-wyra¿eniu

source: Unmatched display hints
pl: Niedopasowane podpowiedzi wy¶wietlania

source: Unexpected reserved punctuation in S-expression
pl: Nieoczekiwany zarezerwowany znak w S-wyra¿eniu

source: Bad hexadecimal character in S-expression
pl: B³êdny znak szesnastkowy w S-wyra¿eniu

source: Odd hexadecimal numbers in S-expression
pl: Nieparzysta liczba cyfr szesnastkowych w S-wyra¿eniu

source: Bad octal character in S-expression
pl: B³êdny znak ósemkowy w S-wyra¿eniu

source: General IPC error
pl: B³±d ogólny IPC

source: IPC accept call failed
pl: Wywo³anie accept dla IPC nie powiod³o siê

source: IPC connect call failed
pl: Wywo³anie connect dla IPC nie powiod³o siê

source: Invalid IPC response
pl: Niepoprawna odpowied¼ IPC

source: Invalid value passed to IPC
pl: Niepoprawna warto¶æ przekazana do IPC

source: Incomplete line passed to IPC
pl: Niekompletna linia przekazana do IPC

source: Line passed to IPC too long
pl: Linia przekazana do IPC zbyt d³uga

source: Nested IPC commands
pl: Zagnie¿d¿one polecenia IPC

source: No data callback in IPC
pl: Brak wywo³ania zwrotnego dla danych w IPC

source: No inquire callback in IPC
pl: Brak wywo³ania wstecznego dla zapytañ w IPC

source: Not an IPC server
pl: To nie jest serwer IPC

source: Not an IPC client
pl: To nie jest klient IPC

source: Problem starting IPC server
pl: Problem z uruchomieniem serwera IPC

source: IPC read error
pl: B³±d odczytu IPC

source: IPC write error
pl: B³±d zapisu IPC

source: Too much data for IPC layer
pl: Zbyt du¿o danych dla warstwy IPC

source: Unexpected IPC command
pl: Nieoczekiwane polecenie IPC

source: Unknown IPC command
pl: Nieznane polecenie IPC

source: IPC syntax error
pl: B³±d sk³adni IPC

source: IPC call has been cancelled
pl: Wywo³anie IPC zosta³o anulowane

source: No input source for IPC
pl: Brak ¼ród³a wej¶ciowego dla IPC

source: No output source for IPC
pl: Brak ¼ród³a wyj¶ciowego dla IPC

source: IPC parameter error
pl: B³±d parametru IPC

source: Unknown IPC inquire
pl: Nieznane zapytanie IPC

source: User defined error code 1
pl: Zdefiniowany przez u¿ytkownika kod b³êdu 1

source: User defined error code 2
pl: Zdefiniowany przez u¿ytkownika kod b³êdu 2

source: User defined error code 3
pl: Zdefiniowany przez u¿ytkownika kod b³êdu 3

source: User defined error code 4
pl: Zdefiniowany przez u¿ytkownika kod b³êdu 4

source: User defined error code 5
pl: Zdefiniowany przez u¿ytkownika kod b³êdu 5

source: User defined error code 6
pl: Zdefiniowany przez u¿ytkownika kod b³êdu 6

source: User defined error code 7
pl: Zdefiniowany przez u¿ytkownika kod b³êdu 7

source: User defined error code 8
pl: Zdefiniowany przez u¿ytkownika kod b³êdu 8

source: User defined error code 9
pl: Zdefiniowany przez u¿ytkownika kod b³êdu 9

source: User defined error code 10
pl: Zdefiniowany przez u¿ytkownika kod b³êdu 10

source: User defined error code 11
pl: Zdefiniowany przez u¿ytkownika kod b³êdu 11

source: User defined error code 12
pl: Zdefiniowany przez u¿ytkownika kod b³êdu 12

source: User defined error code 13
pl: Zdefiniowany przez u¿ytkownika kod b³êdu 13

source: User defined error code 14
pl: Zdefiniowany przez u¿ytkownika kod b³êdu 14

source: User defined error code 15
pl: Zdefiniowany przez u¿ytkownika kod b³êdu 15

source: User defined error code 16
pl: Zdefiniowany przez u¿ytkownika kod b³êdu 16

source: System error w/o errno
pl: B³±d systemowy bez errno

source: Unknown system error
pl: Nieznany b³±d systemu

source: End of file
pl: Koniec pliku

source: Unknown error code
pl: Nieznany kod b³êdu

source: Usage: %s GPG-ERROR [...]
pl: Sk³adnia: %s B£¡D-GPG [...]

source: %s: warning: could not recognize %s
pl: %s: uwaga: nie rozpoznano %s
